{"id": "t.1.1.1", "title": "Enki and Ninḫursaĝa", "paragraphs": [{"lineNumber": "1", "text": "1-4. Pure are the cities -- and you are the ones to whom they are allotted. Pure is Dilmun land. Pure is Sumer -- and you are the ones to whom it is allotted. Pure is Dilmun land. Pure is Dilmun land. Virginal is Dilmun land. Virginal is Dilmun land. Pristine is Dilmun land.", "properNames": ["Dilmun", "Sumer"], "missingText": []}, {"lineNumber": "1", "text": "5-10. He laid her down all alone in Dilmun, and the place where Enki had lain down with his spouse, that place was still virginal, that place was still pristine. He laid her down all alone in Dilmun, and the place where Enki had lain down with Ninsikila, that place was virginal, that place was pristine.", "properNames": ["Dilmun", "Enki", "Ninsikila"], "missingText": []}, {"lineNumber": "1", "text": "11-16. In Dilmun the raven was not yet cawing, the partridge not cackling. The lion did not slay, the wolf was not carrying off lambs, the dog had not been taught to make kids curl up, the pig had not learned that grain was to be eaten.", "properNames": ["Dilmun"], "missingText": []}, {"lineNumber": "1", "text": "17-19. When a widow has spread malt on the roof, the birds did not yet eat that malt up there. The pigeon then did not tuck the head under its wing.", "properNames": [], "missingText": []}, {"lineNumber": "1", "text": "20-26. No eye-diseases said there:  \"I am the eye disease.\" No headache said there:  \"I am the headache.\" No old woman belonging to it said there:  \"I am an old woman.\" No old man belonging to it said there:  \"I am an old man.\" No maiden in her unwashed state …… in the city. No man dredging a river said there:  \"It is getting dark.\" No herald made the rounds in his border district.", "properNames": [], "missingText": []}, {"lineNumber": "1", "text": "27-28. No singer sang an elulam there. No wailings were wailed in the city's outskirts there.", "properNames": [], "missingText": []}, {"lineNumber": "1", "text": "29-32. Ninsikila said to her father Enki:  \"You have given a city. You have given a city. What does your giving avail me? You have given a city, Dilmun. You have given a city. What does your giving avail me? You have given ……. You have given a city. What avails me your giving?\"", "properNames": ["Ninsikila", "Enki", "Dilmun"], "missingText": []}, {"lineNumber": "1", "text": "33-39.  \"You have given ……, a city that has no river quay. You have given a city. What does your giving avail me?\"1 line fragmentary  \"A city that has no fields, glebe or furrow\" 3 lines missing", "properNames": [], "missingText": ["1 line fragmentary", "3 lines missing"]}, {"lineNumber": "1", "text": "40-43. (Enki answered Ninsikila:)  \"When Utu steps up into heaven, fresh waters shall run out of the ground for you from the standing vessels (?) on Ezen's (?) shore, from Nanna's radiant high temple, from the mouth of the waters running underground.\"", "properNames": ["Enki", "Ninsikila", "Utu", "Ezen's", "Nanna's"], "missingText": []}, {"lineNumber": "1", "text": "44-49.  \"May the waters rise up from it into your great basins. May your city drink water aplenty from them. May Dilmun drink water aplenty from them. May your pools of salt water become pools of fresh water. May your city become an emporium on the quay for the Land. May Dilmun become an emporium on the quay for the Land.\"", "properNames": ["Dilmun"], "missingText": []}, {"lineNumber": "1", "text": "49A-49P.  \"May the land of Tukriš hand over to you gold from Ḫarali, lapis lazuli and ……. May the land of Meluḫa load precious desirable cornelian, meš wood of Magan and the best abba wood into large ships for you. May the land of Marḫaši yield you precious stones, topazes. May the land of Magan offer you strong, powerful copper, dolerite, u stone and šumin stone. May the Sea-land offer you its own ebony wood, …… of a king. May the 'Tent'-lands offer you fine multicoloured wools. May the land of Elam hand over to you choice wools, its tribute. May the manor of Urim, the royal throne dais, the city ……, load up into large ships for you sesame, august raiment, and fine cloth. May the wide sea yield you its wealth.\"", "properNames": ["Tukriš", "Ḫarali", "Meluḫa", "Magan", "Marḫaši", "Sea-land", "'Tent'-lands", "Elam", "Urim"], "missingText": []}, {"lineNumber": "1", "text": "49Q-49V. The city's dwellings are good dwellings. Dilmun's dwellings are good dwellings. Its grains are little grains, its dates are big dates, its harvests are triple ……, its wood is …… wood.", "properNames": ["Dilmun's"], "missingText": []}, {"lineNumber": "1", "text": "50-54. At that moment, on that day, and under that sun, when Utu stepped up into heaven, from the standing vessels (?) on Ezen's (?) shore, from Nanna's radiant high temple, from the mouth of the waters running underground, fresh waters ran out of the ground for her.", "properNames": ["Utu", "Ezen's", "Nanna's"], "missingText": []}, {"lineNumber": "1", "text": "55-62. The waters rose up from it into her great basins. Her city drank water aplenty from them. Dilmun drank water aplenty from them. Her pools of salt water indeed became pools of fresh water. Her fields, glebe and furrows indeed produced grain for her. Her city indeed became an emporium on the quay for the Land. Dilmun indeed became an emporium on the quay for the Land. At that moment, on that day, and under that sun, so it indeed happened.", "properNames": ["Dilmun"], "missingText": []}, {"lineNumber": "1", "text": "63-68. All alone the wise one, toward Nintur, the country's mother, Enki, the wise one, toward Nintur, the country's mother, was digging his phallus into the dykes, plunging his phallus into the reedbeds. The august one pulled his phallus aside and cried out:  \"No man take me in the marsh.\"", "properNames": ["Nintur", "Enki"], "missingText": []}, {"lineNumber": "1", "text": "69-74. Enki cried out:  \"By the life's breath of heaven I adjure you. Lie down for me in the marsh, lie down for me in the marsh, that would be joyous.\" Enki distributed his semen destined for Damgalnuna. He poured semen into Ninḫursaĝa's womb and she conceived the semen in the womb, the semen of Enki.", "properNames": ["Enki", "Damgalnuna", "Ninḫursaĝa's"], "missingText": []}, {"lineNumber": "1", "text": "75-87. But her one month was one day, but her two months were two days, but her three months were three days, but her four months were four days, but her five months were five days, but her six months were six days, but her seven months were seven days, but her eight months were eight days, but her nine months were nine days. In the month of womanhood, like fine (?) oil, like fine (?) oil, like oil of abundance, Nintur, mother of the country, like fine (?) oil, gave birth to Ninnisig.", "properNames": ["Nintur", "Ninnisig"], "missingText": []}, {"lineNumber": "1", "text": "88-96. In turn Ninnisig went out to the riverbank. Enki was able to see up there from in the marsh, he was able to see up there, he was. He said to his minister Isimud:  \"Is this nice youngster not to be kissed? Is this nice Ninnisig not to be kissed?\" His minister Isimud answered him:  \"Is this nice youngster not to be kissed? Is this nice Ninnisig not to be kissed? My master will sail, let me navigate. He will sail, let me navigate.\"", "properNames": ["Ninnisig", "Enki", "Isimud"], "missingText": []}, {"lineNumber": "1", "text": "97-107. First he put his feet in the boat, next he put them on dry land. He clasped her to the bosom, kissed her, Enki poured semen into the womb and she conceived the semen in the womb, the semen of Enki. But her one month was one day, but her two months were two days, but her nine months were nine days. In the month of womanhood, like fine (?) oil, like fine (?) oil, like oil of abundance, Ninnisig, like fine (?) oil, like fine (?) oil, like oil of abundance, gave birth to Ninkura.", "properNames": ["Enki", "Ninnisig", "Ninkura"], "missingText": []}, {"lineNumber": "1", "text": "108-116. In turn Ninkura went out to the riverbank. Enki was able to see up there from in the marsh, he was able to see up there, he was. He said to his minister Isimud:  \"Is this nice youngster not to be kissed? Is this nice Ninkura not to kissed?\" His minister Isimud answered him:  \"Kiss this nice youngster. Kiss this nice Ninkura. My master will sail, let me navigate. He will sail, let me navigate.\"", "properNames": ["Ninkura", "Enki", "Isimud"], "missingText": []}, {"lineNumber": "1", "text": "117-126. First he put his feet in the boat, next he put them on dry land. He clasped her to the bosom, kissed her, Enki poured semen into the womb and she conceived the semen in the womb, the semen of Enki. But her one month was one day, but her nine months were nine days. In the month of womanhood, like fine (?) oil, like fine (?) oil, like oil of abundance, Ninkura, like fine (?) oil, like fine (?) oil, like oil of abundance, gave birth to Uttu, the exalted (?) woman.", "properNames": ["Enki", "Ninkura", "Uttu"], "missingText": []}, {"lineNumber": "1", "text": "126A-126K. Ninkura in turn gave birth to Ninimma. She brought the child up and made her flourish. Ninimma in turn went out to the riverbank. Enki was towing his boat along and was able to see up there, ……. He laid eyes on Ninimma on the riverbank and said to his minister Isimud:  \"Have I ever kissed one like this nice youngster? Have I ever made love to one like nice Ninimma?\" His minister Isimud answered him:  \"My master will sail, let me navigate. He will sail, let me navigate.\"", "properNames": ["Ninkura", "Ninimma", "Enki", "Isimud"], "missingText": []}, {"lineNumber": "1", "text": "126L-126Q. First he put his feet in the boat, next he put them on dry land. He clasped her to the bosom, lying in her crotch, made love to the youngster and kissed her. Enki poured semen into Ninimma's womb and she conceived the semen in the womb, the semen of Enki.", "properNames": ["Enki", "Ninimma's"], "missingText": []}, {"lineNumber": "1", "text": "126R-126CC. To the woman its one month was but its one day, its two months were but its two days, its three months were but its three days, its four months were but its four days, its five months were but its five days, its six months were but its six days, its seven months were but its seven days, its eight months were but its eight days, and at its nine days, in the month of womanhood, like fine (?) oil, like fine (?) oil, like oil of abundance, Ninimma, like fine (?) oil, like oil of abundance, gave birth to Uttu, the exalted (?) woman.", "properNames": ["Ninimma", "Uttu"], "missingText": []}, {"lineNumber": "1", "text": "127-146. Nintur said to Uttu:  \"Let me advise you, and may you take heed of my advice. Let me speak words to you and may you heed my words. From in the marsh one man is able to see up here, is able to see up here, he is; from in the marsh Enki is able to see up here, is able to see up here, he is. He will set eyes on you.\" 10 lines fragmentary …… Uttu, the exalted (?) woman …… 3 lines fragmentary", "properNames": ["Nintur", "Uttu", "Enki"], "missingText": ["10 lines fragmentary", "3 lines fragmentary"]}, {"lineNumber": "1", "text": "147-151. (Uttu said:)  \"Bring cucumbers in ……, bring apples with their stems sticking out (?), bring grapes in their clusters, and in the house you will indeed have hold of my halter, O Enki, you will indeed have hold of my halter.\"", "properNames": ["Uttu", "Enki"], "missingText": []}, {"lineNumber": "1", "text": "152-158. When he was filling with water a second time, he filled the dykes with water, he filled the canals with water, he filled the fallows with water. The gardener in his joy rose (?) from the dust and embraced him:  \"Who are you who …… the garden?\"", "properNames": [], "missingText": []}, {"lineNumber": "1", "text": "159-166. Enki (said to) …… the gardener: 4 lines missingHe brought him cucumbers in ……, brought him apples with their stems sticking out (?), brought him grapes in their clusters, filled his lap.", "properNames": ["Enki"], "missingText": ["4 lines missing"]}, {"lineNumber": "1", "text": "167-177. Enki made his face attractive and took a staff in his hand. Enki came to a halt at Uttu's, knocked at her house (demanding):  \"Open up, open up.\" (She asked):  \"Who are you?\" (He answered:)  \"I am a gardener. Let me give you cucumbers, apples, and grapes for your consent.\" Joyfully Uttu opened the house. Enki gave Uttu, the exalted (?) woman, cucumbers in ……, gave her apples with their stems sticking out (?), gave her grapes in their clusters.  {(1 line not in the ms. from Nibru:)  He poured beer for her in the large ban measure.}", "properNames": ["Enki", "Uttu's", "Uttu"], "missingText": []}, {"lineNumber": "1", "text": "178-185. Uttu, the exalted (?) woman, …… to the left for him, waved the hands for him. Enki aroused Uttu. He clasped her to the bosom, lying in her crotch, fondled her thighs, fondled her with the hand. He clasped her to the bosom, lying in her crotch, made love to the youngster and kissed her. Enki poured semen into Uttu's womb and she conceived the semen in the womb, the semen of Enki.", "properNames": ["Uttu", "Enki", "Uttu's"], "missingText": []}, {"lineNumber": "1", "text": "186-189. Uttu, the beautiful woman, cried out:  \"Woe, my thighs.\" She cried out:  \"Woe, my body. Woe, my heart.\" Ninḫursaĝa removed the semen from the thighs. 2 lines fragmentary", "properNames": ["Uttu", "Ninḫursaĝa"], "missingText": ["2 lines fragmentary"]}, {"lineNumber": "1", "text": "190-197. She grew the 'tree' plant, she grew the 'honey' plant, she grew the 'vegetable' plant, she grew the esparto grass (?), she grew the atutu plant, she grew the aštaltal plant, she grew the …… plant, she grew the amḫaru plant.", "properNames": [], "missingText": []}, {"lineNumber": "1", "text": "198-201. Enki was able to see up there from in the marsh, he was able to see up there, he was. He said to his minister Isimud:  \"I have not determined the destiny of these plants. What is this one? What is that one?\"", "properNames": ["Enki", "Isimud"], "missingText": []}, {"lineNumber": "1", "text": "202-210. His minister Isimud had the answer for him.  \"My master, the 'tree' plant,\" he said to him, cut it off for him and Enki ate it.  \"My master, the 'honey' plant,\" he said to him, pulled it up for him and Enki ate it.  \"My master, the 'vegetable' plant,\" he said to him, cut it off for him and Enki ate it.  \"My master, the alfalfa grass (?),\" he said to him, pulled it up for him and Enki ate it.", "properNames": ["Isimud", "Enki"], "missingText": []}, {"lineNumber": "1", "text": "211-219.  \"My master, the atutu plant,\" he said to him, cut it off for him and Enki ate it.  \"My master, the aštaltal plant,\" he said to him, pulled it up for him and Enki ate it.  \"My master, the …… plant,\" he said to him, cut it off for him and Enki ate it.  \"My master, the amḫaru plant,\" he said to him, pulled it up for him and Enki ate it. Enki determined the destiny of the plants, had them know it in their hearts.", "properNames": ["Enki"], "missingText": []}, {"lineNumber": "1", "text": "220-227. Ninḫursaĝa cursed the name Enki:  \"Until his dying day, I will never look upon him with life-giving eye.\" The Anuna sat down in the dust. But a fox was able to speak to Enlil:  \"If I bring Ninḫursaĝa to you, what will be my reward?\" Enlil answered the fox:  \"If you bring Ninḫursaĝa to me, I shall erect two birch (?) trees for you in my city and you will be renowned.\"", "properNames": ["Ninḫursaĝa", "Enki", "Enlil"], "missingText": []}, {"lineNumber": "1", "text": "228-234. The fox first anointed his body, first shook out his fur (?), first put kohl on his eyes. 4 lines fragmentary", "properNames": [], "missingText": ["4 lines fragmentary"]}, {"lineNumber": "1", "text": "235-246. (The fox said to Ninḫursaĝa:)  \"I have been to Nibru, but Enlil ……. I have been to Urim, but Nanna ……. I have been to Larsam, but Utu ……. I have been to Unug, but Inana ……. I am seeking refuge with one who is …….\" 7 lines fragmentary", "properNames": ["Ninḫursaĝa", "Nibru", "Enlil", "Urim", "Nanna", "Larsam", "Utu", "Unug", "Inana"], "missingText": ["7 lines fragmentary"]}, {"lineNumber": "1", "text": "247-253. Ninḫursaĝa hastened to the temple. The Anuna slipped off her garment, made ……, determined its destiny and ……. Ninḫursaĝa made Enki sit by her vagina.  {(1 line not in the ms. from Nibru:)  She placed (?) her hands on ……. and ……. on its outside.}", "properNames": ["Ninḫursaĝa", "Anuna", "Enki"], "missingText": []}, {"lineNumber": "1", "text": "254-263. (Ninḫursaĝa asked:)  \"My brother, what part of you hurts you?\"  \"The top of my head (ugu-dili) hurts me.\" She gave birth to Ab-u out of it.  \"My brother, what part of you hurts you?\"  \"The locks of my hair (siki) hurt me.\" She gave birth to Ninsikila out of it.  \"My brother, what part of you hurts you?\"  \"My nose (giri) hurts me.\" She gave birth to Ningiriutud out of it.  \"My brother, what part of you hurts you?\"  \"My mouth (ka) hurts me.\" She gave birth to Ninkasi out of it.", "properNames": ["Ninḫursaĝa", "Ab-u", "Ninsikila", "Ningiriutud", "Ninkasi"], "missingText": []}, {"lineNumber": "1", "text": "264-271.  \"My brother, what part of you hurts you?\"  \"My throat (zi) hurts me.\" She gave birth to Nazi out of it.  \"My brother, what part of you hurts you?\"  \"My arm (a) hurts me.\" She gave birth to Azimua out of it.  \"My brother, what part of you hurts you?\"  \"My ribs (ti) hurt me.\" She gave birth to Ninti out of it.  \"My brother, what part of you hurts you?\"  \"My sides (zag) hurt me.\" She gave birth to Ensag out of it.", "properNames": ["Nazi", "Azimua", "Ninti", "Ensag"], "missingText": []}, {"lineNumber": "1", "text": "272-280. (She said:)  \"For the little ones to whom I have given birth may rewards not be lacking. Ab-u shall become king of the grasses, Ninsikila shall become lord of Magan, Ningiriutud shall marry Ninazu, Ninkasi shall be what satisfies the heart, Nazi shall marry Nindara, Azimua shall marry Ninĝišzida, Ninti shall become the lady of the month, and Ensag shall become lord of Dilmun.\"", "properNames": ["Ab-u", "Ninsikila", "Magan", "Ningiriutud", "Ninazu", "Ninkasi", "Nazi", "Nindara", "Azimua", "Ninĝišzida", "Ninti", "Ensag", "Dilmun"], "missingText": []}, {"lineNumber": "1", "text": "281. Praise be to Father Enki.", "properNames": ["Enki"], "missingText": []}], "transliterations": ["© Copyright 2003, 2004, 2005, 2006 The ETCSL project, Faculty of Oriental Studies, University of OxfordUpdated 2006-12-19 by JE"]}
{"id": "t.1.1.2", "title": "Enki and Ninmaḫ", "paragraphs": [{"lineNumber": "1", "text": "1-11. In those days, in the days when heaven and earth were created; in those nights, in the nights when heaven and earth were created; in those years, in the years when the fates were determined; when the Anuna gods were born; when the goddesses were taken in marriage; when the goddesses were distributed in heaven and earth; when the goddesses …… became pregnant and gave birth; when the gods were obliged (?) …… their food …… dining halls; the senior gods oversaw the work, while the minor gods were bearing the toil. The gods were digging the canals and piling up the silt in Ḫarali. The gods, crushing the clay, began complaining about this life.", "properNames": [], "missingText": []}, {"lineNumber": "1", "text": "12-23. At that time, the one of great wisdom, the creator of all the senior gods, Enki lay on his bed, not waking up from his sleep, in the deep engur, in the subterranean water, the place the inside of which no other god knows. The gods said, weeping:  \"He is the cause of the lamenting!\" Namma, the primeval mother who gave birth to the senior gods, took the tears of the gods to the one who lay sleeping, to the one who did not wake up from his bed, to her son:  \"Are you really lying there asleep, and …… not awake? The gods, your creatures, are smashing their ……. My son, wake up from your bed! Please apply the skill deriving from your wisdom and create a substitute (?) for the gods so that they can be freed from their toil!\"", "properNames": ["Enki", "Namma"], "missingText": []}, {"lineNumber": "1", "text": "24-37. At the word of his mother Namma, Enki rose up from his bed. In Ḫal-an-kug, his room for pondering, he slapped his thigh in annoyance. The wise and intelligent one, the prudent, …… of skills, the fashioner of the design of everything brought to life birth-goddesses (?). Enki reached out his arm over them and turned his attention to them. And after Enki, the fashioner of designs by himself, had pondered the matter, he said to his mother Namma:  \"My mother, the creature you planned will really come into existence. Impose on him the work of carrying baskets. You should knead clay from the top of the abzu; the birth-goddesses (?) will nip off the clay and you shall bring the form into existence. Let Ninmaḫ act as your assistant; and let Ninimma, Šu-zi-ana, Ninmada, Ninbarag, Ninmug, …… and Ninguna stand by as you give birth. My mother, after you have decreed his fate, let Ninmaḫ impose on him the work of carrying baskets.\" 5 lines fragmentary …… she placed it on grass and purified the birth.", "properNames": ["Namma", "Enki", "Ninmaḫ", "Ninimma", "Šu-zi-ana", "Ninmada", "Ninbarag", "Ninmug", "Ninguna"], "missingText": ["5 lines fragmentary"]}, {"lineNumber": "1", "text": "44-51. Enki …… brought joy to their heart. He set a feast for his mother Namma and for Ninmaḫ. All the princely birth-goddesses (?) …… ate delicate reed (?) and bread. An, Enlil, and Lord Nudimmud roasted holy kids. All the senior gods praised him:  \"O lord of wide understanding, who is as wise as you? Enki, the great lord, who can equal your actions? Like a corporeal father, you are the one who has the me of deciding destinies, in fact you are the me.\"", "properNames": ["Enki", "Namma", "Ninmaḫ", "An", "Enlil", "Nudimmud"], "missingText": []}, {"lineNumber": "1", "text": "52-55. Enki and Ninmaḫ drank beer, their hearts became elated, and then Ninmaḫ said to Enki:  \"Man's body can be either good or bad and whether I make a fate good or bad depends on my will.\"", "properNames": ["Enki", "Ninmaḫ"], "missingText": []}, {"lineNumber": "1", "text": "56-61. Enki answered Ninmaḫ:  \"I will counterbalance whatever fate -- good or bad -- you happen to decide.\" Ninmaḫ took clay from the top of the abzu in her hand and she fashioned from it first a man who could not bend his outstretched weak hands. Enki looked at the man who cannot bend his outstretched weak hands, and decreed his fate: he appointed him as a servant of the king.", "properNames": ["Enki", "Ninmaḫ"], "missingText": []}, {"lineNumber": "1", "text": "62-65. Second, she fashioned one who turned back (?) the light, a man with constantly opened eyes (?). Enki looked at the who turned back (?) the light, the man with constantly opened eyes (?), and decreed his fate allotting to it the musical arts, making him as the chief …… in the king's presence.", "properNames": ["Enki"], "missingText": []}, {"lineNumber": "1", "text": "66-68.  {Third, she fashioned one with both feet broken, one with paralysed feet. Enki looked at the one with both feet broken, the one with paralysed feet and …… him for the work of …… and the silversmith and …….} {(1 ms. has instead:)  She fashioned one, a third one, born as an idiot. Enki looked at this one, the one born as an idiot, and decreed his fate: he appointed him as a servant of the king.}", "properNames": ["Enki"], "missingText": []}, {"lineNumber": "1", "text": "69-71. Fourth, she fashioned one who could not hold back his urine. Enki looked at the one who could not hold back his urine and bathed him in enchanted water and drove out the namtar demon from his body.", "properNames": ["Enki"], "missingText": []}, {"lineNumber": "1", "text": "72-74. Fifth, she fashioned a woman who could not give birth. Enki looked at the woman who could not give birth,  {and decreed her fate: he made (?) her belong to the queen's household.} {(1 ms. has instead:)  …… as a weaver, fashioned her to belong to the queen's household.}", "properNames": ["Enki"], "missingText": []}, {"lineNumber": "1", "text": "75-78. Sixth, she fashioned one with neither penis nor vagina on its body. Enki looked at the one with neither penis nor vagina on its body and gave it the name 'Nibru eunuch (?)', and decreed as its fate to stand before the king.", "properNames": ["Enki", "Nibru"], "missingText": []}, {"lineNumber": "1", "text": "79-82. {Ninmaḫ threw the pinched-off clay from her hand on the ground and a great silence fell}{(1 ms. has instead:)  Enki threw all (?) the clay to the ground and was greatly ……}. The great lord Enki said to Ninmaḫ:  \"I have decreed the fates of your creatures and given them their daily bread. Come, now I will fashion somebody for you, and you must decree the fate of the newborn one!\"", "properNames": ["Ninmaḫ", "Enki"], "missingText": []}, {"lineNumber": "1", "text": "83-91. Enki devised a shape with head, …… and mouth in its middle, and said to Ninmaḫ:  \"Pour ejaculated semen into a woman's womb, and the woman will give birth to the semen of her womb.\" Ninmaḫ stood by for the newborn ……. and the woman brought forth …… in the midst ……. In return (?), this was Umul: its head was afflicted, its place of …… was afflicted, its eyes were afflicted, its neck was afflicted. It could hardly breathe, its ribs were shaky, its lungs were afflicted, its heart was afflicted, its bowels were afflicted. With its hand and its lolling head it could not not put bread into its mouth; its spine and head were dislocated. The weak hips and the shaky feet could not carry (?) it on the field -- Enki fashioned it in this way.", "properNames": ["Enki", "Ninmaḫ"], "missingText": []}, {"lineNumber": "1", "text": "92-101. Enki said to Ninmaḫ:  \"For your creatures I have decreed a fate, I have given them their daily bread. Now, you should decree a fate for my creature, give him his daily bread too.\" Ninmaḫ looked at Umul and turned to him. She went nearer to Umul asked him questions but he could not speak. She offered him bread to eat but he could not reach out for it. He could not lie on ……, he could not ……. Standing up he could not sit down, could not lie down, he could not …… a house, he could not eat bread. Ninmaḫ answered Enki:  \"The man you have fashioned is neither alive nor dead. He cannot support himself (?).\"", "properNames": ["Enki", "Ninmaḫ"], "missingText": []}, {"lineNumber": "1", "text": "102-110. Enki answered Ninmaḫ:  \"I decreed a fate for the first man with the weak hands, I gave him bread. I decreed a fate for the man who turned back (?) the light, I gave him bread. I decreed a fate for the man with broken, paralysed feet, I gave him bread. I decreed a fate for the man who could not hold back his urine, I gave him bread. I decreed a fate for the woman who could not give birth, I gave her bread. I decreed the fate for the one with neither penis nor vagina on its body, I gave it bread. My sister, …….\"2 lines fragmentary", "properNames": ["Enki", "Ninmaḫ"], "missingText": ["2 lines fragmentary"]}, {"lineNumber": "1", "text": "112. Ninmaḫ answered Enki: 9 lines fragmentary", "properNames": ["Ninmaḫ", "Enki"], "missingText": ["9 lines fragmentary"]}, {"lineNumber": "1", "text": "122-128. (Ninmaḫ's answer continues)  \"You (?) entered ……. Look, you do not dwell in heaven, you do not dwell on earth, you do not come out to look at the Land. Where you do not dwell but where my house is built, your words cannot be heard. Where you do not live but where my city is built, I myself am silenced (?). My city is ruined, my house is destroyed, my child has been taken captive. I am a fugitive who has had to leave the E-kur, even I myself could not escape from your hand.\"", "properNames": ["Ninmaḫ's", "E-kur"], "missingText": []}, {"lineNumber": "1", "text": "129-139. Enki replied to Ninmaḫ:  \"Who could change the words that left your mouth? Remove Umul from your lap ……. Ninmaḫ, may your work be ……, you …… for me what is imperfect; who can oppose (?) this? The man whom I shaped …… after you ……, let him pray! Today let my penis be praised, may your wisdom be confirmed (?)! May the enkum and ninkum …… proclaim your glory ……. My sister, the heroic strength ……. The song …… the writing (?) ……. The gods who heard …… let Umul build (?) my house …….\"", "properNames": ["Enki", "Ninmaḫ"], "missingText": []}, {"lineNumber": "1", "text": "140-141. Ninmaḫ could not rival the great lord Enki. Father Enki, your praise is sweet!", "properNames": ["Ninmaḫ", "Enki"], "missingText": []}], "transliterations": ["© Copyright 2003, 2004, 2005, 2006 The ETCSL project, Faculty of Oriental Studies, University of OxfordUpdated 2006-12-19 by JE"]}
{"id": "t.1.1.3", "title": "Enki and the world order", "paragraphs": [{"lineNumber": "1", "text": "1-16. Grandiloquent lord of heaven and earth, self-reliant, Father Enki, engendered by a bull, begotten by a wild bull, cherished by Enlil, the Great Mountain, beloved by holy An, king, meš tree planted in the Abzu, rising over all lands; great dragon who stands in Eridug, whose shadow covers heaven and earth, a grove of vines extending over the Land, Enki, lord of plenty of the Anuna gods, Nudimmud, mighty one of the E-kur, strong one of heaven and earth! Your great house is founded in the Abzu, the great mooring-post of heaven and earth. Enki, from whom a single glance is enough to unsettle the heart of the mountains; wherever bison are born, where stags are born, where ibex are born, where wild goats are born, in meadows ……, in hollows in the heart of the hills, in green …… unvisited by man, you have fixed your gaze on the heart of the Land as on split reeds.", "properNames": ["Enki", "Enlil", "An", "Eridug", "Anuna", "Nudimmud", "E-kur"], "missingText": []}, {"lineNumber": "1", "text": "17-31. Counting the days and putting the months in their houses, so as to complete the years and to submit the completed years to the assembly for a decision, taking decisions to regularise the days: Father Enki, you are the king of the assembled people. You have only to open your mouth for everything to multiply and for plenty to be established. Your branches …… green with their fruit ……, …… do honour to the gods. …… in its forests is like a fleecy garment. Good sheep and good lambs do honour to ……. When …… the prepared fields, …… will accumulate stockpiles and stacks. …… there is oil, there is milk, produced by the sheepfold and cow-pen. The shepherd sweetly sings his rustic song, the cowherd spends the day rocking his churns. Their products would do honour to the late lunches in the gods' great dining hall.", "properNames": ["Enki"], "missingText": []}, {"lineNumber": "1", "text": "32-37. Your word fills the young man's heart with vigour, so that like a thick-horned bull he butts about in the courtyard. Your word bestows loveliness on the young woman's head, so that the people in their settled cities gaze at her in wonder. 2 lines unclear", "properNames": [], "missingText": ["2 lines unclear"]}, {"lineNumber": "1", "text": "38-47. Enlil, the Great Mountain, has commissioned you to gladden the hearts of lords and rulers and wish them well. Enki, lord of prosperity, lord of wisdom, lord, the beloved of An, the ornament of Eridug, who establish commands and decisions, who well understands the decreeing of fates: you close up the days ……, and make the months enter their houses. You bring down ……, you have reached their number. You make the people dwell in their dwelling places ……, you make them follow their herdsman ……. 2 lines unclear", "properNames": ["Enlil", "Enki", "An", "Eridug"], "missingText": ["2 lines unclear"]}, {"lineNumber": "1", "text": "50-51. You turn weapons away from their houses ……, you make the people safe in their dwellings …….", "properNames": [], "missingText": []}, {"lineNumber": "1", "text": "52-60. When Father Enki goes forth to the inseminated people, good seed will come forth. When Nudimmud goes forth to the good pregnant ewes, good lambs will be born; when he goes forth to the fecund cows, good calves will be born; whe he goes forth to the good pregnant goats, good kids will be born. If you go forth to the cultivated fields, to the good germinating fields, stockpiles and stacks can be accumulated on the high plain. If you go forth to the parched areas of the Land, 2 lines missing or unclear", "properNames": ["Enki", "Nudimmud"], "missingText": ["2 lines missing or unclear"]}, {"lineNumber": "1", "text": "61-80. Enki, the king of the Abzu, rejoicing in great splendour, justly praises himself:  \"My father, the king of heaven and earth, made me famous in heaven and earth. My elder brother, the king of all the lands, gathered up all the divine powers and placed them in my hand. I brought the arts and crafts from the E-kur, the house of Enlil, to my Abzu in Eridug. I am the good semen, begotten by a wild bull, I am the first born of An. I am a great storm rising over the great earth, I am the great lord of the Land. I am the principal among all rulers, the father of all the foreign lands. I am the big brother of the gods, I bring prosperity to perfection. I am the seal-keeper of heaven and earth. I am the wisdom and understanding of all the foreign lands. With An the king, on An's dais, I oversee justice. With Enlil, looking out over the lands, I decree good destinies. He has placed in my hands the decreeing of fates in the place where the sun rises. I am cherished by Nintur. I am named with a good name by Ninḫursaĝa. I am the leader of the Anuna gods. I was born as the firstborn son of holy An.\"", "properNames": ["Enki", "E-kur", "Enlil", "Abzu", "Eridug", "An", "An's", "Nintur", "Ninḫursaĝa", "Anuna"], "missingText": []}, {"lineNumber": "1", "text": "81-83. After the lord had proclaimed his greatness, after the great prince had eulogised himself, the Anuna gods stood there in prayer and supplication:", "properNames": ["Anuna"], "missingText": []}, {"lineNumber": "1", "text": "84-85.  \"Praise be to Enki, the much-praised lord who controls all the arts and crafts, who takes decisions!\"", "properNames": ["Enki"], "missingText": []}, {"lineNumber": "1", "text": "86-88. In a state of high delight Enki, the king of the Abzu, rejoicing in great splendour, again justly praises himself:  \"I am the lord, I am one whose word is reliable, I am one who excels in everything.\"", "properNames": ["Enki"], "missingText": []}, {"lineNumber": "1", "text": "89-99.  \"At my command, sheepfolds have been built, cow-pens have been fenced off. When I approach heaven, a rain of abundance rains from heaven. When I approach earth, there is a high carp-flood. When I approach the green meadows, at my word stockpiles and stacks are accumulated. I have built my house, a shrine, in a pure place, and named it with a good name. I have built my Abzu, a shrine, in ……, and decreed a good fate for it. The shade of my house extends over the …… pool. By my house the suḫur carp dart among the honey plants, and the eštub carp wave their tails among the small gizi reeds. The small birds chirp in their nests.\"", "properNames": ["Abzu"], "missingText": []}, {"lineNumber": "1", "text": "100-122.  \"The lords pay heed …… to me. I am Enki! They stand before me, praising me. The abgal priests and abrig officials who …… stand before me …… distant days. The enkum and ninkum officiants organise ……. They purify the river for me, they …… the interior of the shrine for me. In my Abzu, sacred songs and incantations resound for me. My barge 'Crown', the 'Stag of the Abzu', transports me there most delightfully. It glides swiftly for me through the great marshes to wherever I have decided, it is obedient to me. The stroke-callers make the oars pull in perfect unison. They sing for me pleasant songs, creating a cheerful mood on the river. Niĝir-sig, the captain of my barge, holds the golden sceptre for me. I am Enki! He is in command of my boat 'Stag of the Abzu'. I am the lord! I will travel! I am Enki! I will go forth into my Land! I, the lord who determines the fates, ……,\"4 lines unclear", "properNames": ["Enki", "Abzu", "Niĝir-sig"], "missingText": ["4 lines unclear"]}, {"lineNumber": "1", "text": "123-130.  \"I will admire its green cedars. Let the lands of Meluḫa, Magan and Dilmun look upon me, upon Enki. Let the Dilmun boats be loaded (?) with timber. Let the Magan boats be loaded sky-high. Let the magilum boats of Meluḫa transport gold and silver and bring them to Nibru for Enlil, king of all the lands.\"", "properNames": ["Meluḫa", "Magan", "Dilmun", "Enki", "Nibru", "Enlil"], "missingText": []}, {"lineNumber": "1", "text": "131-133. He presented animals to those who have no city, to those who have no houses, to the Martu nomads.", "properNames": ["Martu"], "missingText": []}, {"lineNumber": "1", "text": "134-139. The Anuna gods address affectionately the great prince who has travelled in his Land:  \"Lord who rides upon the great powers, the pure powers, who controls the great powers, the numberless powers, foremost in all the breadth of heaven and earth; who received the supreme powers in Eridug, the holy place, the most esteemed place, Enki, lord of heaven and earth -- praise!\"", "properNames": ["Anuna", "Eridug", "Enki"], "missingText": []}, {"lineNumber": "1", "text": "140-161. All the lords and rulers, the incantation-priests of Eridug and the linen-clad priests of Sumer, perform the purification rites of the Abzu for the great prince who has travelled in his land; for Father Enki they stand guard in the holy place, the most esteemed place. They …… the chambers ……, they …… the emplacements, they purify the great shrine of the Abzu ……. They bring there the tall juniper, the pure plant. They organise the holy …… in the great watercourse …… of Enki. Skilfully they build the main stairway of Eridug on the Good Quay. They prepare the sacred uzga shrine, where they utter endless prayers. 7 lines fragmentary or unclear", "properNames": ["Eridug", "Sumer", "Abzu", "Enki"], "missingText": ["7 lines fragmentary or unclear"]}, {"lineNumber": "1", "text": "162-165. For Enki, …… squabbling together, and the suḫurmaš carp dart among the honey plants, again fighting amongst themselves for the great prince. The eštub carp wave their tails among the small gizi reeds.", "properNames": ["Enki"], "missingText": []}, {"lineNumber": "1", "text": "166-181. The lord, the great ruler of the Abzu, issues instructions on board the 'Stag of the Abzu' -- the great emblem erected in the Abzu, providing protection, its shade extending over the whole land and refreshing the people, the pillar and pole planted in the …… marsh, rising high over all the foreign lands. The noble captain of the lands, the son of Enlil, holds in his hand the sacred punt-pole, a meš tree ornamented in the Abzu which received the supreme powers in Eridug, the holy place, the most esteemed place. The hero proudly lifts his head towards the Abzu. 6 lines missing or unclear", "properNames": ["Enlil", "Eridug"], "missingText": ["6 lines missing or unclear"]}, {"lineNumber": "1", "text": "182-187. Sirsir ……, the boatman of the barge, …… the boat for the lord. Niĝir-sig, the captain of the barge, holds the holy sceptre for the lord. The fifty laḫama deities of the subterranean waters speak affectionately to him. The stroke-callers, like heavenly gamgam birds, …….", "properNames": ["Sirsir", "Niĝir-sig"], "missingText": []}, {"lineNumber": "1", "text": "188-191. The intrepid king, Father Enki …… in the Land. Prosperity was made to burgeon in heaven and on earth for the great prince who travels in the Land. Enki decreed its fate:", "properNames": ["Enki"], "missingText": []}, {"lineNumber": "1", "text": "192-209.  \"Sumer, great mountain, land of heaven and earth, trailing glory, bestowing powers on the people from sunrise to sunset: your powers are superior powers, untouchable, and your heart is complex and inscrutable. Like heaven itself, your just matrix, in which gods too can be born, is beyond reach. Giving birth to kings who put on the good diadem, giving birth to lords who wear the crown on their heads -- your lord, the honoured lord, sits with An the king on An's dais. Your king, the Great Mountain, Father Enlil, the father of all the lands, has blocked you impenetrably (?) like a cedar tree. The Anuna, the great gods, have taken up dwellings in your midst, and consume their food in your giguna shrines among the unique and exceptional trees. Household Sumer, may your sheepfolds be built and your cattle multiply, may your giguna touch the skies. May your good temples reach up to heaven. May the Anuna determine the destinies in your midst.\"", "properNames": ["Sumer", "An", "An's", "Enlil", "Anuna"], "missingText": []}, {"lineNumber": "1", "text": "210-211. Then he proceeded to the sanctuary of Urim. Enki, lord of the Abzu, decreed its fate:", "properNames": ["Urim", "Enki"], "missingText": []}, {"lineNumber": "1", "text": "212-218.  \"City which possesses all that is fitting, bathed by water! Sturdy bull, altar of abundance that strides across the mountains, rising like the hills, forest of ḫašur cypresses with broad shade, self-confident! May your perfect powers be well-directed. The Great Mountain Enlil has pronounced your name great in heaven and on earth. City whose fate Enki has decreed, sanctuary of Urim, you shall rise high to heaven!\"", "properNames": ["Enlil", "Enki", "Urim"], "missingText": []}, {"lineNumber": "1", "text": "219-220. Then he proceeded to the land of Meluḫa. Enki, lord of the Abzu, decreed its fate:", "properNames": ["Meluḫa", "Enki"], "missingText": []}, {"lineNumber": "1", "text": "221-237.  \"Black land, may your trees be great trees, may your forests be forests of highland meš trees! Chairs made from them will grace royal palaces! May your reeds be great reeds, may they ……! Heroes shall …… them on the battlefield as weapons! May your bulls be great bulls, may they be bulls of the mountains! May their bellowing be the bellowing of wild bulls of the mountains! The great powers of the gods shall be made perfect for you! May the francolins of the mountains wear cornelian beards! May your birds all be peacocks! May their cries grace royal palaces! May all your silver be gold! May all your copper be tin-bronze! Land, may all you possess be plentiful! May your people ……! May your men go forth like bulls against their fellow men!\" 2 lines unclear", "properNames": [], "missingText": ["2 lines unclear"]}, {"lineNumber": "1", "text": "238-247. He cleansed and purified the land of Dilmun. He placed Ninsikila in charge of it. He gave …… for the fish spawn, ate its …… fish, bestowed palms on the cultivated land, ate its dates. …… Elam and Marḫaši ……. …… to devour ……. The king endowed with strength by Enlil destroyed their houses, demolished (?) their walls. He brought their silver and lapis-lazuli, their treasure, to Enlil, king of all the lands, in Nibru.", "properNames": ["Dilmun", "Ninsikila", "Elam", "Marḫaši", "Enlil", "Nibru"], "missingText": []}, {"lineNumber": "1", "text": "248-249. Enki presented animals to those who have no city, who have no houses, to the Martu nomads.", "properNames": ["Enki", "Martu"], "missingText": []}, {"lineNumber": "1", "text": "250-266. After he had turned his gaze from there, after Father Enki had lifted his eyes across the Euphrates, he stood up full of lust like a rampant bull, lifted his penis, ejaculated and filled the Tigris with flowing water. He was like a wild cow mooing for its young in the wild grass, its scorpion-infested cow-pen. The Tigris …… at his side like a rampant bull. By lifting his penis, he brought a bridal gift. The Tigris rejoiced in its heart like a great wild bull, when it was born ……. It brought water, flowing water indeed: its wine will be sweet. It brought barley, mottled barley indeed: the people will eat it. It filled the E-kur, the house of Enlil, with all sorts of things. Enlil was delighted with Enki, and Nibru was glad. The lord put on the diadem as a sign of lordship, he put on the good crown as a sign of kingship, touching the ground on his left side. Plenty came forth out of the earth for him.", "properNames": ["Enki", "Euphrates", "Tigris", "E-kur", "Enlil", "Nibru"], "missingText": []}, {"lineNumber": "1", "text": "267-273. Enki, the lord of the destinies, Enki, the king of the Abzu, placed in charge of all this him who holds a sceptre in his right hand, him who with glorious mouth submits to verification the devouring force of the Tigris and Euphrates, while prosperity pours forth from the palace like oil -- Enbilulu, the inspector of waterways.", "properNames": ["Enki", "Tigris", "Euphrates", "Enbilulu"], "missingText": []}, {"lineNumber": "1", "text": "274-277. He called the marshes and gave them the various species of carp, he spoke to the reedbeds and bestowed on them the old and new growths of reeds. 2 lines missing", "properNames": [], "missingText": ["2 lines missing"]}, {"lineNumber": "1", "text": "278-284. He issued a challenge ……. Enki placed in charge of all this him from whose net no fish escapes, him from whose trap no living thing escapes, him from whose bird-net no bird escapes, 1 line unclear -- ……, who loves fish.", "properNames": ["Enki"], "missingText": ["1 line unclear"]}, {"lineNumber": "1", "text": "285-298. The lord established a shrine, a holy shrine, whose interior is elaborately constructed. He established a shrine in the sea, a holy shrine, whose interior is elaborately constructed. The shrine, whose interior is a tangled thread, is beyond understanding. The shrine's emplacement is situated by the constellation the Field, the holy upper shrine's emplacement faces towards the Chariot constellation. Its terrifying sea is a rising wave, its splendour is fearsome. The Anuna gods dare not approach it. …… to refresh their hearts, the palace rejoices. The Anuna stand by with prayers and supplications. They set up a great altar for Enki in the E-engura, for the lord ……. The great prince ……. …… the pelican of the sea. 1 line unclear", "properNames": ["Anuna", "Enki", "E-engura"], "missingText": ["1 line unclear"]}, {"lineNumber": "1", "text": "299-308. He filled the E-kur, the house of Enlil, with goods of all sorts. Enlil was delighted with Enki, and Nibru was glad. Enki placed in charge of all this, over the wide extent of the sea, her who sets sail …… in the holy shrine, who induces sexual intercourse ……, who …… over the enormous high flood of the subterranean waters, the terrifying waves, the inundation of the sea ……, who comes forth from the ……, the mistress of Sirara, …… -- Nanše.", "properNames": ["E-kur", "Enlil", "Enki", "Nibru", "Sirara", "Nanše"], "missingText": []}, {"lineNumber": "1", "text": "309-317. He called to the rain of the heavens. He …… as floating clouds. He made …… rising at the horizon. He turned the mounds into fields ……. Enki placed in charge of all this him who rides on the great storms, who attacks with lightning bolts, the holy bar which blocks the entrance to the interior of heaven, the son of An, the canal inspector of heaven and earth -- Iškur, the bringer of plenty, the son of An.", "properNames": ["Enki", "An", "Iškur"], "missingText": []}, {"lineNumber": "1", "text": "318-325. He organised ploughs, yokes and teams. The great prince Enki bestowed the horned oxen that follow the …… tools, he opened up the holy furrows, and made the barley grow on the cultivated fields. Enki placed in charge of them the lord who wears the diadem, the ornament of the high plain, him of the implements, the farmer of Enlil -- Enkimdu, responsible for ditches and dykes.", "properNames": ["Enki", "Enlil", "Enkimdu"], "missingText": []}, {"lineNumber": "1", "text": "326-334. The lord called the cultivated fields, and bestowed on them mottled barley. Enki made chickpeas, lentils and …… grow. He heaped up into piles the early, mottled and innuḫa varieties of barley. Enki multiplied the stockpiles and stacks, and with Enlil's help he enhanced the people's prosperity. Enki placed in charge of all this her whose head and body are dappled, whose face is covered in syrup, the mistress who causes sexual intercourse, the power of the Land, the life of the black-headed -- Ezina, the good bread of the whole world.", "properNames": ["Enki", "Enlil's", "Ezina"], "missingText": []}, {"lineNumber": "1", "text": "335-340. The great prince fixed a string to the hoe, and organised brick moulds. He penetrated the …… like precious oil. Enki placed in charge of them him whose sharp-bladed hoe is a corpse-devouring snake that ……, whose brick mould in place is a tidy stack of hulled grain for the ewes -- Kulla, who …… bricks in the Land.", "properNames": ["Enki", "Kulla"], "missingText": []}, {"lineNumber": "1", "text": "341-348. He tied down the strings and coordinated them with the foundations, and with the power of the assembly he planned a house and performed the purification rituals. The great prince put down the foundations, and laid the bricks. Enki placed in charge of all this him whose foundations once laid do not sag, whose good houses once built do not collapse (?), whose vaults reach up into the heart of the heavens like a rainbow -- Mušdama, Enlil's master builder.", "properNames": ["Enki", "Mušdama", "Enlil's"], "missingText": []}, {"lineNumber": "1", "text": "349-357. He raised a holy crown over the upland plain. He fastened a lapis-lazuli beard to the high plain, and made it wear a lapis-lazuli headdress. He made this good place perfect with greenery in abundance. He multiplied the animals of the high plain to an appropriate degree, he multiplied the ibex and wild goats of the pastures, and made them copulate. Enki placed in charge of them the hero who is the crown of the high plain, who is the king of the countryside, the great lion of the high plain, the muscular, the hefty, the burly strength of Enlil -- Šakkan, the king of the hills.", "properNames": ["Enki", "Enlil", "Šakkan"], "missingText": []}, {"lineNumber": "1", "text": "358-367. He built the sheepfolds, carried out their cleaning, made the cow-pens, bestowed on them the best fat and cream, and brought luxury to the gods' dining places. He made the plain, created for greenery, achieve prosperity. Enki placed in charge of all this the king, the good provider of E-ana, the friend of An, the beloved son-in-law of the youth Suen, the holy spouse of Inana the mistress, the lady of the great powers who allows sexual intercourse in the open squares of Kulaba -- Dumuzid-ušumgal-ana, the friend of An.", "properNames": ["Enki", "E-ana", "An", "Suen", "Inana", "Kulaba", "Dumuzid-ušumgal-ana"], "missingText": []}, {"lineNumber": "1", "text": "368-380. He filled the E-kur, the house of Enlil, with possessions. Enlil was delighted with Enki and Nibru was glad. He demarcated borders and fixed boundaries. For the Anuna gods, Enki situated dwellings in cities and disposed agricultural land into fields. Enki placed in charge of the whole of heaven and earth the hero, the bull who comes out of the ḫašur forest bellowing truculently, the youth Utu, the bull standing triumphantly, audaciously, majestically, the father of the Great City (an expression for the underworld) , the great herald in the east of holy An, the judge who searches out verdicts for the gods, with a lapis-lazuli beard, rising from the horizon into the holy heavens -- Utu, the son born by Ningal.", "properNames": ["E-kur", "Enlil", "Enki", "Nibru", "Anuna", "Utu", "An", "Ningal"], "missingText": []}, {"lineNumber": "1", "text": "381-386. He picked out the tow from the fibres, and set up the loom. Enki greatly perfected the task of women. For Enki, the people …… in …… garments. Enki placed in charge of them the honour of the palace, the dignity of the king -- Uttu, the conscientious woman, the silent one.", "properNames": ["Enki", "Uttu"], "missingText": []}, {"lineNumber": "1", "text": "387-390. Then, alone lacking any functions, the great woman of heaven, Inana, lacking any functions -- Inana came in to see her father Enki in his house, weeping to him, and making her complaint to him:", "properNames": ["Inana", "Enki"], "missingText": []}, {"lineNumber": "1", "text": "391-394.  \"Enlil left it in your hands to confirm the functions of the Anuna, the great gods. Why did you treat me, the woman, in an exceptional manner? I am holy Inana -- where are my functions?\"", "properNames": ["Enlil", "Anuna", "Inana"], "missingText": []}, {"lineNumber": "1", "text": "395-402.  \"Aruru, Enlil's sister, Nintur, the lady of giving birth, is to get the holy birth-bricks as her prerogative. She is to carry off the lancet for umbilical cords, the special sand and leeks. She is to get the sila-ĝara bowl of translucent lapis lazuli (in which to place the afterbirth) . She is to carry off the holy consecrated ala vessel. She is to be the midwife of the land! The birthing of kings and lords is to be in her hands.\"", "properNames": ["Aruru", "Enlil's", "Nintur"], "missingText": []}, {"lineNumber": "1", "text": "403-405.  \"My illustrious sister, holy Ninisina, is to get the jewellery of šuba stones. She is to be the mistress of heaven. She is to stand beside An and speak to him whenever she desires.\"", "properNames": ["Ninisina", "An"], "missingText": []}, {"lineNumber": "1", "text": "406-411.  \"My illustrious sister, holy Ninmug, is to get the golden chisel and the silver burin. She is to carry off her big flint antasura blade. She is to be the metal-worker of the Land. The fitting of the good diadem when a king is born and the crowning with the crown when a lord is born are to be in her hands.\"", "properNames": ["Ninmug"], "missingText": []}, {"lineNumber": "1", "text": "412-417.  \"My illustrious sister, holy Nisaba, is to get the measuring-reed. The lapis-lazuli measuring tape is to hang over her arm. She is to proclaim all the great powers. She is to demarcate boundaries and mark borders. She is to be the scribe of the Land. The planning of the gods' meals is to be in her hands.\"", "properNames": ["Nisaba"], "missingText": []}, {"lineNumber": "1", "text": "418-421.  \"Nanše, the august lady, who rests her feet on the holy pelican, is to be the fisheries inspector of the sea. She is to be responsible for accepting delectable fish and delicious birds from there to go to Nibru for her father Enlil.\"", "properNames": ["Nanše", "Nibru", "Enlil"], "missingText": []}, {"lineNumber": "1", "text": "422-423.  \"But why did you treat me, the woman, in an exceptional manner? I am holy Inana -- where are my functions?\"", "properNames": ["Inana"], "missingText": []}, {"lineNumber": "1", "text": "424-436. Enki answered his daughter, holy Inana :  \"How have I disparaged you? Goddess, how have I disparaged you? How can I enhance you? Maiden Inana, how have I disparaged you? How can I enhance you? I made you speak as a woman with pleasant voice. I made you go forth ……. I covered …… with a garment. I made you exchange its right side and its left side. I clothed you in garments of women's power. I put women's speech in your mouth. I placed in your hands the spindle and the hairpin. I …… to you women's adornment. I settled on you the staff and the crook, with the shepherd's stick beside them.\"", "properNames": ["Enki", "Inana"], "missingText": []}, {"lineNumber": "1", "text": "437-444.  \"Maiden Inana, how have I disparaged you? How can I enhance you? Amongst the ominous ocurrences in the hurly-burly of battle, I shall make you speak vivifying words; and in its midst, although you are not an arabu bird\"(a bird of ill omen) , I shall make you speak ill-omened words also. I made you tangle straight threads; maiden Inana, I made you straighten out tangled threads. I made you put on garments, I made you dress in linen. I made you pick out the tow from the fibres, I made you spin with the spindle. I made you colour tufted (?) cloth with coloured threads.", "properNames": ["Inana"], "missingText": []}, {"lineNumber": "1", "text": "445-450.  \"Inana, you heap up human heads like piles of dust, you sow heads like seed. Inana, you destroy what should not be destroyed; you create what should not be created. You remove the cover from the šem drum of lamentations, Maiden Inana, while shutting up the tigi and adab instruments in their homes. You never grow weary with admirers looking at you. Maiden Inana, you know nothing of tying the ropes on deep wells.\"", "properNames": ["Inana"], "missingText": []}, {"lineNumber": "1", "text": "451-471.  \"But now, the heart has overflowed, the Land is restored; Enlil's heart has overflowed, the Land is restored. In his overflowing heart of mankind,\"4 lines unclear  \"…… lapis-lazuli headdress …… is your prerogative, …… is your prerogative, …… is your prerogative, …… is your prerogative.\" 10 lines unclear", "properNames": ["Enlil's"], "missingText": ["4 lines unclear", "10 lines unclear"]}, {"lineNumber": "1", "text": "472. Praise be to Father Enki.", "properNames": ["Enki"], "missingText": []}], "transliterations": ["© Copyright 2003, 2004, 2005, 2006 The ETCSL project, Faculty of Oriental Studies, University of OxfordUpdated 2006-12-19 by JE"]}
{"id": "t.1.1.4", "title": "Enki's journey to Nibru", "paragraphs": [{"lineNumber": "1", "text": "1-8. In those remote days, when the fates were determined; in a year when An brought about abundance, and people broke through the earth like green plants -- then the lord of the abzu, King Enki, Enki, the lord who determines the fates, built up his temple entirely from silver and lapis lazuli. Its silver and lapis lazuli were the shining daylight. Into the shrine of the abzu he brought joy.", "properNames": ["An", "Enki"], "missingText": []}, {"lineNumber": "1", "text": "9-17. An artfully made bright crenellation rising out from the abzu was erected for Lord Nudimmud. He built the temple from precious metal, decorated it with lapis lazuli, and covered it abundantly with gold. In Eridug, he built the house on the bank. Its brickwork makes utterances and gives advice. Its eaves roar like a bull; the temple of Enki bellows. During the night the temple praises its lord and offers its best for him.", "properNames": ["Nudimmud", "Eridug", "Enki"], "missingText": []}, {"lineNumber": "1", "text": "18-25. Before Lord Enki, Isimud the minister praises the temple; he goes to the temple and speaks to it. He goes to the brick building and addresses it:  \"Temple, built from precious metal and lapis lazuli; whose foundation pegs are driven into the abzu; which has been cared for by the prince in the abzu! Like the Tigris and the Euphrates, it is mighty and awe-inspiring (?). Joy has been brought into Enki's abzu.\"", "properNames": ["Enki", "Isimud", "Tigris", "Euphrates", "Enki's"], "missingText": []}, {"lineNumber": "1", "text": "26-32.  \"Your lock has no rival. Your bolt is a fearsome lion. Your roof beams are the bull of heaven, an artfully made bright headgear. Your reed-mats are like lapis lazuli, decorating the roof-beams. Your vault is a  {bull} {(some mss. have instead:)  wild bull} raising its horns. Your door is a lion who  {seizes a man} {(1 ms. has instead:)  is awe-inspiring}. Your stairway is a lion coming down on a man.\"", "properNames": [], "missingText": []}, {"lineNumber": "1", "text": "33-43.  \"Abzu, pure place which fulfils its purpose! E-engura! Your lord has directed his steps towards you. Enki, lord of the abzu, has embellished your foundation pegs with cornelian. He has adorned you with …… and (?) lapis lazuli. The temple of Enki is provisioned with holy wax (?); it is a bull obedient to its master, roaring by itself and giving advice at the same time. E-engura, which Enki has surrounded with a holy reed fence! In your midst a lofty throne is erected, your door-jamb is the holy locking bar of heaven.\"", "properNames": ["E-engura", "Enki"], "missingText": []}, {"lineNumber": "1", "text": "44-48.  \"Abzu, pure place, place where the fates are determined -- the lord of wisdom, Lord Enki,  {(1 ms. adds 1 line:)  the lord who determines the fates,} Nudimmud, the lord of Eridug, lets nobody look into its midst. Your abgal priests let their hair down their backs.\"", "properNames": ["Enki", "Nudimmud", "Eridug"], "missingText": []}, {"lineNumber": "1", "text": "49-61.  \"Enki's beloved Eridug, E-engura whose inside is full of abundance! Abzu, life of the Land, beloved of Enki! Temple built on the edge, befitting the artful divine powers! Eridug, your shadow extends over the midst of the sea! Rising sea without a rival; mighty awe-inspiring river which terrifies the Land! E-engura, high citadel (?) standing firm on the earth! Temple at the edge of the engur, a lion in the midst of the abzu; lofty temple of Enki, which bestows wisdom on the Land; your cry, like that of a mighty rising river, reaches (?) King Enki.\"", "properNames": ["Enki's", "Eridug", "E-engura", "Enki"], "missingText": []}, {"lineNumber": "1", "text": "62-67.  \"He made  {the lyre, the alĝar instrument, the balaĝ drum with the drumsticks} {(some mss. have instead:)  the lyre, the alĝar instrument, the balaĝ drum of your sur priests} {(1 ms. has instead:)  your lyre and alĝar instrument, the balaĝ drum with the drumsticks} {(1 ms. has instead:)  the lyre, the alĝar instrument, the balaĝ drum and even the plectrum (?)}, the ḫarḫar, the sabitum, and the …… miritum instruments offer their best for his holy temple. The …… resounded by themselves with a sweet sound. The holy alĝar instrument of Enki played for him on his own and seven  {singers sang} {(some mss. have instead:)  tigi drums resounded.}\"", "properNames": ["Enki"], "missingText": []}, {"lineNumber": "1", "text": "68-70.  \"What Enki says is irrefutable; …… is well established (?).\" This is what Isimud spoke to the brick building; he praised the E-engura  {with sweet songs} {(1 ms. has instead:)  duly.}", "properNames": ["Enki", "E-engura"], "missingText": []}, {"lineNumber": "1", "text": "71-82. As it has been built, as it has been built; as Enki has raised Eridug up, it is an artfully built mountain which floats on the water. His shrine (?) spreads (?) out into the reedbeds; birds brood  {(1 ms. adds:)  at night} in its green orchards laden with fruit. The suḫur carp play among the honey-herbs, and the eštub carp dart among the small gizi reeds. When Enki rises, the fish rise before him like waves. He has the abzu stand as a marvel, as he brings joy into the engur.", "properNames": ["Enki", "Eridug"], "missingText": []}, {"lineNumber": "1", "text": "83-92. Like the sea, he is awe-inspiring; like a mighty river, he instils fear. The Euphrates rises before him as it does before the fierce south wind. His punting pole is  {Nirah} {(some mss. have instead:)  Imdudu}; his oars are the small reeds. When Enki embarks, the year will be full of abundance. The ship departs of its own accord, with tow rope held (?) by itself. As he leaves the temple of Eridug, the river gurgles (?) to its lord: its sound is a calf's mooing, the mooing of a good cow.", "properNames": ["Euphrates", "Nirah", "Imdudu", "Enki", "Eridug"], "missingText": []}, {"lineNumber": "1", "text": "93-95. Enki had oxen slaughtered, and had sheep offered there lavishly. Where there were no ala drums, he installed some in their places; where there were no bronze ub drums, he despatched some to their places.", "properNames": ["Enki"], "missingText": []}, {"lineNumber": "1", "text": "96-103. He directed his steps on his own to Nibru and entered the temple terrace, the shrine of Nibru. Enki reached for (?) the beer, he reached for (?) the liquor. He had liquor poured into big bronze containers, and had emmer-wheat beer pressed out (?). In kukuru containers which make the beer good he mixed beer-mash. By adding date-syrup to its taste (?), he made it strong. He …… its bran-mash.", "properNames": ["Nibru", "Enki"], "missingText": []}, {"lineNumber": "1", "text": "104-116. In the shrine of Nibru, Enki provided a meal for Enlil, his father. He seated An at the head of the table and seated Enlil next to An. He seated Nintur in the place of honour and seated the Anuna gods at the adjacent places (?). All of them were drinking and enjoying beer and liquor. They filled the bronze aga vessels to the brim and started a competition, drinking from the bronze vessels of Uraš. They made the tilimda vessels shine like holy barges. After beer and liquor had been libated and enjoyed, and after …… from the house, Enlil was made happy in Nibru.", "properNames": ["Nibru", "Enki", "Enlil", "An", "Nintur", "Anuna", "Uraš"], "missingText": []}, {"lineNumber": "1", "text": "117-129. Enlil addressed the Anuna gods:  \"Great gods who are standing here! Anuna, who have lined up in the Ubšu-unkena! My son, King Enki has built up the temple! He has made Eridug  {rise up (?)} {(1 ms. has instead:)  come out} from the ground like a mountain! He has built it in a pleasant place, in Eridug, the pure place, where no one is to enter -- a temple built with silver and decorated with lapis lazuli, a house which tunes the seven tigi drums properly, and provides incantations; where holy songs make all of the house a lovely place -- the shrine of the abzu, the good destiny of Enki, befitting the elaborate divine powers; the temple of Eridug, built with silver: for all this, Father Enki be praised!\"", "properNames": ["Enlil", "Anuna", "Ubšu-unkena", "Enki", "Eridug"], "missingText": []}], "transliterations": ["© Copyright 2003, 2004, 2005, 2006 The ETCSL project, Faculty of Oriental Studies, University of OxfordUpdated 2006-12-19 by JE"]}
{"id": "t.2.1.1", "title": "The Sumerian king list", "paragraphs": [{"lineNumber": "2", "text": "1-39. After the kingship descended from heaven, the kingship was in Eridug. In Eridug, Alulim became king; he ruled for 28800 years. Alalĝar ruled for 36000 years. 2 kings; they ruled for 64800 years. Then Eridug fell and the kingship was taken to Bad-tibira. In Bad-tibira, En-men-lu-ana ruled for 43200 years. En-men-gal-ana ruled for 28800 years. Dumuzid, the shepherd, ruled for 36000 years. 3 kings; they ruled for 108000 years. Then Bad-tibira fell (?) and the kingship was taken to Larag. In Larag, En-sipad-zid-ana ruled for 28800 years. 1 king; he ruled for 28800 years. Then Larag fell (?) and the kingship was taken to Zimbir. In Zimbir, En-men-dur-ana became king; he ruled for 21000 years. 1 king; he ruled for 21000 years. Then Zimbir fell (?) and the kingship was taken to Šuruppag. In Šuruppag, Ubara-Tutu became king; he ruled for 18600 years. 1 king; he ruled for 18600 years. In 5 cities 8 kings; they ruled for 241200 years. Then the flood swept over.", "properNames": ["Eridug", "Alulim", "Alalĝar", "Bad-tibira", "En-men-lu-ana", "En-men-gal-ana", "Dumuzid", "Larag", "En-sipad-zid-ana", "Zimbir", "En-men-dur-ana", "Šuruppag", "Ubara-Tutu", "Tutu"], "missingText": []}, {"lineNumber": "2", "text": "40-94. After the flood had swept over, and the kingship had descended from heaven, the kingship was in Kiš. In Kiš, Ĝušur became king; he ruled for 1200 years. Kullassina-bēl ruled for  {960} {(ms. P2+L2 has instead:)  900} years. Nanĝišlišma ruled for (ms. P2+L2 has:)   {670} (?) years. En-taraḫ-ana ruled for (ms. P2+L2 has:)   {420} years ……, 3 months, and 3 1/2 days. Babum …… ruled for (ms. P2+L2 has:)   {300} years. Puannum ruled for  {840} {(ms. P2+L2 has instead:)  240} years. Kalibum ruled for  {960} {(ms. P2+L2 has instead:)  900} years. Kalūmum ruled for  {840} {(mss. P3+BT14, Su1 have instead:)  900} years. Zuqāqīp ruled for  {900} {(ms. Su1 has instead:)  600} years. (in mss. P2+L2, P3+BT14, P5, the 10th and 11th rulers of the dynasty precede the 8th and 9th)   {Atab} {(mss. P2+L2, P3+BT14, P5 have instead:)  A-ba} ruled for 600 years. Mašda, the son of Atab, ruled for  {840} {(ms. Su1 has instead:)  720} years. Arwium, the son of Mašda, ruled for 720 years. Etana, the shepherd, who ascended to heaven and consolidated all the foreign countries, became king; he ruled for  {1500} {(ms. P2+L2 has instead:)  635} years. Baliḫ, the son of Etana, ruled for  {400} {(mss. P2+L2, Su1 have instead:)  410} years. En-me-nuna ruled for  {660} {(ms. P2+L2 has instead:)  621} years. Melem-Kiš, the son of En-me-nuna, ruled for 900 years.  {(ms. P3+BT14 adds:)  1560 are the years of the dynasty of En-me-nuna.}  {Barsal-nuna, the son of En-me-nuna,} {(mss. P5, P3+BT14 have instead:)  Barsal-nuna} ruled for 1200 years. Zamug, the son of Barsal-nuna, ruled for 140 years. Tizqār, the son of Zamug, ruled for 305 years.  {(ms. P3+BT14 adds:)  1620 + X …….} Ilku ruled for 900 years. Iltasadum ruled for 1200 years. En-me-barage-si, who made the land of Elam submit, became king; he ruled for 900 years. Aga, the son of En-me-barage-si, ruled for 625 years.  {(ms. P3+BT14 adds:)  1525 are the years of the dynasty of En-me-barage-si.} 23 kings; they ruled for 24510 years, 3 months, and 3 1/2 days. Then Kiš was defeated and the kingship was taken to E-ana.", "properNames": ["Kiš", "Ĝušur", "Kullassina-bēl", "Nanĝišlišma", "En-taraḫ-ana", "Babum", "Puannum", "Kalibum", "Kalūmum", "Zuqāqīp", "Atab", "A-ba", "Mašda", "Arwium", "Etana", "Baliḫ", "En-me-nuna", "Melem-Kiš", "Barsal-nuna", "Zamug", "Tizqār", "Ilku", "Iltasadum", "En-me-barage-si", "Elam", "Aga", "E-ana"], "missingText": []}, {"lineNumber": "2", "text": "95-133. In E-ana, Meš-ki-aĝ-gašer, the son of Utu, became lord and king; he ruled for  {324} {(ms. P2+L2 has instead:)  325} years. Meš-ki-aĝ-gašer entered the sea and disappeared. Enmerkar, the son of Meš-ki-aĝ-gašer, the king of Unug,  {who built Unug} {(mss. L1+N1, P2+L2 have instead:)  under whom Unug was built}, became king; he ruled for  {420} {(ms. TL has instead:)  900 + X} years.  {(ms. P3+BT14 adds:)  745 are the years of the dynasty of Meš-ki-aĝ-gašer.} {(ms TL adds instead:)  ……; he ruled for 5 + X years.} Lugalbanda, the shepherd, ruled for 1200 years. Dumuzid, the fisherman whose city was Kuara, ruled for  {100} {(ms. TL has instead:)  110} years.  {(ms. P3+BT14 adds:)  He captured En-me-barage-si single-handed.} Gilgameš, whose father was a phantom (?), the lord of Kulaba, ruled for 126 years. Ur-Nungal, the son of Gilgameš, ruled for 30 years. Udul-kalama, the son of  {Ur-Nungal} {(ms. Su1 has instead:)  Ur-lugal}, ruled for 15 years. Lā-ba’šum ruled for 9 years. En-nun-taraḫ-ana ruled for 8 years. Meš-ḫe, the smith, ruled for 36 years.  {Melem-ana} {(ms. Su2 has instead:)  Til-kug (?) ……} ruled for  {6} {(ms. Su2 has instead:)  900} years. Lugal-kitun (?) ruled for  {36} {(ms. Su2 has instead:)  420} years. 12 kings; they ruled for  {2310} {(ms. Su2 has instead:)  3588} years. Then Unug was defeated and the kingship was taken to Urim.", "properNames": ["E-ana", "Meš-ki-aĝ-gašer", "Utu", "Enmerkar", "Unug", "Lugalbanda", "Dumuzid", "Kuara", "En-me-barage-si", "Gilgameš", "Kulaba", "Ur-Nungal", "Nungal", "Udul-kalama", "Ur-lugal", "Lā-ba’šum", "En-nun-taraḫ-ana", "Meš-ḫe", "Melem-ana", "Til-kug", "Lugal-kitun", "Urim"], "missingText": []}, {"lineNumber": "2", "text": "134-147. In Urim, Meš-Ane-pada became king; he ruled for 80 years.  {Meš-ki-aĝ-Nanna} {(ms. P2+L2 has instead:)  Meš-ki-aĝ-nuna}, the son of Meš-Ane-pada, became king; he ruled for  {36} {(ms. P2+L2 has instead:)  30} years. Elulu ruled for (mss. L1+N1, P2+L2, P3+BT14 have:)   {25} years. Balulu ruled for (mss. L1+N1, P2+L2, P3+BT14 have:)   {36} years. (mss. L1+N1, P2+L2 have:)   {4} kings; they ruled for (mss. L1+N1, P2+L2, P3+BT14 have:)   {171} years. Then Urim was defeated and the kingship was taken to Awan.", "properNames": ["Urim", "Meš-Ane-pada", "Ane", "Meš-ki-aĝ-Nanna", "Nanna", "Meš-ki-aĝ-nuna", "Elulu", "Balulu", "Awan"], "missingText": []}, {"lineNumber": "2", "text": "148-159. In Awan, …… became king; he ruled for …… years. …… ruled for …… years. …… ruled for 36 years. 3 kings; they ruled for 356 years. Then Awan was defeated and the kingship was taken to Kiš.", "properNames": ["Awan", "Kiš"], "missingText": []}, {"lineNumber": "2", "text": "160-178. In Kiš, Susuda, the fuller, became king; he ruled for 201 + X years. Dadasig ruled for (ms. vD has:)   {81} years. Mamagal, the boatman, ruled for  {360} {(ms. L1+N1 has instead:)  420} years. Kalbum, the son of  {Mamagal} {(ms. WB has instead:)  Magalgal}, ruled for  {195} {(ms. L1+N1 has instead:)  132} years. Tuge (?) ruled for 360 years. Men-nuna {,(ms. L1+N1 adds:)  the son of Tuge (?),} ruled for 180 years. (in mss. L1+N1, TL, the 7th and 8th rulers of the dynasty are in reverse order)  …… ruled for 290 years. Lugalĝu ruled for  {360} {(ms. L1+N1 has instead:)  420} years. 8 kings; they ruled for  {3195} {(ms. L1+N1 has instead:)  3792} years. Then Kiš was defeated and the kingship was taken to Ḫamazi.", "properNames": ["Kiš", "Susuda", "Dadasig", "Mamagal", "Kalbum", "Magalgal", "Tuge", "Men-nuna", "Lugalĝu", "Ḫamazi"], "missingText": []}, {"lineNumber": "2", "text": "179-185. In Ḫamazi, Hadaniš became king; he ruled for 360 years. 1 king; he ruled for 360 years. Then Ḫamazi was defeated and the kingship  {was taken} {(ms. P3+BT14 has instead:)  was returned a second time} to Unug.", "properNames": ["Ḫamazi", "Hadaniš", "Unug"], "missingText": []}, {"lineNumber": "2", "text": "186-192. In Unug, En-šag-kuš-ana became king; he ruled for 60 years.  {Lugal-ure} {(ms. P3+BT14 has instead:)  Lugal-kiniše-dudu (?)} ruled for 120 years. Argandea ruled for 7 years. (ms. L1+N1 has:)   {3} kings; they ruled for (ms. L1+N1 has:)   {187} years. Then Unug was  {defeated} {(ms. TL has instead:)  destroyed} and the kingship was taken to Urim.", "properNames": ["Unug", "En-šag-kuš-ana", "Lugal-ure", "Lugal-kiniše-dudu", "Argandea", "Urim"], "missingText": []}, {"lineNumber": "2", "text": "193-204. In Urim, Nanni became king; he ruled for  {(ms. vD has:)  120 + X} {(ms. IB has instead:)  54 + X} years. Meš-ki-aĝ-Nanna, the son of Nanni, ruled for (ms. vD has:)   {48} years.  {……, the son (?) of ……, ruled for (ms. IB has:)   {2} years. (ms. IB has:)   {3} kings; they ruled for  {(ms. IB has:)  582} {(ms. TL has instead:)  578} years.} {(ms. vD has instead:)  2 kings; they ruled for 120 + X years.} Then Urim was  {defeated} {(ms. TL has instead:)  destroyed} and the kingship was taken to Adab.", "properNames": ["Urim", "Nanni", "Meš-ki-aĝ-Nanna", "Nanna", "Adab"], "missingText": []}, {"lineNumber": "2", "text": "205-210. In Adab, Lugal-Ane-mundu became king; he ruled for (mss. L1+N1, TL have:)   {90} years. (mss. L1+N1, TL have:)   {1} king; he ruled for (mss. L1+N1, TL have:)   {90} years. Then Adab was  {defeated} {(ms. TL has instead:)  destroyed} and the kingship was taken to Mari.", "properNames": ["Adab", "Lugal-Ane-mundu", "Ane", "Mari"], "missingText": []}, {"lineNumber": "2", "text": "211-223. In Mari, Anbu (?) became king; he ruled for  {30} {(ms. TL has instead:)  90} years. Anba (?), the son of Anbu (?), ruled for  {17} {(ms. TL has instead:)  7} years. Bazi, the leatherworker, ruled for 30 years. Zizi, the fuller, ruled for 20 years. Limer, the gudug priest, ruled for 30 years. Šarrum-īter ruled for  {9} {(ms. TL has instead:)  7} years. 6 kings; they ruled for  {136} {(ms. TL has instead:)  184} years. Then Mari was  {defeated} {(ms. TL has instead:)  destroyed} and the kingship was taken to Kiš.", "properNames": ["Mari", "Anbu", "Anba", "Bazi", "Zizi", "Limer", "Šarrum-īter", "Kiš"], "missingText": []}, {"lineNumber": "2", "text": "224-231. In Kiš, Kug-Bau, the woman tavern-keeper, who made firm the foundations of Kiš, became king; she ruled for 100 years. 1 king; she ruled for 100 years. Then Kiš was  {defeated} {(ms. TL has instead:)  destroyed} and the kingship was taken to Akšak.", "properNames": ["Kiš", "Kug-Bau", "Bau", "Akšak"], "missingText": []}, {"lineNumber": "2", "text": "232-243. In Akšak, Unzi became king; he ruled for 30 years. Undalulu ruled for  {6} {(mss. L1+N1, S have instead:)  12} years. Urur  {ruled for} {(ms. IB has instead:)  was king (?) for} 6 years. Puzur-Niraḫ ruled for (mss. IB, L1+N1, S, Su1 have:)   {20} years. Išu-Il ruled for (mss. IB, L1+N1, S, Su1 have:)   {24} years. Šu-Suen, the son of Išu-Il, ruled for  {(mss. IB, L1+N1, S, TL have:)  7} {(ms. Su1 has instead:)  24} years.  {(mss. S, Su1, TL have:)   {6} kings; they ruled for  {(mss. L1+N1, S, TL have:)  99} {(ms. Su1 has instead:)  116} years} {(ms. IB has instead:)  5 kings; they ruled for (ms. IB has:)   {87} years}.  {Then Akšak was defeated} {(ms. S has instead:)  Then the reign of Akšak was abolished} and the kingship was taken to Kiš.", "properNames": ["Akšak", "Unzi", "Undalulu", "Urur", "Puzur-Niraḫ", "Niraḫ", "Išu-Il", "Il", "Šu-Suen", "Suen", "Kiš"], "missingText": []}, {"lineNumber": "2", "text": "244-258. In Kiš, Puzur-Suen, the son of Kug-Bau, became king; he ruled for 25 years. Ur-Zababa, the son of Puzur-Suen, ruled for  {400} {(mss. P3+BT14, S have instead:)  6} {(ms. IB has instead:)  4 + X} years.  {(ms. P3+BT14 adds:)  131 are the years of the dynasty of Kug-Bau.}  {Zimudar} {(ms. TL has instead:)  Ziĝu-iake} ruled for  {30} {(ms. IB has instead:)  30 + X} years. Usi-watar, the son of  {Zimudar} {(ms. TL has instead:)  Ziĝu-iake}, ruled for  {7} {(ms. S has instead:)  6} years. Eštar-muti ruled for  {11} {(ms. Su1 has instead:)  17 (?)} years. Išme-Šamaš ruled for 11 years.  {(ms. Su1 adds:)  Šu-ilīšu ruled for 15 years.}  {Nanniya, the jeweller,} {(ms. Su1 has instead:)  Zimudar} {(ms. IB has instead:)  ……} ruled for  {7} {(ms. S has instead:)  3} years.  {7 kings; they ruled for  {491} {(ms. Su1 has instead:)  485} years} {(ms. S has instead:)  8 kings; they ruled for (ms. S has:)   {586} years}.  {Then Kiš was defeated} {(ms. S has instead:)  Then the reign of Kiš was abolished} and the kingship  {was taken} {(ms. P3+BT14 has instead:)  was returned a third time} to Unug.", "properNames": ["Kiš", "Puzur-Suen", "Suen", "Kug-Bau", "Bau", "Ur-Zababa", "Zababa", "Zimudar", "Ziĝu-iake", "Usi-watar", "Eštar-muti", "Eštar", "Išme-Šamaš", "Šamaš", "Šu-ilīšu", "Nanniya", "Unug"], "missingText": []}, {"lineNumber": "2", "text": "259-265. In Unug, Lugal-zage-si became king; he ruled for  {25} {(ms. P3+BT14 has instead:)  34} years. 1 king; he ruled for  {25} {(ms. P3+BT14 has instead:)  34} years.  {Then Unug was defeated} {(ms. S has instead:)  Then the reign of Unug was abolished} and the kingship was taken to Agade.", "properNames": ["Unug", "Lugal-zage-si", "Agade"], "missingText": []}, {"lineNumber": "2", "text": "266-296. In Agade, Sargon, whose father was a gardener, the cupbearer of Ur-Zababa, became king, the king of Agade,  {who built Agade} {(ms. L1+N1 has instead:)  under whom Agade was built}; he ruled for  {56} {(ms. L1+N1 has instead:)  55} {(ms. TL has instead:)  54} years. Rīmuš, the son of Sargon, ruled for  {9} {(ms. IB has instead:)  7} {(ms. L1+N1 has instead:)  15} years. Man-ištiššu, the older brother of Rīmuš, the son of Sargon, ruled for  {15} {(ms. L1+N1 has instead:)  7} years. Narām-Suen, the son of Man-ištiššu, ruled for (mss. L1+N1, P3+BT14 have:)   {56} years. Šar-kali-šarrī, the son of Narām-Suen, ruled for  {(ms. L1+N1, Su+Su4 have:)  25} {(ms. P3+BT14 has instead:)  24} years.  {(ms. P3+BT14 adds:)  157 are the years of the dynasty of Sargon.} Then  {who was the king? Who was not the king?} {(ms. Su3+Su4 has instead:)  who was the king? Who indeed was the king?} Irgigi was king, Imi was king, Nanûm was king (in mss. L1+N1, Su3+Su4, Imi and Nanûm are in reverse order) , Ilulu was king, and the (mss. P3+BT14, S have:)   {4} of them ruled for only (mss. P3+BT14, S have:)   {3} years. Dudu ruled for 21 years. Šu-Durul, the son of Dudu, ruled for  {15} {(ms. IB has instead:)  18} years.  {11 kings; they ruled for 181 years} {(ms. S has instead:)  12 kings; they ruled for (ms. S has:)   {197} years} {(mss. Su1, Su3+Su4, which omit Dudu and Šu-Durul, have instead:)  9 kings; they ruled for  {(ms. Su1 has:)   161} {(ms. Su3+Su4 has instead:)  177} years}.  {Then Agade was defeated} {(ms. S has instead:)  Then the reign of Agade was abolished} and the kingship was taken to Unug.", "properNames": ["Agade", "Sargon", "Ur-Zababa", "Zababa", "Rīmuš", "Man-ištiššu", "Narām-Suen", "Suen", "Šar-kali-šarrī", "Irgigi", "Imi", "Nanûm", "Ilulu", "Dudu", "Šu-Durul", "Durul", "Unug"], "missingText": []}, {"lineNumber": "2", "text": "297-307. In Unug, Ur-niĝin became king; he ruled for  {7} {(mss. IB, S have instead:)  3} {(ms. Su1 has instead:)  15} {(ms. Su3+Su4 has instead:)  30} years. Ur-gigir, the son of Ur-niĝin, ruled for  {6} {(ms. IB has instead:)  7} {(ms. Su1 has instead:)  15} {(ms. Su3+Su4 has instead:)  7} years. Kuda ruled for 6 years. Puzur-ilī ruled for  {5} {(ms. IB has instead:)  20} years.  {Ur-Utu ruled for 6} {(ms. Su3+Su4 has instead:)  Ur-Utu, the son of Ur-gigir, ruled for 25} {(ms. Su1 has instead:)  Lugal-melem, the son of Ur-gigir, ruled for 7} years.  {5 kings; they ruled for  {30} {(ms. IB has instead:)  43} {(mss. P&s4;+Ha, S have instead:)  26} years} {(ms. Su3+Su4, which omits Kuda and Puzur-ilī, has instead:)  3 kings; they ruled for (ms. Su3+Su4 has:)   {47} years}.  {Unug was defeated} {(ms. S has instead:)  Then the reign of Unug was abolished} and the kingship was taken to the  {army} {(ms. Su3+Su4 has instead:)  land} of Gutium.", "properNames": ["Unug", "Ur-niĝin", "Ur-gigir", "Kuda", "Puzur-ilī", "Ur-Utu", "Utu", "Lugal-melem", "Gutium"], "missingText": []}, {"lineNumber": "2", "text": "308-334. In the  {army} {(ms. Su3+Su4 has instead:)  land} of Gutium, at first  {no king was famous; they were their own kings and ruled thus for 3 years} {(ms. L1+N1 has instead:)  they had no king; they ruled themselves for 5 years}. Then  {Inkišuš} {(ms. Su3+Su4 has instead:)  ……} ruled for  {6} {(ms. L1+Ni1 has instead:)  7} years. Zarlagab ruled for 6 years.  {Šulme} {(ms. L1+N1 has instead:)  Yarlagaš} ruled for 6 years.  {Silulumeš} {(ms. Mi has instead:)  Silulu} ruled for  {6} {(ms. G has instead:)  7} years.  {Inimabakeš ruled for 5} {(ms. Mi has instead:)  Duga ruled for 6} years.  {Igešauš ruled for 6} {(ms. Mi has instead:)  Ilu-an (?) ruled for 3} years. Yarlagab ruled for  {15} {(ms. Mi has instead:)  5} years. Ibate ruled for 3 years.  {Yarla} {(ms. L1+N1 has instead:)  Yarlangab (?)} ruled for 3 years.  {Kurum} {(ms. L1+N1 has instead:)  ……} ruled for  {1} {(ms. Mi has instead:)  3} years. Apilkin ruled for 3 years. Lā-erabum (?) ruled for 2 years. Irarum ruled for 2 years. Ibranum ruled for 1 year. Ḫablum ruled for 2 years. Puzur-Suen, the son of Ḫablum, ruled for 7 years. Yarlaganda ruled for 7 years. …… ruled for 7 years. Tirigan (?) ruled for 40 days. 21 kings; they ruled for  {(ms. L1+N1 has:)  124 years and 40 days} {(ms. Su3+Su4 has instead:)  25 years}. Then the army of Gutium was  {defeated} {(ms. TL has instead:)  destroyed} and the kingship was taken to Unug.", "properNames": ["Gutium", "Inkišuš", "Zarlagab", "Šulme", "Yarlagaš", "Silulumeš", "Silulu", "Inimabakeš", "Duga", "Igešauš", "Ilu-an", "Yarlagab", "Ibate", "Yarla", "Yarlangab", "Kurum", "Apilkin", "Lā-erabum", "Irarum", "Ibranum", "Ḫablum", "Puzur-Suen", "Suen", "Yarlaganda", "Tirigan", "Unug"], "missingText": []}, {"lineNumber": "2", "text": "335-340. In Unug, Utu-ḫeĝal became king; he ruled for  {427 years, …… days} {(ms. IB has instead:)  26 years, 2 + X months, and 15 days} {(ms. J has instead:)  7 years, 6 months, and 15 days} {(ms. TL has instead:)  7 years, 6 months, and 5 days}. 1 king; he ruled for  {427 years, …… days} {(ms. J has instead:)  7 years, 6 months, and 15 days} {(ms. TL has instead:)  7 years, 6 months, and 5 days}. Then Unug was defeated and the kingship was taken to Urim.", "properNames": ["Unug", "Utu-ḫeĝal", "Utu", "Urim"], "missingText": []}, {"lineNumber": "2", "text": "341-354. In Urim, Ur-Namma became king; he ruled for 18 years. Šulgi, the son of Ur-Namma, ruled for  {46} {(mss. Su3+Su4, TL have instead:)  48} {(ms. P5 has instead:)  58} years. Amar-Suena, the son of Šulgi, ruled for  {9} {(ms. Su3+Su4 has instead:)  25} years. Šu-Suen, the son of Amar-Suena, ruled for  {9} {(ms. P5 has instead:)  7} {(ms. Su1 has instead:)  20 + X} {(ms. Su3+Su4 has instead:)  16} years. Ibbi-Suen, the son of Šu-Suen, ruled for  {24} {(mss. P5, Su1 have instead:)  25} {(ms. Su3+Su4 has instead:)  15} {(ms. TL has instead:)  23 (?)} years.  {4 kings; they ruled for 108 years} {(mss. J, P5, Su1, Su3+Su4 have instead:)  5 kings; they ruled for  {(ms. P5 has:)  117} {(ms. Su1 has instead:)  120 + X} {(ms. Su3+Su4 has instead:)  123} years}.  {Then Urim was defeated} {(ms. P5 has instead:)  Then the reign of Urim was abolished}.  {(ms. Su3+Su4 adds:)  The very foundation of Sumer was torn out (?).} The kingship was taken to Isin.", "properNames": ["Urim", "Ur-Namma", "Namma", "Šulgi", "Amar-Suena", "Suena", "Šu-Suen", "Suen", "Ibbi-Suen", "Sumer", "Isin"], "missingText": []}, {"lineNumber": "2", "text": "355-377. In Isin, Išbi-Erra became king; he ruled for  {33} {(ms. P5 has instead:)  32} years. Šu-ilīšu, the son of Išbi-Erra, ruled for  {20} {(ms. P5 has instead:)  10} {(ms. Su1 has instead:)  15} years. Iddin-Dagan, the son of Šu-ilīšu, ruled for  {21} {(ms. Su1 has instead:)  25} years. Išme-Dagan, the son of Iddin-Dagan, ruled for  {(mss. P2, P5 have:)  20} {(ms. Mi has instead:)  18} years. Lipit-Eštar, the son of  {Išme-Dagan} {(ms. P2 has instead:)  Iddin-Dagan}, ruled for (mss. L1+N1, P2, P5 have:)   {11} years. Ur-Ninurta {(mss. L1+N1, P2 add:) , the son of Iškur -- may he have years of abundance, a good reign, and a sweet life --} ruled for (ms. P5 has:)   {28} years. Būr-Suen, the son of Ur-Ninurta, ruled for 21 years. Lipit-Enlil, the son of Būr-Suen, ruled for 5 years. Erra-imitti ruled for  {8} {(mss. P5, TL have instead:)  7} years.  {(ms. P5 adds:)  …… ruled for …… 6 months.} Enlil-bāni ruled for 24 years. Zambiya ruled for 3 years. Iter-piša ruled for 4 years. Ur-du-kuga ruled for 4 years. Suen-magir ruled for 11 years.  {(ms. P5 adds:)  Damiq-ilišu, the son of Suen-magir, ruled for 23 years.} 14 kings; they ruled for  {203 years} {(ms. P5 has instead:)  225 years and 6 months}.", "properNames": ["Isin", "Išbi-Erra", "Erra", "Šu-ilīšu", "Iddin-Dagan", "Dagan", "Išme-Dagan", "Lipit-Eštar", "Eštar", "Ur-Ninurta", "Ninurta", "Iškur", "Būr-Suen", "Suen", "Lipit-Enlil", "Enlil", "Erra-imitti", "Enlil-bāni", "Zambiya", "Iter-piša", "Ur-du-kuga", "Suen-magir", "Damiq-ilišu"], "missingText": []}, {"lineNumber": "2", "text": "378-431. A total of 39 kings ruled for 14409 + X years, 3 months and 3 1/2 days, 4 times in Kiš. A total of 22 kings ruled for 2610 + X years, 6 months and 15 days, 5 times in Unug. A total of 12 kings ruled for 396 years, 3 times in Urim. A total of 3 kings ruled for 356 years, once in Awan. A total of 1 king ruled for 420 years, once in Ḫamazi. 16 lines missing A total of 12 (?) kings ruled for 197 (?) years, once in Agade. A total of  {21} {(ms. P4+Ha has instead:)  23} kings ruled for  {125 years and 40 days} {(ms. P4+Ha has instead:)  99 years}, once in the army of Gutium. A total of  {11} {(ms. P4+Ha has instead:)  16} kings ruled for  {159} {(ms. P4+Ha has instead:)  226} years, once in Isin. There are 11 cities, cities in which the kingship was exercised. A total of  {134} {(ms. P4+Ha has instead:)  139} kings, who altogether ruled for  {28876 + X} {(ms. P4+Ha has instead:)  3443 + X} years. 21.", "properNames": ["Kiš", "Unug", "Urim", "Awan", "Ḫamazi", "Agade", "Gutium", "Isin"], "missingText": ["16 lines missing"]}], "transliterations": ["© Copyright 2003, 2004, 2005, 2006 The ETCSL project, Faculty of Oriental Studies, University of OxfordUpdated 2006-12-19 by JE"]}
{"id": "t.2.1.2", "title": "The rulers of Lagaš", "paragraphs": [{"lineNumber": "2", "text": "1-16. After the flood had swept over and brought about the destruction of the countries; when mankind was made to endure, and the seed of mankind was preserved and the black-headed people all rose; when An and Enlil called the name of mankind and established rulership, but kingship and the crown of the city had not yet come out from heaven, and Ninĝirsu had not yet established for the multitude of well-guarded (?) people the pickaxe, the spade, the earth basket and the plough, which mean life for the Land -- in those days, the carefree youth of man lasted for 100 years and, following his upbringing, he lasted for another 100 years.", "properNames": ["An", "Enlil", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "17-31. However, he did not do any work. He became smaller and smaller, ……; his sheep died (?) in the sheepfold. In those days, because the water of Lagaš was held back, there was famine in Ĝirsu. Canals were not dug, the levees and ditches were not cleaned. The large arable tracts were not ……, there was no water to irrigate abundantly all the cultivated fields: the people relied on rain; Ezina did not make dappled barley grow, furrows were not yet opened, they bore no yield; the high plain was not tilled, it bore no yield.", "properNames": ["Lagaš", "Ĝirsu", "Ezina"], "missingText": []}, {"lineNumber": "2", "text": "32-49. None of the countries with numerous people libated emmer beer, liquor, ……, sweet liquor or …… for the gods. They did not till large fields for them with the plough. 10 lines missing …… the canal. …… its (?) fields.", "properNames": [], "missingText": ["10 lines missing"]}, {"lineNumber": "2", "text": "50-65. In order to dig canals, to clean the levees and ditches, to …… the large arable tracts, to …… all the cultivated fields, he established for the people the pickaxe, the spade, the earth basket, and the plough, which mean life for the Land. Then he turned his attention to making barley sprout. He made the people stand before the maiden, and they raised their heads day and night, at the appointed times. Before Ezina who makes the seeds grow, they prostrated themselves and she made them grow (?). Before (?) Ezina who makes the dappled barley grow, they …… 33 lines missing or uncertain", "properNames": ["Ezina"], "missingText": ["33 lines missing or uncertain"]}, {"lineNumber": "2", "text": "99-102. …… acted for …… years. …… dug the canal ……, he acted for 2760 years.", "properNames": [], "missingText": []}, {"lineNumber": "2", "text": "103-124. En-akigalaguba: his personal god was ……, he dug the canal Niĝin-ĝiš-tukuam, he acted for 1200 years. In those days there was no writing, ……, canals were not dug, earth baskets were not carried. In those days, ……, the people …… offerings of refined gold 2 lines uncertain a good shepherd rose over the Land; he gave them (?) …… as a gift. En-Ninĝirsu-ki-aĝ, the son of En-akigalaguba: he acted for 1320 years. En-Enlile-ki-aĝ, the son of En-Ninĝirsu-ki-aĝ: he acted for 1800 years. Ur-Bau the son of En-Enlile-ki-aĝ: he acted for 900 years.", "properNames": ["En-akigalaguba", "Niĝin-ĝiš-tukuam", "En-Ninĝirsu-ki-aĝ", "Ninĝirsu", "En-Enlile-ki-aĝ", "Enlile", "Ur-Bau", "Bau"], "missingText": ["2 lines uncertain"]}, {"lineNumber": "2", "text": "125-130. A-gal: his personal god was Ig-alim, he acted for 660 years. Kue (?), the son of A-gal: he acted for 1200 years. Ama-alim, son of Kue (?): ……, he acted for 600 years.", "properNames": ["A-gal", "Ig-alim", "Kue", "Ama-alim"], "missingText": []}, {"lineNumber": "2", "text": "131-142. 12 lines unclear or missing(the lines list further rulers with unrecoverable names and length of rule)", "properNames": [], "missingText": ["12 lines unclear or missing"]}, {"lineNumber": "2", "text": "143-163. 2 lines missing he dug the Maḫ canal, the …… canal, the Piriĝgin-ĝen canal, the …… canal, the Piriĝ canal at the mouth of the Lugal canal, the Gana-hili-ana canal, the …… canal, and the Nanše-pada canal. To care, single-handedly, for the great arable lands, he dug irrigation ditches and ……, he acted for 2220 years. Ur-Nanše, the son of ……, who built the E-Sirara, her temple of happiness and Niĝin, her beloved city, acted for 1080 years. Ane-tum, the son of Ur-Nanše, in whose …… place the gods stood, who …… the land register of great Enlil: his personal god was Šul-utul, he acted for 690 years. ……, the son of Ane-tum: he acted for X + 360 years.", "properNames": ["Maḫ", "Piriĝgin-ĝen", "Piriĝ", "Lugal", "Gana-hili-ana", "Nanše-pada", "Nanše", "Ur-Nanše", "E-Sirara", "Niĝin", "Ane-tum", "Ane", "Enlil", "Šul-utul"], "missingText": ["2 lines missing"]}, {"lineNumber": "2", "text": "164-172. En-entar-zid: his god was Meš-an-du (?), of the seed of ancient days, who had grown together with the city, he acted for 990 years. ……, the son of En-entar-zid: he dug the canal Urmaḫ-banda, and the canal Tabta-kug-ĝal, his personal god was Meš-an-du (?); his master Ninĝirsu commanded him to build his temple; he acted for 960 years.", "properNames": ["En-entar-zid", "Meš-an-du", "Urmaḫ-banda", "Tabta-kug-ĝal", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "173-175. En-Enlile-su: he acted for 600 years. ……, the son of En-Enlile-su: his personal god was Ninazu; he acted for 660 years.", "properNames": ["En-Enlile-su", "Enlile", "Ninazu"], "missingText": []}, {"lineNumber": "2", "text": "176. ……: he acted for 1110 years.", "properNames": [], "missingText": []}, {"lineNumber": "2", "text": "177-181. Puzur-Ninlil: he acted for X × 60 + 1 years. En-Meš-an-du (?), the son of Puzur-Ninlil: his personal god was ……, he acted for 120 years. Dadu, the son of En-Meš-an-du (?): he acted for 160 years. Tuggur, the son of Dadu: he acted for 160 years.", "properNames": ["Puzur-Ninlil", "Ninlil", "En-Meš-an-du", "Meš-an-du", "Dadu", "Tuggur"], "missingText": []}, {"lineNumber": "2", "text": "182. ……: he acted for 120 years.", "properNames": [], "missingText": []}, {"lineNumber": "2", "text": "183-191. Puzur-Mama, the scribe of Ninki: his personal god was Zazaru; he acted for …… years. Lamku-niĝgena (?), the administrator of Puzur-Mama, who built the wall of Ĝirsu, his ……, and the Tiraš palace in Lagaš: he acted for 280 years. Ḫenĝal, the son of Lamku-niĝgena (?): his god was Pabilsaĝ (?), he acted for 140 years. ……, the son of Ḫenĝal: he acted for 144 years.", "properNames": ["Puzur-Mama", "Mama", "Ninki", "Zazaru", "Lamku-niĝgena", "Ĝirsu", "Lagaš", "Ḫenĝal", "Pabilsaĝ"], "missingText": []}, {"lineNumber": "2", "text": "192-199. Ur-Ninmarki, the scribe and scholar: ……, his personal gods were Ḫaya and Nisaba, he acted for X + 20 years. Ur-Ninĝirsu, the son of Ur-Ninmarki: he acted for X × 60 years. Ur-Bau, the scribe of Ur-Ninĝirsu, who …… in the assembly: he acted for X + 30 years. Gudea, the younger brother of Ur-Bau, ……, who was not the son of his mother nor the son of his father: he acted for …… years.", "properNames": ["Ur-Ninmarki", "Ninmarki", "Ḫaya", "Nisaba", "Ur-Ninĝirsu", "Ninĝirsu", "Ur-Bau", "Bau", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "200. Written in the school. Nisaba be praised!", "properNames": ["Nisaba"], "missingText": []}], "transliterations": ["© Copyright 2003, 2004, 2005, 2006 The ETCSL project, Faculty of Oriental Studies, University of OxfordUpdated 2006-12-19 by JE"]}
{"id": "t.2.1.3", "title": "The history of the Tummal", "paragraphs": [{"lineNumber": "2", "text": "1-6. En-me-barage-si, the king, built the Iri-nanam in Enlil's temple. Aga, son of En-me-barage-si, made the Tummal flourish and brought Ninlil into the Tummal. Then the Tummal fell into ruins for the first time.", "properNames": ["En-me-barage-si", "Iri-nanam", "Enlil's", "Aga", "Tummal", "Ninlil"], "missingText": []}, {"lineNumber": "2", "text": "7-11. Meš-Ane-pada built the Bur-šušua in Enlil's temple. Meš-ki-aĝ-nuna, son of Meš-Ane-pada, made the Tummal flourish and brought Ninlil into the Tummal. Then the Tummal fell into ruins for a second time.", "properNames": ["Meš-Ane-pada", "Bur-šušua", "Enlil's", "Meš-ki-aĝ-nuna", "Tummal", "Ninlil"], "missingText": []}, {"lineNumber": "2", "text": "12-16. Gilgameš built the Numunbura in Enlil's shrine. Ur-lugal, son of Gilgameš, made the Tummal flourish and brought Ninlil into the Tummal. Then the Tummal fell into ruins for a third time.", "properNames": ["Gilgameš", "Numunbura", "Enlil's", "Ur-lugal", "Tummal", "Ninlil"], "missingText": []}, {"lineNumber": "2", "text": "17-21. Nanni built the Lofty Garden in Enlil's temple. Meš-ki-aĝ-Nanna, son of Nanni, made the Tummal flourish and brought Ninlil into the Tummal. Then the Tummal fell into ruins for a fourth time.", "properNames": ["Nanni", "Enlil's", "Meš-ki-aĝ-Nanna", "Nanna", "Tummal", "Ninlil"], "missingText": []}, {"lineNumber": "2", "text": "22-26. Ur-Namma, built the E-kur. Šulgi, son of Ur-Namma, made the Tummal flourish and brought Ninlil into the Tummal. Then the Tummal fell into ruins for a fifth time.", "properNames": ["Ur-Namma", "Namma", "E-kur", "Šulgi", "Tummal", "Ninlil"], "missingText": []}, {"lineNumber": "2", "text": "27-30. From the years of  {Amar-Suena} {(1 ms. has instead:)  Šu-Suen} until King Ibbi-Suen chose  {En-am-gal-ana} {(1. ms. has instead:)  En-me-gal-ana} by extispicy as the high priest of Inana of Unug, Ninlil came regularly to the Tummal.", "properNames": ["Amar-Suena", "Suena", "Šu-Suen", "Suen", "Ibbi-Suen", "En-am-gal-ana", "En-me-gal-ana", "Inana", "Unug", "Ninlil", "Tummal"], "missingText": []}, {"lineNumber": "2", "text": "31. Written according to the words of Lu-Inana the chief leatherworker of Enlil.", "properNames": ["Lu-Inana", "Enlil"], "missingText": []}, {"lineNumber": "2", "text": "32-33. Išbi-Erra, who looks after the E-kur, built the storehouse of Enlil.", "properNames": ["Išbi-Erra", "Erra", "E-kur", "Enlil"], "missingText": []}], "transliterations": ["© Copyright 2003, 2004, 2005, 2006 The ETCSL project, Faculty of Oriental Studies, University of OxfordUpdated 2006-12-19 by JE"]}
{"id": "t.2.1.4", "title": "Sargon and Ur-Zababa", "paragraphs": [{"lineNumber": "2", "text": "1-9. To …… the sanctuary like a cargo ship; to …… its great furnaces; to see that its canals …… waters of joy, to see that the hoes till the arable tracts and that …… the fields; to turn the house of Kiš, which was like a haunted town, into a living settlement again -- its king, shepherd Ur-Zababa, rose like Utu over the house of Kiš. An and Enlil, however, authoritatively (?) decided (?) by their holy command to alter his term of reigning and to remove the prosperity of the palace.", "properNames": ["Kiš", "Ur-Zababa", "Zababa", "Utu", "An", "Enlil"], "missingText": []}, {"lineNumber": "2", "text": "10-13. Then Sargon -- his city was the city of ……, his father was La’ibum, his mother …… -- Sargon …… with happy heart. Since he was born ……. unknown no. of lines missing", "properNames": ["Sargon", "La’ibum"], "missingText": ["unknown no. of lines missing"]}, {"lineNumber": "2", "text": "1-7. One day, after the evening had arrived and Sargon had brought the regular deliveries to the palace, Ur-Zababa was sleeping (and dreaming) in the holy bed-chamber, his holy residence. He realised what the dream was about, but did not put into words, did not discuss it with anyone. After Sargon had received the regular deliveries for the palace, Ur-Zababa appointed him cupbearer, putting him in charge of the drinks cupboard. Holy Inana did not cease to stand by him.", "properNames": ["Sargon", "Ur-Zababa", "Zababa", "Inana"], "missingText": []}, {"lineNumber": "2", "text": "8-11. After five or 10 days had passed, King Ur-Zababa …… and became frightened in his residence. Like a lion he urinated, sprinkling his legs, and the urine contained blood and pus. He was troubled, he was disturbed like a fish living in brackish water.", "properNames": ["Ur-Zababa", "Zababa"], "missingText": []}, {"lineNumber": "2", "text": "12-24. It was then that the cupbearer of Ezina's wine-house, Sargon, lay down not to sleep, but lay down to dream. In the dream, holy Inana drowned Ur-Zababa in a river of blood. The sleeping Sargon groaned and gnawed the ground. When King Ur-Zababa heard about this groaning, he was brought into the king's holy presence, Sargon was brought into the presence of Ur-Zababa (who said:)  \"Cupbearer, was a dream revealed to you in the night?\" Sargon answered his king:  \"My king, this is my dream, which I will tell you about: There was a young woman who was as high as the heavens and as broad as the earth. She was firmly set as the base of a wall. For me, she drowned you in a great river, a river of blood.\"", "properNames": ["Ezina's", "Sargon", "Inana", "Ur-Zababa", "Zababa"], "missingText": []}, {"lineNumber": "2", "text": "25-34. Ur-Zababa chewed his lips, he became seriously afraid. He spoke to ……, his chancellor:  \"My royal sister, holy Inana, is going to change (?) my finger into a …… of blood; she will drown Sargon, the cupbearer, in the great river. Beliš-tikal, chief smith, man of my choosing, who can write tablets, I will give you orders, let my orders be carried out! Let my advice be followed! Now then, when the cupbearer has delivered my bronze hand-mirror (?) to you, in the E-sikil, the fated house, throw them (the mirror and Sargon) into the mould like statues.\"", "properNames": ["Ur-Zababa", "Zababa", "Inana", "Sargon", "Beliš-tikal", "E-sikil"], "missingText": []}, {"lineNumber": "2", "text": "35-45. Beliš-tikal heeded his king's words and prepared the moulds in the E-sikil, the fated house. The king spoke to Sargon:  \"Go and deliver my bronze hand-mirror (?) to the chief smith!\" Sargon left the palace of Ur-Zababa. Holy Inana, however, did not cease to stand at his right hand side, and before he had come within five or 10 nindan of the E-sikil, the fated house, holy Inana turned around toward him and blocked his way, (saying:)  \"The E-sikil is a holy house! No one polluted with blood should enter it!\" Thus he met the chief smith of the king only at the gate of the fated house. After he delivered the king's bronze hand-mirror (?) to the chief smith, Beliš-tikal, the chief smith, …… and threw it into the mould like statues.", "properNames": ["Beliš-tikal", "E-sikil", "Sargon", "Ur-Zababa", "Zababa", "Inana"], "missingText": []}, {"lineNumber": "2", "text": "46-52. After five or 10 days had passed, Sargon came into the presence of Ur-Zababa, his king; he came into the palace, firmly founded like a great mountain. King Ur-Zababa …… and became frightened in his residence. He realised what was it about, but did not put into words, did not discuss it with anyone. Ur-Zababa became frightened in the bed-chamber, his holy residence. He realised what was it about, but did not put into words, did not discuss it with anyone.", "properNames": ["Sargon", "Ur-Zababa", "Zababa"], "missingText": []}, {"lineNumber": "2", "text": "53-56. In those days, although writing words on tablets existed, putting tablets into envelopes did not yet exist. King Ur-Zababa despatched Sargon, the creature of the gods, to Lugal-zage-si in Unug with a message written on clay, which was about murdering Sargon. unknown no. of lines missing", "properNames": ["Ur-Zababa", "Zababa", "Sargon", "Lugal-zage-si", "Unug"], "missingText": ["unknown no. of lines missing"]}, {"lineNumber": "2", "text": "1-7. With the wife of Lugal-zage-si ……. She (?) …… her feminity as a shelter. Lugal-zage-si did not …… the envoy.  \"Come! He directed his steps to brick-built E-ana!\" Lugal-zage-si did not grasp it, he did not talk to the envoy. But as soon as he did talk to the envoy ……. The lord said  \"Alas!\" and sat in the dust.", "properNames": ["Lugal-zage-si", "E-ana"], "missingText": []}, {"lineNumber": "2", "text": "8-12. Lugal-zage-si replied to the envoy:  \"Envoy, Sargon does not yield.\"After he has submitted,Sargon …… Lugal-zage-si ……. Sargon …… Lugal-zage-si ……. Why …… Sargon ……?", "properNames": ["Lugal-zage-si", "Sargon"], "missingText": []}], "transliterations": ["© Copyright 2003, 2004, 2005, 2006 The ETCSL project, Faculty of Oriental Studies, University of OxfordUpdated 2006-12-19 by JE"]}
{"id": "t.2.1.5", "title": "The cursing of Agade", "paragraphs": [{"lineNumber": "2", "text": "1-9. After Enlil's frown had slain Kiš as if it were the Bull of Heaven, had slaughtered the house of the land of Unug in the dust as if it were a mighty bull, and then Enlil had given the rulership and kingship from the south as far as the highlands to Sargon, king of Agade -- at that time, holy Inana established the sanctuary of Agade as her celebrated woman's domain; she set up her throne in Ulmaš.", "properNames": ["Enlil's", "Kiš", "Unug", "Enlil", "Sargon", "Agade", "Inana", "Ulmaš"], "missingText": []}, {"lineNumber": "2", "text": "10-24. Like a young man building a house for the first time, like a girl establishing a woman's domain, holy Inana did not sleep as she ensured that the warehouses would be provisioned; that dwellings would be founded in the city; that its people would eat splendid food; that its people would drink splendid beverages; that those bathed for holidays would rejoice in the courtyards; that the people would throng the places of celebration; that acquaintances would dine together; that foreigners would cruise about like unusual birds in the sky; that even Marhaši would be re-entered on the tribute rolls; that monkeys, mighty elephants, water buffalo, exotic animals, as well as thoroughbred dogs, lions,  {mountain ibexes} {(some mss. have instead:)  mountain beasts (?)} {(some mss. have instead:)  horses}, and alum sheep with long wool would jostle each other in the public squares.", "properNames": ["Inana", "Marhaši"], "missingText": []}, {"lineNumber": "2", "text": "25-39. She then filled Agade's stores for emmer wheat with gold, she filled its stores for white emmer wheat with silver; she delivered copper, tin, and blocks of lapis lazuli to its granaries and sealed its silos from outside. She endowed its old women with the gift of giving counsel, she endowed its old men with the gift of eloquence. She endowed its young women with the gift of entertaining, she endowed its young men with martial might, she endowed its little ones with joy. The nursemaids  {who cared for} {(some mss. have instead:)  of} the general's children played the drumsticks. Inside the city tigi drums sounded; outside it, flutes and zamzam instruments. Its harbour where ships moored was full of joy. All foreign lands rested contentedly, and their people experienced happiness.", "properNames": ["Agade's"], "missingText": []}, {"lineNumber": "2", "text": "40-56. Its king, the shepherd Naram-Suen, rose as the daylight on the holy throne of Agade. Its city wall  {, like a mountain,} {(1 ms. has instead:) , a great mountain,} reached the heavens. It was like the Tigris  {going to} {(some mss. have instead:)  flowing into} the sea as holy Inana opened the portals of its city-gates and made Sumer bring its own possessions upstream by boats. The highland Martu, people ignorant of agriculture, brought spirited cattle and kids for her. The Meluḫans, the people of the black land, brought  {exotic wares} {(some mss. have instead:)  wares of foreign countries} up to her. Elam and Subir loaded themselves with goods for her as if they were packasses. All the governors, the  {temple administrators} {(1 ms. has instead:)  generals}, and the accountants of the Gu-edina regularly supplied the monthly and New Year offerings. What a weariness all these caused at Agade's city gates! Holy Inana could hardly receive all these offerings. As if she were a citizen there, she could not restrain (?) the desire (?) to prepare the ground for a temple.", "properNames": ["Naram-Suen", "Suen", "Agade", "Tigris", "Inana", "Sumer", "Martu", "Meluḫans", "Elam", "Subir", "Gu-edina", "Agade's"], "missingText": []}, {"lineNumber": "2", "text": "57-65. But the statement coming from the E-kur was disquieting. Because of Enlil (?) all Agade was reduced (?) to trembling, and terror befell Inana in Ulmaš. She left the city, returning to her home. Holy Inana abandoned the sanctuary of Agade like someone abandoning the young women of her woman's domain. Like a warrior hurrying to arms, she  {removed} {(some mss. have instead:)  tore away} the gift of battle and fight from the city and handed them over to the enemy.", "properNames": ["E-kur", "Enlil", "Agade", "Inana", "Ulmaš"], "missingText": []}, {"lineNumber": "2", "text": "66-76. Not even five or 10 days had passed and Ninurta brought the jewels of rulership, the royal crown, the emblem and the royal throne bestowed on Agade, back into his E-šu-me-ša. Utu took away the eloquence of the city. Enki took away its wisdom. An took  {up} {(some mss. have instead:)  out} {(1 ms. has instead:)  away} into the midst of heaven its fearsomeness that reaches heaven. Enki tore out its well-anchored holy mooring pole from the abzu. Inana took away its weapons.", "properNames": ["Ninurta", "Agade", "E-šu-me-ša", "Utu", "Enki", "An", "Inana"], "missingText": []}, {"lineNumber": "2", "text": "77-82. The life of Agade's sanctuary was brought to an end as if it had been only the life of a tiny carp in the deep waters, and all the cities were watching it. Like a mighty elephant, it bent its neck to the ground while they all raised their horns like mighty bulls. Like a dying dragon, it dragged its head on the earth and they jointly deprived it of honour as in a battle.", "properNames": ["Agade's"], "missingText": []}, {"lineNumber": "2", "text": "83-93. Naram-Suen saw in a nocturnal vision that Enlil would not let the kingdom of Agade occupy a pleasant, lasting residence, that he would make its future altogether unfavourable, that he would make its temples shake and would  {scatter its treasures} {(1 ms. has instead:)  destroy its treasuries}. He realised what the dream was about, but did not put into words, and did not discuss it with anyone.  {(1 ms. adds 2 lines:)  …… temples shake ……, …… perform (?) extispicy regarding (?) his temple …….} Because of the E-kur, he put on mourning clothes,  {covered his chariot with a reed mat} {(1 ms. has instead:)  pulled out the outside pin of his chariot}, tore the reed canopy off  {his ceremonial barge} {(1 ms. has instead:)  the prow of his ceremonial barge} {(1 ms. has instead:)  the cabin of his ceremonial barge}, and gave away his royal paraphernalia. Naram-Suen persisted for seven years! Who has ever seen a king burying his head in his hands for seven years?  {(some mss. add the line:)  He realised what the dream was about, but did not put into words, and did not discuss it with anyone.}", "properNames": ["Naram-Suen", "Suen", "Enlil", "Agade", "E-kur"], "missingText": []}, {"lineNumber": "2", "text": "94-99. Then he went to perform extispicy on a kid regarding the temple, but the omen had nothing to say about the building of the temple. For a second time he went to perform extispicy on a kid regarding the temple, but the omen again had nothing to say about the building of the temple. In order to change what had been inflicted (?) upon him, he tried to to alter Enlil's pronouncement.", "properNames": ["Enlil's"], "missingText": []}, {"lineNumber": "2", "text": "100-119. Because his subjects were dispersed, he now began a mobilization of his troops. Like a wrestler who is about to enter the great courtyard, he …… his hands towards (?) the E-kur. Like an athlete bent to start a contest, he treated the giguna as if it were worth only thirty shekels. Like a robber plundering the city, he set tall ladders against the temple. To demolish E-kur as if it were a huge ship, to break up its soil like the soil of mountains where precious metals are mined, to splinter it like the lapis lazuli mountain, to prostrate it like a city inundated by Iškur -- alhough the temple was not the Mountains of Cedar-felling, he had large axes cast, he had double-edged agasilig axes sharpened to be used against it. He set spades against its roots and it sank as low as the foundation of the Land. He put axes against its top, and the temple, like a dead soldier, bowed its neck before him, and all the foreign lands bowed their necks before him.", "properNames": ["E-kur", "Iškur", "Mountains of Cedar-felling"], "missingText": []}, {"lineNumber": "2", "text": "120-148. He ripped out its drain pipes, and all the rain went back to the heavens. He tore off its upper lintel and  {the Land was deprived of its ornament} {(1 ms. has instead:)  the ornament of the Land disappeared}. From its Gate from which Grain is never Diverted, he diverted grain, and the Land was deprived of grain. He struck the Gate of Well-Being with the pickaxe, and well-being was subverted in all the foreign lands. As if they were for great tracts of land with wide carp-filled waters, he cast large  {spades} {(1 ms. has instead:)  axes} to be used against the E-kur. The people could see the bedchamber, its room which knows no daylight. The Akkadians could look into the holy treasure chest of the gods. Though they had committed no sacrilege, its laḫama deities of the great pilasters standing at the temple were thrown into the fire by Naram-Suen. The cedar, cypress, juniper and boxwood, the woods of its giguna, were …… by him. He put its gold in containers and put its silver in leather bags. He filled the docks with its copper, as if it were a huge transport of grain. The silversmiths were re-shaping its silver, jewellers were re-shaping its precious stones, smiths were beating its copper. Large ships were moored at the temple, large ships were moored at Enlil's temple and its possessions were taken away from the city, though they were not the goods of a plundered city. With the possessions being taken away from the city, good sense left Agade. As the ships  {moved away from} {(some mss. have instead:)  juddered} the docks, Agade's  {intelligence} {(1 ms. has instead:)  sanctuary} was removed.", "properNames": ["E-kur", "Akkadians", "Naram-Suen", "Suen", "Enlil's", "Agade", "Agade's"], "missingText": []}, {"lineNumber": "2", "text": "149-175. Enlil, the roaring storm that subjugates the entire land, the rising deluge that cannot be confronted, was considering what should be destroyed in return for the wrecking of his beloved E-kur. He lifted his gaze towards the Gubin mountains, and made all the inhabitants of the broad mountain ranges descend (?). Enlil brought out of the mountains those who do not resemble other people, who are not reckoned as part of the Land, the Gutians, an unbridled people, with human intelligence but canine  {instincts} {(some mss. have instead:)  feelings} and monkeys' features. Like small birds they swooped on the ground in great flocks. Because of Enlil, they stretched their arms out across the plain like a net for animals. Nothing escaped their clutches, no one left their grasp. Messengers no longer travelled the highways, the courier's boat no longer passed along the rivers. The Gutians drove the trusty (?) goats of Enlil out of their folds and compelled their herdsmen to follow them, they drove the cows out of their pens and compelled their cowherds to follow them. Prisoners manned the watch. Brigands  {occupied} {(1 ms. has instead:)  attacked} the highways. The doors of the city gates of the Land  {lay dislodged in} {(1 ms. has instead:)  were covered with} mud, and all the foreign lands uttered bitter cries from the walls of their cities. They  {established gardens for themselves} {(1 ms. has instead:)  made gardens grow} within the cities, and not as usual on the wide plain outside. As if it had been before the time when cities were built and founded, the large  {(some mss. add:)  fields and} arable tracts yielded no grain, the inundated  {(some mss. add:)  fields and} tracts yielded no fish, the irrigated orchards yielded no syrup or wine, the thick clouds (?) did not rain, the mašgurum plant did not grow.", "properNames": ["Enlil", "E-kur", "Gubin", "Gutians"], "missingText": []}, {"lineNumber": "2", "text": "176-192. In those days, oil for one shekel was only half a litre, grain for one shekel was only half a litre, wool for one shekel was only one mina, fish for one shekel filled only one ban measure -- these sold at such prices in the markets of the cities! Those who lay down on the roof, died on the roof; those who lay down in the house were not buried. People were flailing at themselves from hunger. By the Ki-ur, Enlil's great place, dogs were packed together in the silent streets; if two men walked there they would be devoured by them, and if three men walked there they would be devoured by them. Noses were punched (?), heads were smashed (?), noses (?) were piled up, heads were sown like seeds. Honest people were confounded with traitors, heroes lay dead on top of heroes, the blood of traitors ran upon the blood of honest men.", "properNames": ["Ki-ur", "Enlil's"], "missingText": []}, {"lineNumber": "2", "text": "193-209. At that time, Enlil rebuilt his great sanctuaries into small reed (?) sanctuaries and from east to west he reduced their storehouses. The old women who survived those days, the old men who survived those days and the chief lamentation singer who survived those years set up seven balaĝ drums, as if they stood at the horizon, and together with ub  {, meze, and lilis} {(some mss. have instead:) , šem, and lilis} {(1 ms. has instead:)  and bronze šem} drums made them resound to Enlil like Iškur for seven days and seven nights. The old women did not restrain the cry  \"Alas for my city!\". The old men did not restrain the cry  \"Alas for its people!\". The lamentation singer did not restrain the cry  \"Alas for the E-kur!\". Its young women did not restrain from tearing their hair. Its young men did not restrain from sharpening their knives. Their laments were as if Enlil's ancestors were performing a lament in the awe-inspiring Holy Mound by the holy knees of Enlil. Because of this, Enlil entered his holy bedchamber and lay down fasting.", "properNames": ["Enlil", "Iškur", "E-kur", "Enlil's"], "missingText": []}, {"lineNumber": "2", "text": "210-221. At that time, Suen, Enki, Inana, Ninurta, Iškur, Utu, Nuska, and Nisaba,  {the great gods} {(1 ms. has instead:)  all the gods whosoever},  {cooled} {(1 ms. has instead:)  sprinkled} Enlil's heart with cool water and prayed to him:  \"Enlil, may the city that destroyed your city be treated as your city has been treated! May the one that defiled your giguna be treated as Nibru! In this city, may heads fill the wells! May no one find his acquaintances there, may brother not recognise brother! May its young woman be cruelly killed in her woman's domain, may its old man cry in distress for his slain wife! May its pigeons moan on their window ledges, may its small birds be smitten in their nooks, may it live in constant anxiety like a timid pigeon!\"", "properNames": ["Suen", "Enki", "Inana", "Ninurta", "Iškur", "Utu", "Nuska", "Nisaba", "Enlil's", "Enlil", "Nibru"], "missingText": []}, {"lineNumber": "2", "text": "222-244. Again, Suen, Enki, Inana, Ninurta, Iškur, Utu, Nuska and Nisaba, all the gods whosoever, turned their attention to the city, and cursed Agade severely:  \"City, you pounced on E-kur: it is as if you had pounced on Enlil! Agade, you pounced on E-kur: it is as if you had pounced on Enlil! May your holy walls, to their highest point, resound with mourning! May your giguna be reduced to a pile of dust! May your pilasters with the standing lahama deities fall to the ground like tall young men drunk on wine! May your clay be returned to its abzu, may it be clay cursed by Enki! May your grain be returned to its furrow, may it be grain cursed by Ezina! May your timber be returned to its forest, may it be timber cursed by Ninilduma! May  {the} {(1 ms. has instead:)  your} cattle slaughterer slaughter his wife, may  {your} {(some mss. have instead:)  the} sheep butcher butcher his child! May water wash away your pauper as he is looking for ……! May your prostitute hang herself at the entrance to her brothel! May your pregnant (?) priestesses and cult prostitutes abort (?) their children! May your gold be bought for the price of silver, may your silver be bought for the price of pyrite (?), and may your copper be bought for the price of lead!\"", "properNames": ["Suen", "Enki", "Inana", "Ninurta", "Iškur", "Utu", "Nuska", "Nisaba", "Agade", "E-kur", "Enlil", "Ezina", "Ninilduma"], "missingText": []}, {"lineNumber": "2", "text": "245-255.  \"Agade, may your strong man be deprived of his strength, so that he will be unable to lift his sack of provisions and ……, and will not have the joy of controlling your superior asses; may he lie idle all day! May this make the city die of hunger! May your citizens, who used to eat fine food, lie hungry, may your …… man eat the coating on his roof, may he chew (?) the leather hinges on the main door of his father's house! May depression descend upon your  {palace, built for joy} {(1 ms. has instead:)  joyous palace}! May the evils of the desert, the silent place, howl continuously!\"", "properNames": ["Agade"], "missingText": []}, {"lineNumber": "2", "text": "256-271.  \"May foxes that frequent ruin mounds brush with their tails your uzga precinct, established for purification ceremonies! May the ukuku, the bird of depression, make its nest in your gateways, established for the Land! In your city that could not sleep because of the tigi drums, that could not rest from its joy, may the bulls of Nanna that fill the pens bellow like those who wander in the desert, the silent place! May the grass grow long on your canal-bank tow-paths, may the grass of mourning grow on your highways laid for waggons! Moreover, may …… wild rams (?) and alert snakes of the mountains allow no one to pass on your tow-paths built up with canal sediment! In your plains where fine grass grows, may the reed of lamentation grow!  {Agade, may brackish water flow} {(1 ms. has instead:)  May brackish water flow in the river,} where fresh water flowed for you! If someone decides,  \"I will dwell in this city!\", may he not enjoy the pleasures of a dwelling place! If someone decides,  \"I will rest in Agade!\", may he not enjoy the pleasures of a resting place!\"", "properNames": ["Nanna", "Agade"], "missingText": []}, {"lineNumber": "2", "text": "272-280. And before Utu on that very day, so it was! On its canal bank tow-paths, the grass grew long. On its highways laid for waggons, the grass of mourning grew. Moreover, on its tow-paths built up with canal sediment, …… wild rams (?) and alert snakes of the mountains allowed no one to pass. On its plains, where fine grass grew, now the reeds of lamentation grew. Agade's flowing fresh water flowed as brackish water. When someone decided,  \"I will dwell in that city!\", he could not enjoy the pleasures of a dwelling place. When someone decided,  \"I will rest in Agade!\", he could not enjoy the pleasures of a resting place!", "properNames": ["Utu", "Agade's", "Agade"], "missingText": []}, {"lineNumber": "2", "text": "281. Inana be praised for the destruction of Agade!", "properNames": ["Inana", "Agade"], "missingText": []}, {"lineNumber": "2", "text": "1-5. Enki took away its wisdom. An took up into the midst of heaven its fearsomeness that reaches heaven. Enki tore out its well-anchored holy mooring pole from the abzu. unknown no. of lines missing", "properNames": ["Enki", "An"], "missingText": ["unknown no. of lines missing"]}, {"lineNumber": "2", "text": "1-3. Naram-Suen saw in a nocturnal vision that he would make its future altogether unfavourable, that he would make its temples shake and would scatter its treasures! unknown no. of lines missing", "properNames": ["Naram-Suen", "Suen"], "missingText": ["unknown no. of lines missing"]}, {"lineNumber": "2", "text": "1. as if he were to change what had been inflicted (?) upon him.", "properNames": [], "missingText": []}, {"lineNumber": "2", "text": "2-14. His subjects were dispersed, so he began a mobilization of his troops. Like a wrestler who is about to enter the great courtyard, he …… his hands towards (?) the E-kur. Like an athlete bent to start a contest, he treated the giguna as if it were worth only thirty shekels. Like a robber plundering the city, he set tall ladders against the temple. Though the temple was not a mountain of cedars, he had large axes cast to be used against it.  {(1 ms. adds 1 line:)  He had double-edged agasilig axes sharpened to be used against it.} As if they were for great tracts of land with  {huge} {(1 ms. has instead:)  wide} carp-filled waters, he cast large  {spades} {(1 ms. has instead:)  …… to be used against the E-kur}. He put spades against its roots. unknown no. of lines missing", "properNames": ["E-kur"], "missingText": ["unknown no. of lines missing"]}, {"lineNumber": "2", "text": "1-3. and the Land was deprived of grain. He struck the Gate of Well-Being with the pickaxe and well-being was destroyed in all the foreign lands. unknown no. of lines missing", "properNames": [], "missingText": ["unknown no. of lines missing"]}, {"lineNumber": "2", "text": "1-4. 4 lines unclearunknown no. of lines missing", "properNames": [], "missingText": ["4 lines unclear", "unknown no. of lines missing"]}, {"lineNumber": "2", "text": "1-4. Noses were punched, heads were smashed (?), noses (?) were piled up, heads were sown like seeds. Heroes lay (?) dead on top of heroes, the blood of traitors ran (?) upon honest men.", "properNames": [], "missingText": []}, {"lineNumber": "2", "text": "5-7. Enlil rebuilt his great sanctuaries into small reed (?) sanctuaries and from the south to the uplands …….", "properNames": ["Enlil"], "missingText": []}], "transliterations": ["© Copyright 2003, 2004, 2005, 2006 The ETCSL project, Faculty of Oriental Studies, University of OxfordUpdated 2006-12-19 by JE"]}
{"id": "t.2.1.6", "title": "The victory of Utu-ḫeĝal", "paragraphs": [{"lineNumber": "2", "text": "1-12. Enlil, the king of all the lands, entrusted Utu-ḫeĝal, the mighty man, the king of Unug, the king of the four quarters, the king whose orders cannot be countermanded, with wiping out the name of Gutium, the fanged (?) snake of the mountains, who acted with violence against the gods, who carried off the kingship of Sumer to foreign lands, who filled Sumer with wickedness, who took away spouses from the married and took away children from parents, who made wickedness and violence normal in the Land.", "properNames": ["Enlil", "Utu-ḫeĝal", "Utu", "Unug", "Gutium", "Sumer"], "missingText": []}, {"lineNumber": "2", "text": "13-16. He went to his lady, Inana, and prayed to her:  \"My lady, lioness in the battle, who butts the foreign lands, Enlil has entrusted me with bringing back the kingship to Sumer. May you be my help!\"", "properNames": ["Inana", "Enlil", "Sumer"], "missingText": []}, {"lineNumber": "2", "text": "17-23. The enemy troops established themselves everywere. Tirigan, the king of Gutium …… the mouths of the channels (?). Nobody came out of his city to face him; he already occupied both banks of the Tigris. In the south, in Sumer, he blocked the water from the fields, in the uplands he closed off the roads. Because of him the grass grew high on the highways of the land.", "properNames": ["Tirigan", "Gutium", "Tigris", "Sumer"], "missingText": []}, {"lineNumber": "2", "text": "24-34. But the king, endowed with power by Enlil, chosen by Inana with her  {(1 ms. adds:)  holy} heart -- Utu-ḫeĝal, the mighty man, came out from Unug to face him and set up camp (?) at the temple of Iškur. He addressed a speech to the citizens of his city:  \"Enlil has given Gutium to me and my lady Inana will be my help! Dumuzid-ama-ušumgal-ana has declared  \"It is a matter for me!\" and assigned Gilgameš, the son of Ninsumun, to me as a constable!\" The citizens of Unug and Kulaba rejoiced and followed him with one accord. He lined up his élite troops.", "properNames": ["Enlil", "Inana", "Utu-ḫeĝal", "Utu", "Unug", "Iškur", "Gutium", "Dumuzid-ama-ušumgal-ana", "Gilgameš", "Ninsumun", "Kulaba"], "missingText": []}, {"lineNumber": "2", "text": "35-39. After departing from the temple of Iškur, on the fourth day he set up camp (?) in Naĝsu on the Surungal canal, and on the fifth day he set up camp (?) at the shrine at Ili-tappê. He captured Ur-Ninazu and Nabi-Enlil, generals of Tirigan sent as envoys to Sumer, and put them in handcuffs.", "properNames": ["Iškur", "Naĝsu", "Surungal", "Ili-tappê", "Ur-Ninazu", "Ninazu", "Nabi-Enlil", "Enlil", "Tirigan", "Sumer"], "missingText": []}, {"lineNumber": "2", "text": "40-50. After departing from the shrine at Ili-tappê, on the sixth day he set up camp (?) at Karkara. He went to Iškur and prayed to him:  \"O Iškur, Enlil has provided me with weapons, may you be my help!\" In the middle of that night, …… he departed (?) and above Adab he went to the rising (?) Utu and prayed to him:  \"O Utu, Enlil has given Gutium to me, may you be my help!\" He laid a trap (?) there behind the Gutian. Utu-ḫeĝal, the mighty man, defeated their generals.", "properNames": ["Ili-tappê", "Karkara", "Iškur", "Enlil", "Adab", "Utu", "Gutium", "Utu-ḫeĝal"], "missingText": []}, {"lineNumber": "2", "text": "51-62. Then Tirigan the king of Gutium ran away alone on foot. He thought himself safe in Dabrum, where he fled to save his life; but since the people of Dabrum knew that Utu-ḫeĝal was a king endowed with power by Enlil, they did not let Tirigan go, and an envoy of Utu-ḫeĝal arrested Tirigan together with his wife and children in Dabrum. He put handcuffs and a blindfold on him. Before Utu, Utu-ḫeĝal made him lie at his feet and placed his foot on his neck. He made Gutium, the fanged (?) snake of the mountains drink again from the crevices (?), he ……, he …… and he …… boat. He brought back the kingship of Sumer.", "properNames": ["Tirigan", "Gutium", "Dabrum", "Utu-ḫeĝal", "Utu", "Enlil", "Sumer"], "missingText": []}], "transliterations": ["© Copyright 2003, 2004, 2005, 2006 The ETCSL project, Faculty of Oriental Studies, University of OxfordUpdated 2006-12-19 by JE"]}
{"id": "t.2.1.7", "title": "The building of Ninĝirsu's temple (Gudea, cylinders A and B)", "paragraphs": [{"lineNumber": "2", "text": "1-4. On the day when in heaven and earth the fates had been decided, Lagaš raised its head high in full grandeur, and Enlil looked at Lord Ninĝirsu with approval. In our city there was perfection.", "properNames": ["Lagaš", "Enlil", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "5-9. The heart overflowed with joy, Enlil's heart, a river in flood, overflowed with joy. The heart overflowed with joy, and just as the Tigris brings sweet water, so Enlil, whose will is an enormous flood, sparkling and awe-inspiring, came to a sweet decision:", "properNames": ["Enlil's", "Tigris", "Enlil"], "missingText": []}, {"lineNumber": "2", "text": "10-16.  \"The lord called for his house and I intend to make the grandeur of E-ninnu known everywhere. Using his wisdom, the ruler (i.e. Gudea)  will achieve great things. He will direct faultless cattle and kids for offering. It is for him the fated brick is waiting. It is by him that the building of the holy house is to be done.\"", "properNames": ["E-ninnu", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "17-23. On that day, in a nocturnal vision Gudea saw his master, Lord Ninĝirsu. Ninĝirsu spoke to him of his house, of its building. He showed him an E-ninnu with full grandeur. Outstanding though his mind was, the message remained to be understood for him.", "properNames": ["Gudea", "Ninĝirsu", "E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "24-32.  \"Well, I have to tell her about this! Well, I have to tell her about this! I will ask her to stand by me in this matter. Profound things (?) came suddenly to me, the shepherd, but the meaning of what the nocturnal vision brought to me I do not understand. So I will take my dream to my mother and I will ask my dream-interpreter, an expert on her own, my divine sister from Sirara, Nanše, to reveal its meaning to me.\"", "properNames": ["Sirara", "Nanše"], "missingText": []}, {"lineNumber": "2", "text": "33-38. He stepped aboard his boat, directed it on the canal Id-Niĝin-dua towards her city Niĝin, and merrily cut through the waves of the river. After he had reached Bagara, the house extending as far as the river, he offered bread, poured cold water and went to the master of Bagara to pray to him.", "properNames": ["Id-Niĝin-dua", "Niĝin", "Bagara"], "missingText": []}, {"lineNumber": "2", "text": "39-51.  \"Warrior, rampant lion, who has no opponent! Ninĝirsu, important in the abzu, respected in Nibru! Warrior, I want to carry out faithfully what you have commanded me; Ninĝirsu, I want to build up your house for you, I want to make it perfect for you, so I will ask your sister, the child born of Eridug, an authority on her own, the lady, the dream-interpreter among the gods, my divine sister from Sirara, Nanše, to show me the way.\" His call was heard; his master, Lord Ninĝirsu, accepted from Gudea his prayer and supplication.", "properNames": ["Ninĝirsu", "Nibru", "Eridug", "Sirara", "Nanše", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "52-63. Gudea celebrated the ešeš festival in the house of Bagara. The ruler set up his bed near to Ĝatumdug. He offered bread and poured cold water and went to holy Ĝatumdug to pray to her:  \"My lady, child begotten by holy An, an authority on her own, proud goddess, living in the Land, …… of her city! Lady, mother, you who founded Lagaš, if you but look upon your people, it brings abundance; the worthy young man on whom you look will enjoy a long life.\"", "properNames": ["Gudea", "Bagara", "Ĝatumdug", "An", "Lagaš"], "missingText": []}, {"lineNumber": "2", "text": "64-67.  \"For me, who has no mother, you are my mother; for me, who has no father, you are my father. You implanted my semen in the womb, gave birth to me in the sanctuary, Ĝatumdug, sweet is your holy name!\"", "properNames": ["Ĝatumdug"], "missingText": []}, {"lineNumber": "2", "text": "68-79.  \"Tonight I shall lie down here (?). You are my great dagger (?), being attached to my side; you are a …… planted in great waters, providing me with life; you are a broad sunshade; let me cool off in your shade. May the favourable, right-hand palm of your lofty hands, my lady Ĝatumdug, lend me protection! I am going to the city, may my sign be favourable! May your friendly guardian go before me, and may your friendly protecting genius walk with me on the way towards Niĝin, the mountain rising from the water.\"", "properNames": ["Ĝatumdug", "Niĝin"], "missingText": []}, {"lineNumber": "2", "text": "80-89.  \"Well, I have to tell her about this! Well, I have to tell her about this! I will ask her to stand by me in this matter. I will take my dream to my mother and I will ask my dream-interpreter, an expert on her own, my divine sister from Sirara, Nanše, to reveal its meaning to me.\" His call was heard; his lady, holy Ĝatumdug, accepted from Gudea his prayer and supplication.", "properNames": ["Sirara", "Nanše", "Ĝatumdug", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "90-100. He stepped aboard his boat, directed it towards her city Niĝin, mooring it at the quay of Niĝin. The ruler raised his head high in the courtyard of the goddess from Sirara. He offered bread, poured cold water and went to Nanše to pray to her:  \"Nanše, mighty lady, lady of most precious (?) powers, lady who like Enlil determine fates, my Nanše, what you say is trustworthy and takes precedence. You are the interpreter of dreams among the gods, you are the lady of all the lands. Mother, my matter today is a dream:\"", "properNames": ["Niĝin", "Sirara", "Nanše", "Enlil"], "missingText": []}, {"lineNumber": "2", "text": "101-109.  \"In the dream there was someone who was as enormous as the heavens, who was as enormous as the earth. His head was like that of a god, his wings were like those of the Anzud bird, his lower body was like a flood storm. Lions were lying at his right and his left. He spoke to me about building his house, but I could not understand what he exactly meant, then daylight rose for me on the horizon.\"", "properNames": [], "missingText": []}, {"lineNumber": "2", "text": "110-114.  \"Then there was a woman -- whoever she was. She …… sheaves. She held a stylus of refined silver in her hand, and placed it on a tablet with propitious stars, and was consulting it.\"", "properNames": [], "missingText": []}, {"lineNumber": "2", "text": "115-123.  \"There was, furthermore, a warrior. His arm was bent, holding a lapis lazuli tablet in his hand, and he was setting down the plan of the house. The holy basket stood in front of me, the holy brick mould was ready and the fated brick was placed in the mould for me. In a fine ildag tree standing before me tigidlu birds were spending the day twittering. My master's right-side donkey stallion was pawing the ground for me.\"", "properNames": [], "missingText": []}, {"lineNumber": "2", "text": "124-131. His mother Nanše answered the ruler:  \"My shepherd, I will explain your dream for you in every detail. The person who, as you said, was as enormous as the heavens, who was as enormous as the earth, whose head was like that of a god, whose wings, as you said, were like those of the Anzud bird, and whose lower body was, as you said, like a flood storm, at whose right and left lions were lying, was in fact my brother Ninĝirsu. He spoke to you about the building of his shrine, the E-ninnu.\"", "properNames": ["Nanše", "Ninĝirsu", "E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "132-133.  \"The daylight that had risen for you on the horizon is your personal god Ninĝišzida, who will rise for you as the daylight on the horizon.\"", "properNames": ["Ninĝišzida"], "missingText": []}, {"lineNumber": "2", "text": "134-140.  \"The young woman …… sheaves, who held a stylus of refined silver in her hand, who had placed it on a tablet with propitious stars and was consulting it, was in fact my sister Nisaba. She announced to you the holy stars auguring the building of the house.\"", "properNames": ["Nisaba"], "missingText": []}, {"lineNumber": "2", "text": "141-143.  \"The second one, who was a warrior and whose arm was bent, holding a lapis lazuli tablet in his hand, was Nindub, putting the plan of the house on the tablet.\"", "properNames": ["Nindub"], "missingText": []}, {"lineNumber": "2", "text": "144-146.  \"As regards the holy basket standing in front of you, the holy brick mould which was ready and the fated brick placed in the mould, this part of the dream concerns the good brick of the E-ninnu.\"", "properNames": ["E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "147-149.  \"As regards the fine ildag tree standing before you, in which, as you said, tigidlu birds were spending the day twittering, this means that the building of the house will not let sweet sleep come into your eyes.\"", "properNames": [], "missingText": []}, {"lineNumber": "2", "text": "150-151.  \"As regards that part when the right-side donkey stallion of your master, as you said, pawed the ground for you; this refers to you, who will paw the ground for the E-ninnu like a choice steed.\"", "properNames": ["E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "152-172.  \"Let me advise you and may my advice be taken. Direct your steps to Ĝirsu, the foremost house of the land of Lagaš, open your storehouse up and take out wood from it; build (?) a chariot for your master and harness a donkey stallion to it; decorate this chariot with refined silver and lapis lazuli and equip it with arrows that will fly out from the quiver like sunbeams, and with the an-kar weapon, the strength of heroism; fashion for him his beloved standard and write your name on it, and then enter before the warrior who loves gifts, before your master Lord Ninĝirsu in E-ninnu-the-white-Anzud-bird, together with his beloved balaĝ drum Ušumgal-kalama, his famous instrument to which he keeps listening. Your requests will then be taken as if they were commands; and the drum will make the inclination of the lord -- which is as inconceivable as the heavens -- will make the inclination of Ninĝirsu, the son of Enlil, favourable for you so that he will reveal the design of his house to you in every detail. With his powers, which are the greatest, the warrior will make the house thrive (?) for you.\"", "properNames": ["Ĝirsu", "Lagaš", "Ninĝirsu", "E-ninnu-the-white-Anzud-bird", "Ušumgal-kalama", "Enlil"], "missingText": []}, {"lineNumber": "2", "text": "173-195. The true shepherd Gudea is wise, and able too to realise things. Accepting what Nanše had told him, he opened his storehouse up and took out wood from it. Gudea checked (?) the wood piece by piece, taking great care of the wood. He smoothed meš wood, split ḫalub wood with an axe and built (?) a blue chariot from them for him. He harnessed to it the stallion Piriĝ-kaše-pada. He fashioned for him his beloved standard, wrote his name on it, and then entered before the warrior who loves gifts, before his master Lord Ninĝirsu in E-ninnu-the-white-Anzud-bird, together with his beloved balaĝ drum Ušumgal-kalama, his famous instrument to which he keeps listening. He joyfully brought the drum to him in the temple. Gudea came out of the shrine E-ninnu with a radiant face.", "properNames": ["Gudea", "Nanše", "Ninĝirsu", "E-ninnu-the-white-Anzud-bird", "Ušumgal-kalama", "E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "196-206. Thereafter the house was the concern of all the days and all the nights that he made pass by. He levelled what was high, rejected chance utterances (?), he removed the sorcerers' spittle (?) from the roads. Facing Šu-galam, the fearful place, the place of making judgments, from where Ninĝirsu keeps an eye on all lands, the ruler had a fattened sheep, a fat-tail sheep, and a grain-fed kid rest on hides of a virgin kid. He put juniper, the mountains' pure plant, onto the fire, and raised smoke with cedar resin, the scent of gods.", "properNames": ["Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "207-216. He rose to his master in public and prayed to him; he went to him in the Ubšu-unkena and saluted him:  \"My master Ninĝirsu, lord who has turned back the fierce waters, true lord, semen ejaculated by the Great Mountain, noble young hero who has no opponent! Ninĝirsu, I am going to build up your house for you, but I lack an ominous sign. Warrior, you asked for perfection, but, son of Enlil, Lord Ninĝirsu, you did not let me know your will as to how to achieve it.\"", "properNames": ["Ubšu-unkena", "Ninĝirsu", "Enlil"], "missingText": []}, {"lineNumber": "2", "text": "217-225.  \"Your will, ever-rising as the sea, crashing down as a destructive flood, roaring like gushing waters, destroying cities (?) like a flood-wave, battering against the rebel lands like a storm; my master, your will, gushing water that no one can stem; warrior, your will inconceivable as the heavens -- can I learn anything about it from you, son of Enlil, Lord Ninĝirsu?\"", "properNames": ["Enlil", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "226-231. Afterwards, Ninĝirsu stepped up to the head of the sleeper, briefly touching him:  \"You who are going to build it for me, you who are going to build it for me, ruler, you who are going to build my house for me, Gudea, let me tell you the ominous sign for building my house, let me tell you the pure stars of heaven indicating my regulations (?).\"", "properNames": ["Ninĝirsu", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "232-240.  \"As if at the roaring of the Anzud bird, the heavens tremble at my house, the E-ninnu founded by An, the powers of which are the greatest, surpassing all other powers, at the house whose owner looks out over a great distance. Its fierce halo reaches up to heaven, the great fearsomeness of my house settles upon all the lands. In response to its fame all lands will gather from as far as heaven's borders, even Magan and Meluḫa will come down from their mountains.\"", "properNames": ["E-ninnu", "An", "Magan", "Meluḫa"], "missingText": []}, {"lineNumber": "2", "text": "241-247.  \"I am Ninĝirsu who has turned back the fierce waters, the great warrior of Enlil's realm, a lord without opponent. My house the E-ninnu, a crown, is bigger than the mountains; my weapon the Šar-ur subdues all the lands. No country can bear my fierce stare, nobody escapes my outstretched arms.\"", "properNames": ["Ninĝirsu", "Enlil's", "E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "248-253.  \"Because of his great love, my father who begot me called me \"King, Enlil's flood, whose fierce stare is never lifted from the mountains, Ninĝirsu, warrior of Enlil\", and endowed me with fifty powers.\"", "properNames": ["Enlil's", "Ninĝirsu", "Enlil"], "missingText": []}, {"lineNumber": "2", "text": "254-261.  \"I lay the ritual table and perform correctly the hand-washing rites. My outstretched hands wake holy An from sleep. My father who begot me receives the very best food from my hands. An, king of the gods, called me therefore \"Ninĝirsu, king, lustration priest of An\".\"", "properNames": ["An", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "262-265.  \"I founded the Tiraš shrine with as much majesty as the abzu. Each month at the new moon the great rites (?), my \"Festival of An\", are performed for me perfectly in it.\"", "properNames": ["Tiraš", "An"], "missingText": []}, {"lineNumber": "2", "text": "266-270.  \"Like a fierce snake, I built E-ḫuš, my fierce place, in a dread location. When my heart gets angry at a land that rebels against me -- unutterable idea (?) -- it will produce venom for me like a snake that dribbles poison.\"", "properNames": ["E-ḫuš"], "missingText": []}, {"lineNumber": "2", "text": "271-276.  \"In the E-babbar, where I issue orders, where I shine like Utu, there I justly decide the lawsuits of my city like Ištaran. In the E-bagara, my dining place, the great gods of Lagaš gather around me.\"", "properNames": ["E-babbar", "Utu", "Ištaran", "E-bagara", "Lagaš"], "missingText": []}, {"lineNumber": "2", "text": "277-285.  \"When you, true shepherd Gudea, really set to work for me on my house, the foremost house of all lands, the right arm of Lagaš, the Anzud bird roaring on the horizon, the E-ninnu, my royal house, I will call up to heaven for humid winds so that plenty comes down to you from heaven and the land will thrive under your reign in abundance.\"", "properNames": ["Gudea", "Lagaš", "E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "286-293.  \"Laying the foundations of my temple will bring immediate abundance: the great fields will grow rich for you, the levees and ditches will be full to the brim for you, the water will rise for you to heights never reached by the water before. Under you more oil than ever will be poured and more wool than ever will weighed in Sumer.\"", "properNames": ["Sumer"], "missingText": []}, {"lineNumber": "2", "text": "294-305.  \"When you drive in my foundation pegs for me, when you really set to work for me on my house, I shall direct my steps to the mountains where the north wind dwells and make the man with enormous wings, the north wind, bring you wind from the mountains, the pure place, so that this will give vigour to the Land, and thus one man will be able to do as much work as two. At night the moonlight, at noon the sun will send plentiful light for you so the day will build the house for you and the night will make it rise for you.\"", "properNames": [], "missingText": []}, {"lineNumber": "2", "text": "306-314.  \"I will bring ḫalub and neḫan trees up from the south, and cedar, cypress and zabalumwood together will be brought for you from the uplands. From the ebony mountains I will have ebony trees brought for you, in the mountains of stones I will have the great stones of the mountain ranges cut in slabs for you. On that day I will touch your arm with fire and you will know my sign.\"", "properNames": [], "missingText": []}, {"lineNumber": "2", "text": "315-322. Gudea rose -- it was sleep; he shuddered -- it was a dream. Accepting Ninĝirsu's words, he went to perform extispicy on a white kid. He performed it on the kid and his omen was favourable. Ninĝirsu's intention became as clear as daylight to Gudea.", "properNames": ["Gudea", "Ninĝirsu's"], "missingText": []}, {"lineNumber": "2", "text": "323-329. He is wise, and able too to realise things. The ruler gave instructions to his city as to one man. The land of Lagaš became of one accord for him, like children of one mother. He opened manacles, removed fetters; established ……, rejected legal complaints, and locked up (?) those guilty of capital offences (instead of executing them).", "properNames": ["Lagaš"], "missingText": []}, {"lineNumber": "2", "text": "330-344. He undid the tongue of the goad and the whip, replacing them with wool from lamb-bearing sheep. No mother shouted at her child. No child answered its mother back. No slave who …… was hit on the head by his master, no misbehaving slave girl was slapped on the face by her mistress. Nobody could make the ruler building the E-ninnu, Gudea, let fall a chance utterance. The ruler cleansed the city, he let purifying fire loose over it. He expelled the persons ritually unclean, unpleasant to look at, and …… from the city.", "properNames": ["E-ninnu", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "345-352. In respect of the …… of the brick-mould he had a kid lie down, and he requested from the kid an omen about the brick. He looked at the excavated earth (?) approvingly, and the shepherd, called by his name by Nanše, …… it with majesty. After making a drawing on the …… of the brick mould and …… the excavated earth with majesty, he made the Anzud bird, the standard of his master, glisten there as a banner.", "properNames": ["Nanše"], "missingText": []}, {"lineNumber": "2", "text": "353-364. The citizens were purifying an area of 24 iku for him, they were cleansing that area for him. He put juniper, the mountains' pure plant, onto the fire and raised smoke with cedar resin, the scent of gods. For him the day was for praying, and the night passed for him in supplications. In order to build the house of Ninĝirsu, the Anuna gods of the land of Lagaš stood by Gudea in prayer and supplication, and all this made the true shepherd Gudea extremely happy.", "properNames": ["Ninĝirsu", "Anuna", "Lagaš", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "365-371. Now the ruler imposed a levy on his Land. He imposed a levy on his realm of abundant ……, on Ninĝirsu's Gu-edina. He imposed a levy on his built-up cities and settlements, on Nanše's Gu-ĝišbara.", "properNames": ["Ninĝirsu's", "Gu-edina", "Nanše's", "Gu-ĝišbara"], "missingText": []}, {"lineNumber": "2", "text": "372-376. There was a levy for him on the clans of Ninĝirsu \"Rampant fierce bull which has no opponent\" and \"White cedars surrounding their master\", and he placed Lugal-kur-dub, their magnificent standard, in front of them.", "properNames": ["Ninĝirsu", "Lugal-kur-dub"], "missingText": []}, {"lineNumber": "2", "text": "377-381. There was a levy for him on the clan of Nanše \"Both river banks and shores rising out of the waters, the huge river, full of water, which spreads its abundance everywhere\", and he placed the holy pelican (?), the standard of Nanše, in front of them.", "properNames": ["Nanše"], "missingText": []}, {"lineNumber": "2", "text": "382-385. There was a levy for him on the clans of Inana \"The net suspended for catching the beasts of the steppe\" and \"Choice steeds, famous team, the team beloved by Utu\", and he placed the rosette, the standard of Inana, in front of them.", "properNames": ["Inana", "Utu"], "missingText": []}, {"lineNumber": "2", "text": "386-391. In order to build the house of Ninĝirsu, 3 lines missing2 lines fragmentary", "properNames": ["Ninĝirsu"], "missingText": ["3 lines missing", "2 lines fragmentary"]}, {"lineNumber": "2", "text": "392-396. The Elamites came to him from Elam, the Susians came to him from Susa. Magan and Meluḫa loaded wood from their mountains upon their shoulders for him, and to build the house of Ninĝirsu, they gathered for Gudea at his city Ĝirsu.", "properNames": ["Elamites", "Elam", "Susians", "Susa", "Magan", "Meluḫa", "Ninĝirsu", "Gudea", "Ĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "397-404. Ninzaga was commanded and he made his copper, as much as if it were a huge grain transport, reach Gudea, the man in charge of building the house. Ninsikila was also instructed and she made large ḫalub logs, ebony, and aba wood reach the ruler building the E-ninnu.", "properNames": ["Ninzaga", "Gudea", "Ninsikila", "E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "405-411. Lord Ninĝirsu directed Gudea into the impenetrable mountain of cedars and he cut down its cedars with great axes and carved the Šar-ur, the right arm of Lagaš, his master's flood-storm weapon, out of it.", "properNames": ["Ninĝirsu", "Gudea", "Lagaš"], "missingText": []}, {"lineNumber": "2", "text": "412-423. It was like a giant serpent floating on the water as, for Lord Ninĝirsu, Gudea had the long rafts floating downstream moor at the main quay of Kan-sura: logs of cedar wood from the cedar hills, logs of cypress wood from the cypress hills, logs of zabalum wood from the zabalum hills, tall spruce trees, plane trees, and eranum trees.", "properNames": ["Ninĝirsu", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "424-433. Lord Ninĝirsu directed Gudea into the impenetrable mountains of stones and he brought back great stones in the form of slabs. For Lord Ninĝirsu, Gudea had ships with ḫauna dock there, and ships with gravel, with dried bitumen, …… bitumen, and gypsum from the hills of Madga, cargoes like boats bringing grain from the fields.", "properNames": ["Ninĝirsu", "Gudea", "Madga"], "missingText": []}, {"lineNumber": "2", "text": "434-445. Great things came to the succour of the ruler building the E-ninnu: a copper mountain in Kimaš revealed itself to him. He mined its copper onto rafts. To the man in charge of building his master's house, the ruler, gold was brought in dust form from its mountains. For Gudea refined silver was brought down from its mountains. Translucent cornelian from Meluḫa was spread before him. From the alabaster mountains alabaster was brought down to him.", "properNames": ["E-ninnu", "Kimaš", "Gudea", "Meluḫa"], "missingText": []}, {"lineNumber": "2", "text": "446-451. The shepherd was going to build the house with silver, so he sat together with silversmiths. He was going to build the E-ninnu with precious stone, so he sat with jewellers. He was going to build it with copper and tin, so the mother-goddess of the Land directed before him the chief of the smiths.", "properNames": ["E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "452-456. The heavy hammer-stones roared for him like a storm. The dolerite, the light hammer-stones, …… two …… three. …… like a huge mass of water gushing forth, 1 line fragmentary 1 line missing", "properNames": [], "missingText": ["1 line fragmentary", "1 line missing"]}, {"lineNumber": "2", "text": "458-462. He …… the days (?). Gudea prolonged the nights (?) for Ninĝirsu. Because of building the house for his master, he neither slept at night, nor did he rest his head during the siesta.", "properNames": ["Gudea", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "463-470. For the one looked on with favour by Nanše, for the favourite of Enlil, for the ruler …… by Ninĝirsu, for Gudea, born in the august sanctuary by Ĝatumdug, Nisaba opened the house of understanding and Enki put right the design of the house.", "properNames": ["Nanše", "Enlil", "Ninĝirsu", "Gudea", "Ĝatumdug", "Nisaba", "Enki"], "missingText": []}, {"lineNumber": "2", "text": "471-481. Towards the house whose halo reaches to heaven, whose powers embrace heaven and earth, whose owner is a lord with a fierce stare, whose warrior Ninĝirsu is expert at battle, towards E-ninnu-the-white-Anzud-bird, Gudea went from the south and admired it northwards. From the north he went towards it and admired it southwards. He measured out with rope exactly one iku. He drove in pegs at its sides and personally verified them. This made him extremely happy.", "properNames": ["Ninĝirsu", "E-ninnu-the-white-Anzud-bird", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "482-491. When the night fell, he went to the old temple to pray, so that the inclination of the one from the dais of Ĝir-nun (i.e. Ninĝirsu)  would become favourable for Gudea. When day broke, he took a bath and arranged his outfit correctly. Utu let abundance come forth for him. Gudea left Iri-kug a second time; he sacrificed a perfect bull and a perfect kid. He went to the house and saluted it.", "properNames": ["Ninĝirsu", "Gudea", "Utu", "Iri-kug"], "missingText": []}, {"lineNumber": "2", "text": "492-498. He …… the holy basket and true fated brick mould …… the E-ninnu. As he …… and walked proudly, Lugal-kur-dub walked in front of him, Ig-alim directed him and Ninĝišzida, his personal god, held him by the hand throughout the time.", "properNames": ["E-ninnu", "Lugal-kur-dub", "Ig-alim", "Ninĝišzida"], "missingText": []}, {"lineNumber": "2", "text": "499-512. He poured clear water into the …… of the brick mould -- adab, sim and ala drums were playing for the ruler. He prepared the excavated earth for making (?) the brick, and hoed honey, ghee and precious oil into it. He worked balsam (?) and essences from all kinds of trees into the paste. He lifted up the holy carrying-basket and put it next to the brick mould. Gudea placed the clay into the brick mould and acted exactly as prescribed, bringing the first brick of the house into existence in it, while all the bystanders sprinkled oil or cedar perfume. His city and the land of Lagaš spent the day with him in joy.", "properNames": ["Gudea", "Lagaš"], "missingText": []}, {"lineNumber": "2", "text": "513-522. He shook the brick mould and left the brick to dry. He looked at the …… with satisfaction. He anointed it with cypress essence and balsam (?). Utu rejoiced over the brick put into the mould by Gudea, and King Enki …… the …… rising like a great river. …… and Gudea went into the house.", "properNames": ["Utu", "Gudea", "Enki"], "missingText": []}, {"lineNumber": "2", "text": "523-542. He raised the brick out of the …… of the mould, and it looked as a holy crown worn by An. He lifted up the brick and went around among his people: it was like Utu's holy team tossing (?) their heads. The brick lifting its head toward the house was as if Nanna's cows were eager to be tethered in their pen. He put down the brick, entered the house and as if he himself were Nisaba knowing the inmost secrets (?) of numbers, he started setting down (?) the ground plan of the house. As if he were a young man building a house for the first time, sweet sleep never came into his eyes. Like a cow keeping an eye on its calf, he went in constant worry to the house. Like a man who takes but little food into his mouth, he went around untiringly. The intention of his master had become clear for him, the words of Ninĝirsu had become as conspicuous as a banner to Gudea. In (?) his heart beating loudly because of building the house, someone …… a propitious ominous remark. This made him extremely happy.", "properNames": ["An", "Utu's", "Nanna's", "Nisaba", "Ninĝirsu", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "543-550. He performed extispicy on a kid and his omen was favourable. He cast grain on to …… and its appearance was right. Gudea lay down for a dream oracle, and while he was sleeping a message came to him: in the vision he saw his master's house already built, the E-ninnu separating heaven and earth. This made him extremely happy.", "properNames": ["Gudea", "E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "551-561. He stretched out lines in the most perfect way; he set up (?) a sanctuary in the holy uzga. In the house, Enki drove in the foundation pegs, while Nanše, the daughter of Eridug, took care of the oracular messages. The mother of Lagaš, holy Ĝatumdug, gave birth to its bricks amid cries (?), and Bau, the lady, first-born daughter of An, sprinkled them with oil and cedar essence. En and lagar priests were detailed to the house to provide maintenance for it. The Anuna gods stood there full of admiration.", "properNames": ["Enki", "Nanše", "Eridug", "Lagaš", "Ĝatumdug", "Bau", "An", "Anuna"], "missingText": []}, {"lineNumber": "2", "text": "562-577. Gudea, in charge of building the house, placed on his head the carrying-basket for the house, as if it were a holy crown. He laid the foundation, set the walls on the ground. He marked out a square, aligned the bricks with a string. He marked out a second square on the site of the temple, saying,  \"It is the line-mark for a topped-off jar of 1 ban capacity (?).\" He marked out a third square on the site of the temple, saying,  \"It is the Anzud bird enveloping its fledgling with its wings.\" He marked out a fourth square on the site of the temple, saying,  \"It is a panther embracing a fierce lion.\" He marked out a fifth square on the site of the temple, saying,  \"It is the blue sky in all its splendour.\" He marked out a sixth square on the site of the temple, saying,  \"It is the day of supply, full of luxuriance.\" He marked out a seventh square on the site of the temple, saying,  \"It is the E-ninnu bathing the Land with moonlight at dawn.\"", "properNames": ["Gudea", "E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "578-590. They inserted the wooden door frames, which were like a crown worn in the blue sky. As Gudea sat down at a wooden door frame, from there it was like a huge house embracing heaven. As he built the house and laid wooden scaffolding against it, it was like Nanna's lagoon attended by Enki. They made the house grow as high as the hills, they mad it float in the midst of heaven as a cloud, they made it lift its horns as a bull and they made it raise its head above all the lands, like the ĝišgana tree over the abzu. As the house had been made to lift its head so high as to fill the space between heaven and earth like the hills, it was like a luxuriant cedar growing among high grass (?); E-ninnu was decorated most alluringly among Sumer's buildings.", "properNames": ["Gudea", "Nanna's", "Enki", "E-ninnu", "Sumer's"], "missingText": []}, {"lineNumber": "2", "text": "591-601. As they placed wooden beams on the house, they looked like dragons of the abzu coming out all together, they were like …… of heaven ……, they were like huge serpents of the foothills ……. The reeds cut for the house were like mountain snakes sleeping together. Its upper parts were covered with luxuriant cedar and cypress, and they put white cedars in its inner room of cedar, marvellous to behold. They treated them with good perfume and precious oil. The mud-wall of the house was covered with the abundance (?) of the abzu and they tied its …… to it. The shrine of E-ninnu was thus placed in the …… hand of An.", "properNames": ["E-ninnu", "An"], "missingText": []}, {"lineNumber": "2", "text": "602-616. The ruler built the house, he made it high, high as a great mountain. Its abzu foundation pegs, big mooring stakes, he drove into the ground so deep they could take counsel with Enki in the E-engura. He had heavenly foundation pegs surround the house like warriors, so that each one was drinking water at the libation place of the gods. He fixed the E-ninnu, the mooring stake, he drove in its pegs shaped like praying wizards. He planted the pleasant poplars of his city so that they cast their shadow. He embedded its Šar-ur weapon beside Lagaš like a big standard, placed it in its dreadful place, the Šu-galam, and made it emanate fearsome radiance. On the dais of Ĝir-nun, on the place of making judgments, the provider of Lagaš lifted his horns like a mighty bull.", "properNames": ["Enki", "E-engura", "E-ninnu", "Lagaš"], "missingText": []}, {"lineNumber": "2", "text": "617-624. It took one year to bring the great stones in slabs and it took another year to fashion them, although not even two or three days did he let pass idly. Then it needed a day's work to set up each one but by the seventh day he had set them all up around the house. He laid down the trimmings from the slabs as stairs, or fashioned basins from them, and had them stand in the house.", "properNames": [], "missingText": []}, {"lineNumber": "2", "text": "625-629. The stela which he set up in the great courtyard he named as \"The king who …… the courtyard, Lord Ninĝirsu, has recognised Gudea from the Ĝir-nun\".", "properNames": ["Ninĝirsu", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "630-635. The stela which he set up at the Kan-sura gate he named as \"The king, Enlil's flood storm, who has no opponent, Lord Ninĝirsu, has looked with favour at Gudea\".", "properNames": ["Enlil's", "Ninĝirsu", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "636-641. The stela which he set up facing the rising sun he named as \"The king, the roaring storm of Enlil, the lord without rival, Lord Ninĝirsu, has chosen Gudea with his holy heart\".", "properNames": ["Enlil", "Ninĝirsu", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "642-646. The stela which he set up facing Šu-galam he named as \"The king, at whose name the foreign countries tremble, Lord Ninĝirsu, has made Gudea's throne firm\".", "properNames": ["Ninĝirsu", "Gudea's"], "missingText": []}, {"lineNumber": "2", "text": "647-650. The stela which he set up facing E-uru-ga he named as \"Lord Ninĝirsu has decided a good fate for Gudea\".", "properNames": ["E-uru-ga", "Ninĝirsu", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "651-654. The stela which he set up by the inner room (?) of Bau he named as \"The eyes of An know the E-ninnu, and Bau is the life source of Gudea\".", "properNames": ["Bau", "An", "E-ninnu", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "655-664. He built his master's house exactly as he had been told to. The true shepherd Gudea made it grow so high as to fill the space between heaven and earth, had it wear a tiara shaped like the new moon, and had its fame spread as far as the heart of the highlands. Gudea made Ninĝirsu's house come out like the sun from the clouds, had it grow to be like hills of lapis lazuli and had it stand to be marvelled at like hills of white alabaster.", "properNames": ["Gudea", "Ninĝirsu's"], "missingText": []}, {"lineNumber": "2", "text": "665-672. He made its door-sockets stand like wild bulls and he flanked them with dragons crouching on their paws like lions. He had its terraced tower (?) grow on a place as pure as the abzu. He made the metal tops of its standards twinkle as the horns of the holy stags of the abzu. Gudea made the house of Ninĝirsu stand to be marvelled at like the new moon in the skies.", "properNames": ["Gudea", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "673-687. The built-in door-sockets of the house are laḫama deities standing by the abzu. Its timber store (?) looks like waves (?) of an enormous lagoon where snakes have dived (?) into the water. Its …… is …… full of fearsomeness. Its …… is a light floating in the midst of heaven. On the Gate where the King Enters an eagle is raising its eyes toward a wild bull. Its curved wooden posts joining above the gate are a rainbow stretching over the sky. Its upper lintel of the gate like (?) the E-ninnu stands among rumbling, roaring storms. Its awe-inspiring eyebrow-shaped arch (?) meets the admiring eyes of the gods. His white dais …… of the house is a firmly founded lapis lazuli mountain connecting heaven and earth.", "properNames": ["E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "688-695. They installed the great dining hall for the evening meals: it was as if An himself were setting out golden bowls filled with honey and wine. They built the bedchamber: it is the abzu's fruit-bearing holy meš tree among innumerable mountains. He finished with the building, which made the hearts of the gods overflow with joy.", "properNames": ["An"], "missingText": []}, {"lineNumber": "2", "text": "696-721. The true shepherd Gudea is wise, and able too to realise things. In the inner room (?) where the weapons hang, at the Gate of Battle he had the warriors Six-headed wild ram and …… head take their stand. Facing the city, its place laden with awe, he had the Seven-headed serpent take its stand. In Šu-galam, its awesome gate, he had the Dragon and the Date palm take their stand. Facing the sunrise, where the fates are decided, he erected the standard of Utu, the Bison head, beside others already there. At the Kan-sura gate, at its lookout post, he had the Lion, the terror of the gods, take its stand. In the Tar-sirsir, where the orders are issued, he had the Fish-man and the Copper take their stand. In Bau's inner room (?), where the heart can be soothed, he had the Magilum boat and the Bison take their stand. Because these were warriors slain by Ninĝirsu, he set their mouths towards libation places. Gudea, the ruler of Lagaš, made their names appear among those of the gods.", "properNames": ["Gudea", "Utu", "Tar-sirsir", "Bau's", "Ninĝirsu", "Lagaš"], "missingText": []}, {"lineNumber": "2", "text": "722-729. The cedar doors installed in the house are Iškur roaring above. The locks of the E-ninnu are bisons, its door-pivots are lions, from its bolts horned vipers and fierce snakes are hissing at wild bulls. Its jambs, against which the door leaves close, are young lions and panthers lying on their paws.", "properNames": ["Iškur", "E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "730-737. The shining roof-beam nails hammered into the house are dragons gripping a victim. The shining ropes attached to the doors are holy Niraḫ parting the abzu. Its …… is pure like Keš and Aratta, its …… is a fierce lion keeping an eye on the Land; nobody going alone can pass in front of it.", "properNames": ["Niraḫ", "Keš", "Aratta"], "missingText": []}, {"lineNumber": "2", "text": "738-758. The fearsomeness of the E-ninnu covers all the lands like a garment. The house! It is founded by An on refined silver, it is painted with kohl, and comes out as the moonlight with heavenly splendour. The house! Its front is a great mountain firmly grounded, its inside resounds with incantations and harmonious hymns, its exterior is the sky, a great house rising in abundance, its outer assembly hall is the Anuna gods' place of rendering judgments, from its …… words of prayer can be heard, its food supply is the abundance of the gods, its standards erected around the house are the Anzud bird spreading its wings over the bright mountain. E-ninnu's clay plaster, harmoniously blended clay taken from the Edin canal, has been chosen by its master Lord Ninĝirsu with his holy heart, and was painted by Gudea with the splendours of heaven as if kohl were being poured all over it.", "properNames": ["E-ninnu", "An", "Anuna", "E-ninnu's", "Edin", "Ninĝirsu", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "759-769. From its cow-pen butter and milk are brought in. From its huge oven, great cakes and croissants come. Its …… feeds cattle and sheep. Its house of food rations …… an uzga shrine. Its wine-cellar (?) is a mountain oozing wine, from its brewery as much beer comes as the Tigris at high water.", "properNames": ["Tigris"], "missingText": []}, {"lineNumber": "2", "text": "770-780. Its storehouse is full of gems, silver and tin. Its coach-house is a mountain set on the ground. Its drum hall is a roaring bull. Its courtyard resounds with holy prayers, sim and ala drums. Its stone stairs, laid before the house, are like a mountain range lying down in princely joy. Its upper stairs leading (?) to the roof are like a light clearly visible as far as the mountains. Its vineyard \"Black garden in the steppe\", planted near the house, is a mountain oozing wine and grows in a place with fearsomeness and radiance.", "properNames": [], "missingText": []}, {"lineNumber": "2", "text": "781-798. The seven stones surrounding the house are there to take counsel with its owner. Its chapel for funerary offerings is as pure as the clean abzu. The stone basins set up in the house are like the holy room of the lustration priest where water never ceases to flow. Its high battlements where pigeons live is …… Eridug ……. E-ninnu offers rest to pigeons, it is a protective cover with large branches and a pleasant shade, with swallows and other birds chirping loudly there. It is Enlil's E-kur when a festival takes place in it. The house's great awesomeness settles upon the whole Land, its praise reaches to the highlands, the awesomeness of the E-ninnu covers all lands like a garment.", "properNames": ["Eridug", "E-ninnu", "Enlil's", "E-kur"], "missingText": []}, {"lineNumber": "2", "text": "799-803. The house has been built most sumptuously by its lord. It was built on a pedestal by Ninĝišzida. Its foundation pegs were driven in by Gudea, the ruler of Lagaš.", "properNames": ["Ninĝišzida", "Gudea", "Lagaš"], "missingText": []}, {"lineNumber": "2", "text": "804-812. For the restoration of E-ninnu, the house that rises like the sun over the Land, stands like a great bull in the …… sand, illuminates the assembly like delightful moonlight, is as sumptuous as lush green foothills, and stands to be marvelled at, praise be to Ninĝirsu!", "properNames": ["E-ninnu", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "813-814. This is the middle of the hymn \"The building of Ninĝirsu's house\".", "properNames": ["Ninĝirsu's"], "missingText": []}, {"lineNumber": "2", "text": "815-819. House, mooring post of the Land, grown so high as to fill the space between heaven and earth, E-ninnu, the true brickwork, for which Enlil determined a good fate, green hill standing to be marvelled at, standing out above all the lands!", "properNames": ["E-ninnu", "Enlil"], "missingText": []}, {"lineNumber": "2", "text": "820-823. The house is a great mountain reaching up to the skies. It is Utu filling the midst of the heavens; E-ninnu is the white Anzud bird spreading its talons upon the mountain land.", "properNames": ["Utu", "E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "824-829. All the people were placed (?) before it, the whole Land was detailed (?) to it. The Anuna gods stood there in admiration. The ruler, who is wise, who is knowledgeable, kissed the ground before that godly company. He touched the ground in prostration (?), with supplications and prayers; the ruler, the god of his city prayed.", "properNames": ["Anuna"], "missingText": []}, {"lineNumber": "2", "text": "830-833. For the bread-consuming house he added more and more bread, for the suppers in need of mutton he added sheep. In front of the house he lined up bowls like …… abundance …….", "properNames": [], "missingText": []}, {"lineNumber": "2", "text": "834-841. He went to the Anuna gods and prayed to them:  \"O all you Anuna gods, admired by the land of Lagaš, protectors of all the countries, whose command, a massive breach in a dam, carries away any who try to stop it. The worthy young man on whom you have looked will enjoy a long life. I, the shepherd, built the house, and now I will let my master enter his house. O Anuna gods, may you pray on my behalf!\"", "properNames": ["Anuna", "Lagaš"], "missingText": []}, {"lineNumber": "2", "text": "842-850. The true shepherd Gudea is wise, and able too to realise things. His friendly guardian went before him and his friendly protecting genius followed him. For his master, Lord Ninĝirsu, Gudea gave numerous gifts to the house of yore, the old house, his dwelling place. He went into the E-ninnu to the lord, and prayed to him:", "properNames": ["Gudea", "Ninĝirsu", "E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "851-862.  \"My master Ninĝirsu, lord who has turned back the fierce waters, lord whose commands take precedence, male child of Enlil, warrior, I have carried out faithfully what you have ordered me to do. Ninĝirsu, I have built up your house for you; now I shall let you enter it in joy! My goddess Bau, I have set up your E-mi quarters for you: take up pleasant residence in them.\" His call was heard, his hero Lord Ninĝirsu accepted from Gudea his prayer and supplication.", "properNames": ["Ninĝirsu", "Enlil", "Bau", "E-mi", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "863-870. The year ended and the month was completed. A new year started, a month began and three days elapsed in that month. As Ninĝirsu arrived from Eridug, beautiful moonlight shone illuminating the Land, and the E-ninnu competed with the new-born Suen.", "properNames": ["Ninĝirsu", "Eridug", "E-ninnu", "Suen"], "missingText": []}, {"lineNumber": "2", "text": "871-882. Gudea made a paste with cornelian and lapis lazuli and applied it to the corners. He sprinkled the floor with precious oil. He made the ……, who worked there (?), leave the house. Syrup, ghee, wine, sour milk, ĝipar fruit, fig-cakes topped with cheese, dates, …… and small grapes, things untouched by fire, were the foods for the gods which he prepared with syrup and ghee.", "properNames": ["Gudea"], "missingText": []}, {"lineNumber": "2", "text": "883-891. On the day when the true god was to arrive, Gudea was busy with the evening meal from early morning. Asari cared for the maintenance of the house. Ninmada took care of its cleaning. King Enki gave oracular pronouncements concerning it. Nindub, the chief purification priest of Eridug, filled it with the smoke of incense. The lady of precious rites, Nanše, versed in singing holy songs, sang songs for the house.", "properNames": ["Gudea", "Asari", "Ninmada", "Enki", "Nindub", "Eridug", "Nanše"], "missingText": []}, {"lineNumber": "2", "text": "892-906. They sheared the black ewes and milked the udder of the cow of heaven. They cleaned the E-ninnu, they polished it with brooms of tamarisk and ……. The ruler made the whole city kneel down, made the whole land prostrate itself. He levelled what was high, rejected chance utterances (?); the sorcerers' spittle (?) was removed from the roads. In the city only the mother of a sick person administered a potion. The wild animals, creatures of the steppe, all had crouched together. The lions and the dragons of the steppe were lying asleep.", "properNames": ["E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "907-909. The day was for supplication, the night was for prayer. The moonlight …… early morning. Its master …….", "properNames": [], "missingText": []}, {"lineNumber": "2", "text": "910-924. Warrior Ninĝirsu entered the house, the owner of the house had arrived. He was an eagle raising its eyes toward a wild bull. The warrior's entering his house was a storm roaring into battle. Ninĝirsu entered his house and it became the shrine of the abzu when there is a festival. The owner came out of his house and he was Utu rising over the land of Lagaš. Bau's going to her E-mi quarters was a true woman's taking her house in hand. Her entering her bedroom was the Tigris at high water. When she sat down beside her ……, she was the lady, the daughter of holy An, a green garden bearing fruit.", "properNames": ["Ninĝirsu", "Utu", "Lagaš", "Bau's", "E-mi", "Tigris", "An"], "missingText": []}, {"lineNumber": "2", "text": "925-928. The daylight came out, the fate had been decided. Bau entered her E-mi quarters, and there was abundance for the land of Lagaš. The day dawned. Utu of Lagaš lifted his head over the Land.", "properNames": ["Bau", "E-mi", "Lagaš", "Utu"], "missingText": []}, {"lineNumber": "2", "text": "929-933. The house received fattened oxen and sheep. Bowls were set up in the open air and were filled with wine. The Anuna gods of the land of Lagaš gathered around Lord Ninĝirsu. In the house the purification had been completed, the oracular pronouncements had been taken care of.", "properNames": ["Anuna", "Lagaš", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "934-943. Wine was poured from big jars while …… was heaped up in the E-ninnu. Nindub caused the sanctuary to be filled with clatter and noise (?) and with fresh bread and hind's milk available day and night; he woke from sleep the noble one, the beloved son of Enlil, the warrior Ninĝirsu. Ninĝirsu raised his head with all the great powers, and …… rituals, …… for (?) the sanctuary E-ninnu.", "properNames": ["E-ninnu", "Nindub", "Enlil", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "944-956. With his divine duties, namely to guide the hand of the righteous one; to force the evil-doer's neck into a neck stock; to keep the house safe; to keep the house pleasant; to instruct his city and the sanctuaries of Ĝirsu; to set up an auspicous throne; to hold the sceptre of never-ending days; to raise high the head of the shepherd called by Ninĝirsu, as if he wore a blue crown; and to appoint to their offices in the courtyard of E-ninnu the skin-clad ones, the linen-clad ones and those whose head is covered, Gudea introduced Ig-alim, the Great Door (ig gal), the Pole (dim) of Ĝir-nun, the chief bailiff of Ĝirsu, his beloved son, to Lord Ninĝirsu.", "properNames": ["Ĝirsu", "Ninĝirsu", "E-ninnu", "Gudea", "Ig-alim"], "missingText": []}, {"lineNumber": "2", "text": "957-970. With his divine duties, namely to keep the house clean; to let hands always be washed; to serve water to the lord with holy hands; to pour beer into bowls; to pour wine into jars; to make emmer beer in the brewery, the house of pure strength, fizz like the water of the Papsir canal; to make certain that faultless cattle and goats, grain-fed sheep, fresh bread and hind's milk are available day and night; to wake from sleep the noble one, Enlil's beloved son, the warrior Ninĝirsu, by offering (?) food and drink, Gudea introduced Šul-šaga, the lord of the pure hand-washings (šu-luḫ), the first-born son of E-ninnu, to Ninĝirsu.", "properNames": ["Enlil's", "Ninĝirsu", "Gudea", "Šul-šaga", "E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "971-982. With his divine duties, namely to carry the seven-headed mace; to open the door of the an-kar house, the Gate of Battle; to hit exactly with the dagger blades, with the mitum mace, with the \"floodstorm\" weapon and with the marratum club, its battle tools; to inundate Enlil's enemy land, Gudea introduced Lugal-kur-dub, the warrior Šar-ur, who in battle subdues all the foreign lands, the mighty general of the E-ninnu, a falcon against the rebel lands, his general, to Lord Ninĝirsu.", "properNames": ["Enlil's", "Gudea", "Lugal-kur-dub", "E-ninnu", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "983-989. After the heavenly mitum mace had roared against the foreign lands like a fierce storm -- the Šar-ur, the flood storm in battle, the cudgel for the rebel lands -- after the lord had frowned at the rebellious land, the foreign country, hurled at it his furious words, driven it insane (the text here seems to be corrupt, and there may be some lines missing) ,", "properNames": [], "missingText": []}, {"lineNumber": "2", "text": "990-992. With his divine duties, Gudea introduced the lord's second general, Kur-šuna-buruam, to the son of Enlil.", "properNames": ["Gudea", "Kur-šuna-buruam", "Enlil"], "missingText": []}, {"lineNumber": "2", "text": "993-1005. With his divine duties, namely to send entreaties on behalf of the land of Lagaš; to perform supplications and prayers for it, propitious ones; to greet pleasantly the warrior departing for Eridug; and until (?) Ninĝirsu comes from Eridug, to keep the throne of the built-up city firm; to pray, with hand placed before the nose, together with Gudea, for the life of the true shepherd, Gudea introduced his adviser, Lugal-si-sa, to Lord Ninĝirsu.", "properNames": ["Lagaš", "Eridug", "Ninĝirsu", "Gudea", "Lugal-si-sa"], "missingText": []}, {"lineNumber": "2", "text": "1006-1014. With his divine duties, namely to request; to command; to co-operate with the one speaking straightforwardly; to …… the one speaking evil; to inform Ninĝirsu, the warrior sitting on a holy dais in the E-ninnu, Gudea introduced Šakkan, the wild ram, the minister of the E-duga, his ……, to Lord Ninĝirsu.", "properNames": ["Ninĝirsu", "E-ninnu", "Gudea", "Šakkan", "E-duga"], "missingText": []}, {"lineNumber": "2", "text": "1015-1023. With his divine duties, namely to clean with water; to clean with soap; to …… with oil from white bowls and with (?) soap; to urge him to sweet sleep on his bed strewn with fresh herbs; to let him enter the E-duga, his bed chamber, from outside (?) and to make him not wish to leave it, Gudea introduced Kinda-zid, the man in charge of the E-duga, to Lord Ninĝirsu.", "properNames": ["E-duga", "Gudea", "Kinda-zid", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "1024-1034. With his divine duties, namely to yoke up the holy chariot decorated with stars; to harness the donkey stallion, Piriĝ-kaše-pada, before it; to …… a slender donkey from Eridug with the stallion; to have them joyfully transport their owner Ninĝirsu, Gudea introduced En-šeg-nun, who roars like a lion, who rises like a flood storm, Ninĝirsu's hurrying bailiff, his donkey herdsman, to Lord Ninĝirsu.", "properNames": ["Eridug", "Ninĝirsu", "Gudea", "En-šeg-nun", "Ninĝirsu's"], "missingText": []}, {"lineNumber": "2", "text": "1035-1040. With his divine duties, namely, to make the butter abundant; to make the cream abundant; to see that the butter and the milk of the holy goats, the milking goats, and the hind, the mother of Ninĝirsu, do not cease to flow in the E-ninnu sanctuary, Gudea introduced En-lulim, the herdsman of the hinds, to Lord Ninĝirsu.", "properNames": ["Ninĝirsu", "E-ninnu", "Gudea", "En-lulim"], "missingText": []}, {"lineNumber": "2", "text": "1041-1047. With his divine duties, namely to tune properly the sweet-toned tigi instrument; to fill the courtyard of E-ninnu with joy; to make the alĝar and miritum, instruments of the E-duga, offer their best in the E-ninnu to Ninĝirsu, the warrior with an ear for music, Gudea introduced his beloved musician, Ušumgal-kalama, to Lord Ninĝirsu.", "properNames": ["E-ninnu", "E-duga", "Ninĝirsu", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "1048-1057. With his divine duties, namely to soothe the heart, to soothe the spirits; to dry weeping eyes; to banish mourning from the mourning heart; to …… the heart of the lord that rises like the sea, that washes away like the Euphrates, that hits like a flood storm, that has overflowed with joy after inundating a land which is Enlil's enemy, Gudea introduced his balaĝ drum, Lugal-igi-ḫuš, to Lord Ninĝirsu.", "properNames": ["Euphrates", "Enlil's", "Gudea", "Lugal-igi-ḫuš", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "1058-1069. Zazaru, Iškur-pa-e, Ur-agrunta-ea, Ḫe-Ĝir-nuna, Ḫe-šaga, Zurĝu and Zarĝu, who are Bau's septuplets, the offspring of Lord Ninĝirsu, his beloved lukur maidens, who create plenty for the myriads, stepped forward to Lord Ninĝirsu with friendly entreaties on behalf of Gudea.", "properNames": ["Zazaru", "Iškur-pa-e", "Ur-agrunta-ea", "Ḫe-Ĝir-nuna", "Ḫe-šaga", "Zurĝu", "Zarĝu", "Bau's", "Ninĝirsu", "Gudea"], "missingText": []}, {"lineNumber": "2", "text": "1070-1081. With his divine duties, namely to see that the great fields grow rich; to see that the levees and ditches of Lagaš will be full to the brim; to see that Ezina-Kusu, the pure stalk, will raise its head high in the furrows in Gu-edina, the plain befitting its owner; to see that after the good fields have provided wheat, emmer and all kinds of pulses, numerous grain heaps -- the yield of the land of Lagaš -- will be heaped up, Gudea introduced Ĝišbar-e, Enlil's surveyor, the farmer of Gu-edina, to Lord Ninĝirsu.", "properNames": ["Lagaš", "Ezina-Kusu", "Gu-edina", "Gudea", "Ĝišbar-e", "Enlil's", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "1082-1087. With his divine duties, namely to make sure that Imin-šatam, the messenger of Gu-edina, informs Ninĝirsu in the E-ninnu about the amount of carp and perch (?) yielded by the marshes, and about the quantity of new shoots of reed yielded by the green reedbeds, Gudea introduced Lama, the inspector of the fisheries of Gu-edina, to Lord Ninĝirsu.", "properNames": ["Gu-edina", "Ninĝirsu", "E-ninnu", "Gudea", "Lama"], "missingText": []}, {"lineNumber": "2", "text": "1088-1099. With his divine duties, namely to administer the open country, the pleasant place; to give directions concerning the Gu-edina, the pleasant open country; to make its birds propagate (?); to have them lay their eggs in nests (?); to have them rear their young; to see that the multiplication of the beasts of Ninĝirsu's beloved countryside does not diminish, Gudea introduced Dim-gal-abzu, the herald of Gu-edina, to Lord Ninĝirsu.", "properNames": ["Gu-edina", "Ninĝirsu's", "Gudea", "Dim-gal-abzu", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "1100-1106. With his divine duties, namely to erect cities; to found settlements; to build guard-houses for the wall of the Iri-kug; to have its divine resident constable, the mace of white cedar with its enormous head, patrol around the house, Gudea introduced Lugal-ennu-iri-kugakam to Lord Ninĝirsu.", "properNames": ["Iri-kug", "Gudea", "Lugal-ennu-iri-kugakam", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "1107-1117. Holy An made the location appropriate. Enlil wound (?) a turban (?) round its top. Ninḫursaĝa looked at it approvingly. Enki, the king of Eridug, drove in its foundation pegs. The true lord with a pure heart, Suen, made its powers the largest in heaven and on earth. Ninĝirsu chose it among shrines of sprouting seeds with his heart. Mother Nanše cared for it especially among the buildings of the land of Lagaš. But it was the god of most reliable progeny who built the house and made its name famous.", "properNames": ["An", "Enlil", "Ninḫursaĝa", "Enki", "Eridug", "Suen", "Ninĝirsu", "Nanše", "Lagaš"], "missingText": []}, {"lineNumber": "2", "text": "1118-1124. The mighty steward of Nanše, the accomplished shepherd of Ninĝirsu, is wise, and able too to realise things; the man in charge of building the house, Gudea the ruler of Lagaš, was to make presents for the house.", "properNames": ["Nanše", "Ninĝirsu", "Gudea", "Lagaš"], "missingText": []}, {"lineNumber": "2", "text": "1125-1142. Gudea, the ruler in charge of building the house, the ruler of Lagaš, presented it with the chariot \"It makes the mountains bow down\", which carries awesome radiance and on which great fearsomeness rides and with its donkey stallion, Ud-gu-dugduga, to serve before it; with the seven-headed mace, the fierce battle weapon, the weapon unbearable both for the North and for the South, with a battle cudgel, with the mitum mace, with the lion-headed weapon made from nir stone, which never turns back before the highlands, with dagger blades, with nine standards, with the \"strength of heroism\", with his bow which twangs like a meš forest, with his angry arrows which whizz like lightning flashes in battle, and with his quiver, which is like a lion, a piriĝ lion, or a fierce snake sticking out its tongue -- strengths of battle imbued with the power of kingship.", "properNames": ["Gudea", "Lagaš"], "missingText": []}, {"lineNumber": "2", "text": "1143-1154. Along with copper, tin, slabs of lapis lazuli, refined silver and pure Meluḫa cornelian, he set up (?) huge copper cauldrons, huge …… of copper, shining copper goblets and shining copper jars worthy of An, for laying (?) a holy table in the open air …… at the place of regular offerings (?). Ninĝirsu gave his city, Lagaš ……. He set up his bed within the bedchamber, the house's resting place; and everyone (?) rested like birds in the streets with the son of Enlil.", "properNames": ["Meluḫa", "An", "Ninĝirsu", "Lagaš", "Enlil"], "missingText": []}, {"lineNumber": "2", "text": "1155-1181. With his duties, namely to fill the channels with flowing water; to make the marshes full with carp and perch (?) and to have the inspector of fisheries and the inspector of dykes stand at their posts; to fill the great waters with boats carrying grain; to see that tons, heaps and tons -- the yield of the land of Lagaš -- will be piled up; to see that cattle-pens and sheepfolds will be erected; to see that lambs abound around healthy ewes; to have the rams let loose on the healthy ewes; to see that numerous calves stand beside healthy cows; to see that breed bulls bellow loudly among them; to have the oxen properly yoked and to have the farmers and ox drivers stand beside them; to have donkeys carry packsaddles and to have their drivers, who feed them, follow behind them; to see that large copper …… will be strapped onto jackasses; to see that the principal mill will produce (?); to …… the house of Ninĝirsu's young slave women; to set …… right; to see that the courtyard of the E-ninnu will be filled with joy; to see that the ala drums and balaĝ drum will sound in perfect concert with the sim drums, and to see that his beloved drum Ušumgal-kalama will walk in front of the procession, the ruler who had built the E-ninnu, Gudea, himself entered before Lord Ninĝirsu.", "properNames": ["Lagaš", "Ninĝirsu's", "E-ninnu", "Ušumgal-kalama", "Gudea", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "1182-1202. The temple towered upwards in full grandeur, unparallelled in fearsomeness and radiance. Like a boat it …… and ……. Its owner, the warrior Ninĝirsu, came out as the daylight on the dais of Ĝir-nun. Its …… resting on supports was like the blue sky in all its splendour. Its standards and their caps (?) were Ninĝirsu himself emanating fearsomeness; their leather straps stretched out in front of them were green snake-eater birds bathing. Its owner, the warrior Ninĝirsu, stood like Utu in his most fascinating blue chariot. Its throne, standing in the guena hall, was An's holy seat which is sat upon joyfully. Its bed, standing in the bedroom, was a young cow kneeling down in its sleeping place. On its holy quilt (?), strewn with fresh herbs, Mother Bau was resting comfortably with Lord Ninĝirsu.", "properNames": ["Ninĝirsu", "Utu", "An's", "Bau"], "missingText": []}, {"lineNumber": "2", "text": "1203-1210. Large bronze plates (?) offered all sorts of food (?). In the good house …… were cooked in shining bronze vessels (?). Its pure bowls standing in the great dining hall were troughs in various sizes that never lack water, and the goblets beside them were the Tigris and Euphrates continually carrying abundance.", "properNames": ["Tigris", "Euphrates"], "missingText": []}, {"lineNumber": "2", "text": "1211-1223. He had everything function as it should in his city. Gudea had built the E-ninnu, made its powers perfect. He brought butter and cream into its dairy and provided its …… with bread (?). He had debts remitted and made all hands clear. When his master entered the house, for seven days the slave woman was allowed to became equal to her mistress and the slave was allowed to walk side by side with his master. But the ritually unclean ones could sleep only at the border of his city. He silenced the evil-speaking tongue and locked up evil.", "properNames": ["Gudea", "E-ninnu"], "missingText": []}, {"lineNumber": "2", "text": "1224-1231. He paid attention to the justice of Nanše and Ninĝirsu. He provided protection for the orphan against the rich, and provided protection for the widow against the powerful. He had the daughter become the heir in the families without a son. A day of justice dawned for him. He set his foot on the neck of evil ones and malcontents.", "properNames": ["Nanše", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "1232-1247. Like Utu, he rose on the horizon for the city. He wound (?) a turban (?) on his head. He made himself known by the eyes of holy An. He entered the shrine of E-ninnu with raised head like a bull and sacrificed there faultless oxen and kids. He set bowls in the open air and filled them full with wine. Ušumgal-kalama was accompanied by tigi drums, and ala drums roared for him like a storm. The ruler stepped onto the outer wall (?) and his city looked up to him in admiration. Gudea ……. 6 lines missing", "properNames": ["Utu", "An", "E-ninnu", "Gudea"], "missingText": ["6 lines missing"]}, {"lineNumber": "2", "text": "1254-1257. …… made abundance come forth for him. The earth produced mottled barley for him. Lagaš thrived in abundance with the ruler.", "properNames": ["Lagaš"], "missingText": []}, {"lineNumber": "2", "text": "1258-1276. For the warrior who entered his new house, for Lord Ninĝirsu, he arranged a rich banquet. He seated An at the place of honour for him, he seated Enlil next to An and Ninmaḫ next to Enlil. 12 lines missing1 line fragmentary", "properNames": ["Ninĝirsu", "An", "Enlil", "Ninmaḫ"], "missingText": ["12 lines missing", "1 line fragmentary"]}, {"lineNumber": "2", "text": "1277-1284. Rejoicing over the house, the owner determined a fate for the brickwork of E-ninnu:  \"O brickwork of E-ninnu, let there be a good fate determined, brickwork of E-ninnu, let there be a fate determined, let there be a good fate determined! House! Mountain founded by An, built in grandeur!\" 16 lines missing", "properNames": ["E-ninnu", "An"], "missingText": ["16 lines missing"]}, {"lineNumber": "2", "text": "1301-1320. …… determined a fate for the brickwork of E-ninnu:  \"O brickwork, let there be a fate determined, brickwork of E-ninnu, let there be a good fate determined! House …… embers (?) …… embracing heaven. …… holy …….\" 14 lines missing1 line fragmentary", "properNames": ["E-ninnu"], "missingText": ["14 lines missing", "1 line fragmentary"]}, {"lineNumber": "2", "text": "1321-1325.  \"On your behalf, numerous cow-pens will be erected and many sheepfolds renewed! The people will lie down in safe pastures, enjoying abundance under you. The eyes of Sumer and all the countries will be directed toward you. An will elevate your house of Anzud for you.\" 11 lines missing", "properNames": ["Sumer", "An"], "missingText": ["11 lines missing"]}, {"lineNumber": "2", "text": "1337-1354. 3 lines fragmentary  \"…… grown as tall as Gilgameš. No one shall remove its throne set up there. Your god, Lord Ninĝišzida, is the grandson of An; your divine mother is Ninsumun, the bearing mother of good offspring, who loves her offspring; you are a child born by the true cow. You are a true youth made to rise over the land of Lagaš by Ninĝirsu; your name is established from below to above. Gudea, nobody …… what you say. You are …… a man known to An. You are a true ruler, for whom the house has determined a good fate. Gudea, son of Ninĝišzida, you will enjoy a long life!\"", "properNames": ["Gilgameš", "Ninĝišzida", "An", "Ninsumun", "Lagaš", "Ninĝirsu", "Gudea"], "missingText": ["3 lines fragmentary"]}, {"lineNumber": "2", "text": "1355-1361. The house reaches up to heaven like a huge mountain and its fearsomeness and radiance have settled upon the Land. An and Enlil have determined the fate of Lagaš; Ninĝirsu's authority has become known to all the countries; E-ninnu has grown so high as to fill the space between heaven and earth. Ninĝirsu be praised!", "properNames": ["An", "Enlil", "Lagaš", "Ninĝirsu's", "E-ninnu", "Ninĝirsu"], "missingText": []}, {"lineNumber": "2", "text": "1362-1363. This is the end of the hymn \"The building of Ninĝirsu's house\".", "properNames": ["Ninĝirsu's"], "missingText": []}], "transliterations": ["© Copyright 2003, 2004, 2005, 2006 The ETCSL project, Faculty of Oriental Studies, University of OxfordUpdated 2006-12-19 by JE"]}
