{
  "id": "t.2.1.2",
  "title": "The rulers of Lagaš",
  "paragraphs": [
    {
      "lineNumber": "2",
      "text": "1-16. After the flood had swept over and brought about the destruction of the countries; when mankind was made to endure, and the seed of mankind was preserved and the black-headed people all rose; when An and Enlil called the name of mankind and established rulership, but kingship and the crown of the city had not yet come out from heaven, and Ninĝirsu had not yet established for the multitude of well-guarded (?) people the pickaxe, the spade, the earth basket and the plough, which mean life for the Land -- in those days, the carefree youth of man lasted for 100 years and, following his upbringing, he lasted for another 100 years.",
      "properNames": [
        "An",
        "Enlil",
        "Ninĝirsu"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "17-31. However, he did not do any work. He became smaller and smaller, ……; his sheep died (?) in the sheepfold. In those days, because the water of Lagaš was held back, there was famine in Ĝirsu. Canals were not dug, the levees and ditches were not cleaned. The large arable tracts were not ……, there was no water to irrigate abundantly all the cultivated fields: the people relied on rain; Ezina did not make dappled barley grow, furrows were not yet opened, they bore no yield; the high plain was not tilled, it bore no yield.",
      "properNames": [
        "Lagaš",
        "Ĝirsu",
        "Ezina"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "32-49. None of the countries with numerous people libated emmer beer, liquor, ……, sweet liquor or …… for the gods. They did not till large fields for them with the plough. 10 lines missing …… the canal. …… its (?) fields.",
      "properNames": [],
      "missingText": [
        "10 lines missing"
      ]
    },
    {
      "lineNumber": "2",
      "text": "50-65. In order to dig canals, to clean the levees and ditches, to …… the large arable tracts, to …… all the cultivated fields, he established for the people the pickaxe, the spade, the earth basket, and the plough, which mean life for the Land. Then he turned his attention to making barley sprout. He made the people stand before the maiden, and they raised their heads day and night, at the appointed times. Before Ezina who makes the seeds grow, they prostrated themselves and she made them grow (?). Before (?) Ezina who makes the dappled barley grow, they …… 33 lines missing or uncertain",
      "properNames": [
        "Ezina"
      ],
      "missingText": [
        "33 lines missing or uncertain"
      ]
    },
    {
      "lineNumber": "2",
      "text": "99-102. …… acted for …… years. …… dug the canal ……, he acted for 2760 years.",
      "properNames": [],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "103-124. En-akigalaguba: his personal god was ……, he dug the canal Niĝin-ĝiš-tukuam, he acted for 1200 years. In those days there was no writing, ……, canals were not dug, earth baskets were not carried. In those days, ……, the people …… offerings of refined gold 2 lines uncertain a good shepherd rose over the Land; he gave them (?) …… as a gift. En-Ninĝirsu-ki-aĝ, the son of En-akigalaguba: he acted for 1320 years. En-Enlile-ki-aĝ, the son of En-Ninĝirsu-ki-aĝ: he acted for 1800 years. Ur-Bau the son of En-Enlile-ki-aĝ: he acted for 900 years.",
      "properNames": [
        "En-akigalaguba",
        "Niĝin-ĝiš-tukuam",
        "En-Ninĝirsu-ki-aĝ",
        "Ninĝirsu",
        "En-Enlile-ki-aĝ",
        "Enlile",
        "Ur-Bau",
        "Bau"
      ],
      "missingText": [
        "2 lines uncertain"
      ]
    },
    {
      "lineNumber": "2",
      "text": "125-130. A-gal: his personal god was Ig-alim, he acted for 660 years. Kue (?), the son of A-gal: he acted for 1200 years. Ama-alim, son of Kue (?): ……, he acted for 600 years.",
      "properNames": [
        "A-gal",
        "Ig-alim",
        "Kue",
        "Ama-alim"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "131-142. 12 lines unclear or missing(the lines list further rulers with unrecoverable names and length of rule)",
      "properNames": [],
      "missingText": [
        "12 lines unclear or missing"
      ]
    },
    {
      "lineNumber": "2",
      "text": "143-163. 2 lines missing he dug the Maḫ canal, the …… canal, the Piriĝgin-ĝen canal, the …… canal, the Piriĝ canal at the mouth of the Lugal canal, the Gana-hili-ana canal, the …… canal, and the Nanše-pada canal. To care, single-handedly, for the great arable lands, he dug irrigation ditches and ……, he acted for 2220 years. Ur-Nanše, the son of ……, who built the E-Sirara, her temple of happiness and Niĝin, her beloved city, acted for 1080 years. Ane-tum, the son of Ur-Nanše, in whose …… place the gods stood, who …… the land register of great Enlil: his personal god was Šul-utul, he acted for 690 years. ……, the son of Ane-tum: he acted for X + 360 years.",
      "properNames": [
        "Maḫ",
        "Piriĝgin-ĝen",
        "Piriĝ",
        "Lugal",
        "Gana-hili-ana",
        "Nanše-pada",
        "Nanše",
        "Ur-Nanše",
        "E-Sirara",
        "Niĝin",
        "Ane-tum",
        "Ane",
        "Enlil",
        "Šul-utul"
      ],
      "missingText": [
        "2 lines missing"
      ]
    },
    {
      "lineNumber": "2",
      "text": "164-172. En-entar-zid: his god was Meš-an-du (?), of the seed of ancient days, who had grown together with the city, he acted for 990 years. ……, the son of En-entar-zid: he dug the canal Urmaḫ-banda, and the canal Tabta-kug-ĝal, his personal god was Meš-an-du (?); his master Ninĝirsu commanded him to build his temple; he acted for 960 years.",
      "properNames": [
        "En-entar-zid",
        "Meš-an-du",
        "Urmaḫ-banda",
        "Tabta-kug-ĝal",
        "Ninĝirsu"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "173-175. En-Enlile-su: he acted for 600 years. ……, the son of En-Enlile-su: his personal god was Ninazu; he acted for 660 years.",
      "properNames": [
        "En-Enlile-su",
        "Enlile",
        "Ninazu"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "176. ……: he acted for 1110 years.",
      "properNames": [],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "177-181. Puzur-Ninlil: he acted for X × 60 + 1 years. En-Meš-an-du (?), the son of Puzur-Ninlil: his personal god was ……, he acted for 120 years. Dadu, the son of En-Meš-an-du (?): he acted for 160 years. Tuggur, the son of Dadu: he acted for 160 years.",
      "properNames": [
        "Puzur-Ninlil",
        "Ninlil",
        "En-Meš-an-du",
        "Meš-an-du",
        "Dadu",
        "Tuggur"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "182. ……: he acted for 120 years.",
      "properNames": [],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "183-191. Puzur-Mama, the scribe of Ninki: his personal god was Zazaru; he acted for …… years. Lamku-niĝgena (?), the administrator of Puzur-Mama, who built the wall of Ĝirsu, his ……, and the Tiraš palace in Lagaš: he acted for 280 years. Ḫenĝal, the son of Lamku-niĝgena (?): his god was Pabilsaĝ (?), he acted for 140 years. ……, the son of Ḫenĝal: he acted for 144 years.",
      "properNames": [
        "Puzur-Mama",
        "Mama",
        "Ninki",
        "Zazaru",
        "Lamku-niĝgena",
        "Ĝirsu",
        "Lagaš",
        "Ḫenĝal",
        "Pabilsaĝ"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "192-199. Ur-Ninmarki, the scribe and scholar: ……, his personal gods were Ḫaya and Nisaba, he acted for X + 20 years. Ur-Ninĝirsu, the son of Ur-Ninmarki: he acted for X × 60 years. Ur-Bau, the scribe of Ur-Ninĝirsu, who …… in the assembly: he acted for X + 30 years. Gudea, the younger brother of Ur-Bau, ……, who was not the son of his mother nor the son of his father: he acted for …… years.",
      "properNames": [
        "Ur-Ninmarki",
        "Ninmarki",
        "Ḫaya",
        "Nisaba",
        "Ur-Ninĝirsu",
        "Ninĝirsu",
        "Ur-Bau",
        "Bau",
        "Gudea"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "200. Written in the school. Nisaba be praised!",
      "properNames": [
        "Nisaba"
      ],
      "missingText": []
    }
  ],
  "transliterations": [
    "© Copyright 2003, 2004, 2005, 2006 The ETCSL project, Faculty of Oriental Studies, University of OxfordUpdated 2006-12-19 by JE"
  ]
}