{
  "id": "t.2.1.5",
  "title": "The cursing of Agade",
  "paragraphs": [
    {
      "lineNumber": "2",
      "text": "1-9. After Enlil's frown had slain Kiš as if it were the Bull of Heaven, had slaughtered the house of the land of Unug in the dust as if it were a mighty bull, and then Enlil had given the rulership and kingship from the south as far as the highlands to Sargon, king of Agade -- at that time, holy Inana established the sanctuary of Agade as her celebrated woman's domain; she set up her throne in Ulmaš.",
      "properNames": [
        "Enlil's",
        "Kiš",
        "Unug",
        "Enlil",
        "Sargon",
        "Agade",
        "Inana",
        "Ulmaš"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "10-24. Like a young man building a house for the first time, like a girl establishing a woman's domain, holy Inana did not sleep as she ensured that the warehouses would be provisioned; that dwellings would be founded in the city; that its people would eat splendid food; that its people would drink splendid beverages; that those bathed for holidays would rejoice in the courtyards; that the people would throng the places of celebration; that acquaintances would dine together; that foreigners would cruise about like unusual birds in the sky; that even Marhaši would be re-entered on the tribute rolls; that monkeys, mighty elephants, water buffalo, exotic animals, as well as thoroughbred dogs, lions,  {mountain ibexes} {(some mss. have instead:)  mountain beasts (?)} {(some mss. have instead:)  horses}, and alum sheep with long wool would jostle each other in the public squares.",
      "properNames": [
        "Inana",
        "Marhaši"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "25-39. She then filled Agade's stores for emmer wheat with gold, she filled its stores for white emmer wheat with silver; she delivered copper, tin, and blocks of lapis lazuli to its granaries and sealed its silos from outside. She endowed its old women with the gift of giving counsel, she endowed its old men with the gift of eloquence. She endowed its young women with the gift of entertaining, she endowed its young men with martial might, she endowed its little ones with joy. The nursemaids  {who cared for} {(some mss. have instead:)  of} the general's children played the drumsticks. Inside the city tigi drums sounded; outside it, flutes and zamzam instruments. Its harbour where ships moored was full of joy. All foreign lands rested contentedly, and their people experienced happiness.",
      "properNames": [
        "Agade's"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "40-56. Its king, the shepherd Naram-Suen, rose as the daylight on the holy throne of Agade. Its city wall  {, like a mountain,} {(1 ms. has instead:) , a great mountain,} reached the heavens. It was like the Tigris  {going to} {(some mss. have instead:)  flowing into} the sea as holy Inana opened the portals of its city-gates and made Sumer bring its own possessions upstream by boats. The highland Martu, people ignorant of agriculture, brought spirited cattle and kids for her. The Meluḫans, the people of the black land, brought  {exotic wares} {(some mss. have instead:)  wares of foreign countries} up to her. Elam and Subir loaded themselves with goods for her as if they were packasses. All the governors, the  {temple administrators} {(1 ms. has instead:)  generals}, and the accountants of the Gu-edina regularly supplied the monthly and New Year offerings. What a weariness all these caused at Agade's city gates! Holy Inana could hardly receive all these offerings. As if she were a citizen there, she could not restrain (?) the desire (?) to prepare the ground for a temple.",
      "properNames": [
        "Naram-Suen",
        "Suen",
        "Agade",
        "Tigris",
        "Inana",
        "Sumer",
        "Martu",
        "Meluḫans",
        "Elam",
        "Subir",
        "Gu-edina",
        "Agade's"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "57-65. But the statement coming from the E-kur was disquieting. Because of Enlil (?) all Agade was reduced (?) to trembling, and terror befell Inana in Ulmaš. She left the city, returning to her home. Holy Inana abandoned the sanctuary of Agade like someone abandoning the young women of her woman's domain. Like a warrior hurrying to arms, she  {removed} {(some mss. have instead:)  tore away} the gift of battle and fight from the city and handed them over to the enemy.",
      "properNames": [
        "E-kur",
        "Enlil",
        "Agade",
        "Inana",
        "Ulmaš"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "66-76. Not even five or 10 days had passed and Ninurta brought the jewels of rulership, the royal crown, the emblem and the royal throne bestowed on Agade, back into his E-šu-me-ša. Utu took away the eloquence of the city. Enki took away its wisdom. An took  {up} {(some mss. have instead:)  out} {(1 ms. has instead:)  away} into the midst of heaven its fearsomeness that reaches heaven. Enki tore out its well-anchored holy mooring pole from the abzu. Inana took away its weapons.",
      "properNames": [
        "Ninurta",
        "Agade",
        "E-šu-me-ša",
        "Utu",
        "Enki",
        "An",
        "Inana"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "77-82. The life of Agade's sanctuary was brought to an end as if it had been only the life of a tiny carp in the deep waters, and all the cities were watching it. Like a mighty elephant, it bent its neck to the ground while they all raised their horns like mighty bulls. Like a dying dragon, it dragged its head on the earth and they jointly deprived it of honour as in a battle.",
      "properNames": [
        "Agade's"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "83-93. Naram-Suen saw in a nocturnal vision that Enlil would not let the kingdom of Agade occupy a pleasant, lasting residence, that he would make its future altogether unfavourable, that he would make its temples shake and would  {scatter its treasures} {(1 ms. has instead:)  destroy its treasuries}. He realised what the dream was about, but did not put into words, and did not discuss it with anyone.  {(1 ms. adds 2 lines:)  …… temples shake ……, …… perform (?) extispicy regarding (?) his temple …….} Because of the E-kur, he put on mourning clothes,  {covered his chariot with a reed mat} {(1 ms. has instead:)  pulled out the outside pin of his chariot}, tore the reed canopy off  {his ceremonial barge} {(1 ms. has instead:)  the prow of his ceremonial barge} {(1 ms. has instead:)  the cabin of his ceremonial barge}, and gave away his royal paraphernalia. Naram-Suen persisted for seven years! Who has ever seen a king burying his head in his hands for seven years?  {(some mss. add the line:)  He realised what the dream was about, but did not put into words, and did not discuss it with anyone.}",
      "properNames": [
        "Naram-Suen",
        "Suen",
        "Enlil",
        "Agade",
        "E-kur"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "94-99. Then he went to perform extispicy on a kid regarding the temple, but the omen had nothing to say about the building of the temple. For a second time he went to perform extispicy on a kid regarding the temple, but the omen again had nothing to say about the building of the temple. In order to change what had been inflicted (?) upon him, he tried to to alter Enlil's pronouncement.",
      "properNames": [
        "Enlil's"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "100-119. Because his subjects were dispersed, he now began a mobilization of his troops. Like a wrestler who is about to enter the great courtyard, he …… his hands towards (?) the E-kur. Like an athlete bent to start a contest, he treated the giguna as if it were worth only thirty shekels. Like a robber plundering the city, he set tall ladders against the temple. To demolish E-kur as if it were a huge ship, to break up its soil like the soil of mountains where precious metals are mined, to splinter it like the lapis lazuli mountain, to prostrate it like a city inundated by Iškur -- alhough the temple was not the Mountains of Cedar-felling, he had large axes cast, he had double-edged agasilig axes sharpened to be used against it. He set spades against its roots and it sank as low as the foundation of the Land. He put axes against its top, and the temple, like a dead soldier, bowed its neck before him, and all the foreign lands bowed their necks before him.",
      "properNames": [
        "E-kur",
        "Iškur",
        "Mountains of Cedar-felling"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "120-148. He ripped out its drain pipes, and all the rain went back to the heavens. He tore off its upper lintel and  {the Land was deprived of its ornament} {(1 ms. has instead:)  the ornament of the Land disappeared}. From its Gate from which Grain is never Diverted, he diverted grain, and the Land was deprived of grain. He struck the Gate of Well-Being with the pickaxe, and well-being was subverted in all the foreign lands. As if they were for great tracts of land with wide carp-filled waters, he cast large  {spades} {(1 ms. has instead:)  axes} to be used against the E-kur. The people could see the bedchamber, its room which knows no daylight. The Akkadians could look into the holy treasure chest of the gods. Though they had committed no sacrilege, its laḫama deities of the great pilasters standing at the temple were thrown into the fire by Naram-Suen. The cedar, cypress, juniper and boxwood, the woods of its giguna, were …… by him. He put its gold in containers and put its silver in leather bags. He filled the docks with its copper, as if it were a huge transport of grain. The silversmiths were re-shaping its silver, jewellers were re-shaping its precious stones, smiths were beating its copper. Large ships were moored at the temple, large ships were moored at Enlil's temple and its possessions were taken away from the city, though they were not the goods of a plundered city. With the possessions being taken away from the city, good sense left Agade. As the ships  {moved away from} {(some mss. have instead:)  juddered} the docks, Agade's  {intelligence} {(1 ms. has instead:)  sanctuary} was removed.",
      "properNames": [
        "E-kur",
        "Akkadians",
        "Naram-Suen",
        "Suen",
        "Enlil's",
        "Agade",
        "Agade's"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "149-175. Enlil, the roaring storm that subjugates the entire land, the rising deluge that cannot be confronted, was considering what should be destroyed in return for the wrecking of his beloved E-kur. He lifted his gaze towards the Gubin mountains, and made all the inhabitants of the broad mountain ranges descend (?). Enlil brought out of the mountains those who do not resemble other people, who are not reckoned as part of the Land, the Gutians, an unbridled people, with human intelligence but canine  {instincts} {(some mss. have instead:)  feelings} and monkeys' features. Like small birds they swooped on the ground in great flocks. Because of Enlil, they stretched their arms out across the plain like a net for animals. Nothing escaped their clutches, no one left their grasp. Messengers no longer travelled the highways, the courier's boat no longer passed along the rivers. The Gutians drove the trusty (?) goats of Enlil out of their folds and compelled their herdsmen to follow them, they drove the cows out of their pens and compelled their cowherds to follow them. Prisoners manned the watch. Brigands  {occupied} {(1 ms. has instead:)  attacked} the highways. The doors of the city gates of the Land  {lay dislodged in} {(1 ms. has instead:)  were covered with} mud, and all the foreign lands uttered bitter cries from the walls of their cities. They  {established gardens for themselves} {(1 ms. has instead:)  made gardens grow} within the cities, and not as usual on the wide plain outside. As if it had been before the time when cities were built and founded, the large  {(some mss. add:)  fields and} arable tracts yielded no grain, the inundated  {(some mss. add:)  fields and} tracts yielded no fish, the irrigated orchards yielded no syrup or wine, the thick clouds (?) did not rain, the mašgurum plant did not grow.",
      "properNames": [
        "Enlil",
        "E-kur",
        "Gubin",
        "Gutians"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "176-192. In those days, oil for one shekel was only half a litre, grain for one shekel was only half a litre, wool for one shekel was only one mina, fish for one shekel filled only one ban measure -- these sold at such prices in the markets of the cities! Those who lay down on the roof, died on the roof; those who lay down in the house were not buried. People were flailing at themselves from hunger. By the Ki-ur, Enlil's great place, dogs were packed together in the silent streets; if two men walked there they would be devoured by them, and if three men walked there they would be devoured by them. Noses were punched (?), heads were smashed (?), noses (?) were piled up, heads were sown like seeds. Honest people were confounded with traitors, heroes lay dead on top of heroes, the blood of traitors ran upon the blood of honest men.",
      "properNames": [
        "Ki-ur",
        "Enlil's"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "193-209. At that time, Enlil rebuilt his great sanctuaries into small reed (?) sanctuaries and from east to west he reduced their storehouses. The old women who survived those days, the old men who survived those days and the chief lamentation singer who survived those years set up seven balaĝ drums, as if they stood at the horizon, and together with ub  {, meze, and lilis} {(some mss. have instead:) , šem, and lilis} {(1 ms. has instead:)  and bronze šem} drums made them resound to Enlil like Iškur for seven days and seven nights. The old women did not restrain the cry  \"Alas for my city!\". The old men did not restrain the cry  \"Alas for its people!\". The lamentation singer did not restrain the cry  \"Alas for the E-kur!\". Its young women did not restrain from tearing their hair. Its young men did not restrain from sharpening their knives. Their laments were as if Enlil's ancestors were performing a lament in the awe-inspiring Holy Mound by the holy knees of Enlil. Because of this, Enlil entered his holy bedchamber and lay down fasting.",
      "properNames": [
        "Enlil",
        "Iškur",
        "E-kur",
        "Enlil's"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "210-221. At that time, Suen, Enki, Inana, Ninurta, Iškur, Utu, Nuska, and Nisaba,  {the great gods} {(1 ms. has instead:)  all the gods whosoever},  {cooled} {(1 ms. has instead:)  sprinkled} Enlil's heart with cool water and prayed to him:  \"Enlil, may the city that destroyed your city be treated as your city has been treated! May the one that defiled your giguna be treated as Nibru! In this city, may heads fill the wells! May no one find his acquaintances there, may brother not recognise brother! May its young woman be cruelly killed in her woman's domain, may its old man cry in distress for his slain wife! May its pigeons moan on their window ledges, may its small birds be smitten in their nooks, may it live in constant anxiety like a timid pigeon!\"",
      "properNames": [
        "Suen",
        "Enki",
        "Inana",
        "Ninurta",
        "Iškur",
        "Utu",
        "Nuska",
        "Nisaba",
        "Enlil's",
        "Enlil",
        "Nibru"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "222-244. Again, Suen, Enki, Inana, Ninurta, Iškur, Utu, Nuska and Nisaba, all the gods whosoever, turned their attention to the city, and cursed Agade severely:  \"City, you pounced on E-kur: it is as if you had pounced on Enlil! Agade, you pounced on E-kur: it is as if you had pounced on Enlil! May your holy walls, to their highest point, resound with mourning! May your giguna be reduced to a pile of dust! May your pilasters with the standing lahama deities fall to the ground like tall young men drunk on wine! May your clay be returned to its abzu, may it be clay cursed by Enki! May your grain be returned to its furrow, may it be grain cursed by Ezina! May your timber be returned to its forest, may it be timber cursed by Ninilduma! May  {the} {(1 ms. has instead:)  your} cattle slaughterer slaughter his wife, may  {your} {(some mss. have instead:)  the} sheep butcher butcher his child! May water wash away your pauper as he is looking for ……! May your prostitute hang herself at the entrance to her brothel! May your pregnant (?) priestesses and cult prostitutes abort (?) their children! May your gold be bought for the price of silver, may your silver be bought for the price of pyrite (?), and may your copper be bought for the price of lead!\"",
      "properNames": [
        "Suen",
        "Enki",
        "Inana",
        "Ninurta",
        "Iškur",
        "Utu",
        "Nuska",
        "Nisaba",
        "Agade",
        "E-kur",
        "Enlil",
        "Ezina",
        "Ninilduma"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "245-255.  \"Agade, may your strong man be deprived of his strength, so that he will be unable to lift his sack of provisions and ……, and will not have the joy of controlling your superior asses; may he lie idle all day! May this make the city die of hunger! May your citizens, who used to eat fine food, lie hungry, may your …… man eat the coating on his roof, may he chew (?) the leather hinges on the main door of his father's house! May depression descend upon your  {palace, built for joy} {(1 ms. has instead:)  joyous palace}! May the evils of the desert, the silent place, howl continuously!\"",
      "properNames": [
        "Agade"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "256-271.  \"May foxes that frequent ruin mounds brush with their tails your uzga precinct, established for purification ceremonies! May the ukuku, the bird of depression, make its nest in your gateways, established for the Land! In your city that could not sleep because of the tigi drums, that could not rest from its joy, may the bulls of Nanna that fill the pens bellow like those who wander in the desert, the silent place! May the grass grow long on your canal-bank tow-paths, may the grass of mourning grow on your highways laid for waggons! Moreover, may …… wild rams (?) and alert snakes of the mountains allow no one to pass on your tow-paths built up with canal sediment! In your plains where fine grass grows, may the reed of lamentation grow!  {Agade, may brackish water flow} {(1 ms. has instead:)  May brackish water flow in the river,} where fresh water flowed for you! If someone decides,  \"I will dwell in this city!\", may he not enjoy the pleasures of a dwelling place! If someone decides,  \"I will rest in Agade!\", may he not enjoy the pleasures of a resting place!\"",
      "properNames": [
        "Nanna",
        "Agade"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "272-280. And before Utu on that very day, so it was! On its canal bank tow-paths, the grass grew long. On its highways laid for waggons, the grass of mourning grew. Moreover, on its tow-paths built up with canal sediment, …… wild rams (?) and alert snakes of the mountains allowed no one to pass. On its plains, where fine grass grew, now the reeds of lamentation grew. Agade's flowing fresh water flowed as brackish water. When someone decided,  \"I will dwell in that city!\", he could not enjoy the pleasures of a dwelling place. When someone decided,  \"I will rest in Agade!\", he could not enjoy the pleasures of a resting place!",
      "properNames": [
        "Utu",
        "Agade's",
        "Agade"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "281. Inana be praised for the destruction of Agade!",
      "properNames": [
        "Inana",
        "Agade"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "1-5. Enki took away its wisdom. An took up into the midst of heaven its fearsomeness that reaches heaven. Enki tore out its well-anchored holy mooring pole from the abzu. unknown no. of lines missing",
      "properNames": [
        "Enki",
        "An"
      ],
      "missingText": [
        "unknown no. of lines missing"
      ]
    },
    {
      "lineNumber": "2",
      "text": "1-3. Naram-Suen saw in a nocturnal vision that he would make its future altogether unfavourable, that he would make its temples shake and would scatter its treasures! unknown no. of lines missing",
      "properNames": [
        "Naram-Suen",
        "Suen"
      ],
      "missingText": [
        "unknown no. of lines missing"
      ]
    },
    {
      "lineNumber": "2",
      "text": "1. as if he were to change what had been inflicted (?) upon him.",
      "properNames": [],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "2-14. His subjects were dispersed, so he began a mobilization of his troops. Like a wrestler who is about to enter the great courtyard, he …… his hands towards (?) the E-kur. Like an athlete bent to start a contest, he treated the giguna as if it were worth only thirty shekels. Like a robber plundering the city, he set tall ladders against the temple. Though the temple was not a mountain of cedars, he had large axes cast to be used against it.  {(1 ms. adds 1 line:)  He had double-edged agasilig axes sharpened to be used against it.} As if they were for great tracts of land with  {huge} {(1 ms. has instead:)  wide} carp-filled waters, he cast large  {spades} {(1 ms. has instead:)  …… to be used against the E-kur}. He put spades against its roots. unknown no. of lines missing",
      "properNames": [
        "E-kur"
      ],
      "missingText": [
        "unknown no. of lines missing"
      ]
    },
    {
      "lineNumber": "2",
      "text": "1-3. and the Land was deprived of grain. He struck the Gate of Well-Being with the pickaxe and well-being was destroyed in all the foreign lands. unknown no. of lines missing",
      "properNames": [],
      "missingText": [
        "unknown no. of lines missing"
      ]
    },
    {
      "lineNumber": "2",
      "text": "1-4. 4 lines unclearunknown no. of lines missing",
      "properNames": [],
      "missingText": [
        "4 lines unclear",
        "unknown no. of lines missing"
      ]
    },
    {
      "lineNumber": "2",
      "text": "1-4. Noses were punched, heads were smashed (?), noses (?) were piled up, heads were sown like seeds. Heroes lay (?) dead on top of heroes, the blood of traitors ran (?) upon honest men.",
      "properNames": [],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "5-7. Enlil rebuilt his great sanctuaries into small reed (?) sanctuaries and from the south to the uplands …….",
      "properNames": [
        "Enlil"
      ],
      "missingText": []
    }
  ],
  "transliterations": [
    "© Copyright 2003, 2004, 2005, 2006 The ETCSL project, Faculty of Oriental Studies, University of OxfordUpdated 2006-12-19 by JE"
  ]
}