{
  "id": "t.2.1.6",
  "title": "The victory of Utu-ḫeĝal",
  "paragraphs": [
    {
      "lineNumber": "2",
      "text": "1-12. Enlil, the king of all the lands, entrusted Utu-ḫeĝal, the mighty man, the king of Unug, the king of the four quarters, the king whose orders cannot be countermanded, with wiping out the name of Gutium, the fanged (?) snake of the mountains, who acted with violence against the gods, who carried off the kingship of Sumer to foreign lands, who filled Sumer with wickedness, who took away spouses from the married and took away children from parents, who made wickedness and violence normal in the Land.",
      "properNames": [
        "Enlil",
        "Utu-ḫeĝal",
        "Utu",
        "Unug",
        "Gutium",
        "Sumer"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "13-16. He went to his lady, Inana, and prayed to her:  \"My lady, lioness in the battle, who butts the foreign lands, Enlil has entrusted me with bringing back the kingship to Sumer. May you be my help!\"",
      "properNames": [
        "Inana",
        "Enlil",
        "Sumer"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "17-23. The enemy troops established themselves everywere. Tirigan, the king of Gutium …… the mouths of the channels (?). Nobody came out of his city to face him; he already occupied both banks of the Tigris. In the south, in Sumer, he blocked the water from the fields, in the uplands he closed off the roads. Because of him the grass grew high on the highways of the land.",
      "properNames": [
        "Tirigan",
        "Gutium",
        "Tigris",
        "Sumer"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "24-34. But the king, endowed with power by Enlil, chosen by Inana with her  {(1 ms. adds:)  holy} heart -- Utu-ḫeĝal, the mighty man, came out from Unug to face him and set up camp (?) at the temple of Iškur. He addressed a speech to the citizens of his city:  \"Enlil has given Gutium to me and my lady Inana will be my help! Dumuzid-ama-ušumgal-ana has declared  \"It is a matter for me!\" and assigned Gilgameš, the son of Ninsumun, to me as a constable!\" The citizens of Unug and Kulaba rejoiced and followed him with one accord. He lined up his élite troops.",
      "properNames": [
        "Enlil",
        "Inana",
        "Utu-ḫeĝal",
        "Utu",
        "Unug",
        "Iškur",
        "Gutium",
        "Dumuzid-ama-ušumgal-ana",
        "Gilgameš",
        "Ninsumun",
        "Kulaba"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "35-39. After departing from the temple of Iškur, on the fourth day he set up camp (?) in Naĝsu on the Surungal canal, and on the fifth day he set up camp (?) at the shrine at Ili-tappê. He captured Ur-Ninazu and Nabi-Enlil, generals of Tirigan sent as envoys to Sumer, and put them in handcuffs.",
      "properNames": [
        "Iškur",
        "Naĝsu",
        "Surungal",
        "Ili-tappê",
        "Ur-Ninazu",
        "Ninazu",
        "Nabi-Enlil",
        "Enlil",
        "Tirigan",
        "Sumer"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "40-50. After departing from the shrine at Ili-tappê, on the sixth day he set up camp (?) at Karkara. He went to Iškur and prayed to him:  \"O Iškur, Enlil has provided me with weapons, may you be my help!\" In the middle of that night, …… he departed (?) and above Adab he went to the rising (?) Utu and prayed to him:  \"O Utu, Enlil has given Gutium to me, may you be my help!\" He laid a trap (?) there behind the Gutian. Utu-ḫeĝal, the mighty man, defeated their generals.",
      "properNames": [
        "Ili-tappê",
        "Karkara",
        "Iškur",
        "Enlil",
        "Adab",
        "Utu",
        "Gutium",
        "Utu-ḫeĝal"
      ],
      "missingText": []
    },
    {
      "lineNumber": "2",
      "text": "51-62. Then Tirigan the king of Gutium ran away alone on foot. He thought himself safe in Dabrum, where he fled to save his life; but since the people of Dabrum knew that Utu-ḫeĝal was a king endowed with power by Enlil, they did not let Tirigan go, and an envoy of Utu-ḫeĝal arrested Tirigan together with his wife and children in Dabrum. He put handcuffs and a blindfold on him. Before Utu, Utu-ḫeĝal made him lie at his feet and placed his foot on his neck. He made Gutium, the fanged (?) snake of the mountains drink again from the crevices (?), he ……, he …… and he …… boat. He brought back the kingship of Sumer.",
      "properNames": [
        "Tirigan",
        "Gutium",
        "Dabrum",
        "Utu-ḫeĝal",
        "Utu",
        "Enlil",
        "Sumer"
      ],
      "missingText": []
    }
  ],
  "transliterations": [
    "© Copyright 2003, 2004, 2005, 2006 The ETCSL project, Faculty of Oriental Studies, University of OxfordUpdated 2006-12-19 by JE"
  ]
}