{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": true
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": null,
  "decoder": {
    "type": "WordPiece",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
    "[MASK]": 4,
      "the": 5,
      "and": 6,
      "to": 7,
      "of": 8,
      "a": 9,
      "in": 10,
      "that": 11,
      "is": 12,
      "was": 13,
      "he": 14,
      "for": 15,
      "it": 16,
      "with": 17,
      "as": 18,
      "his": 19,
      "on": 20,
      "be": 21,
      "at": 22,
      "by": 23,
      "i": 24,
      "this": 25,
      "had": 26,
      "not": 27,
      "are": 28,
      "but": 29,
      "from": 30,
      "or": 31,
      "have": 32,
      "an": 33,
      "they": 34,
      "which": 35,
      "one": 36,
      "you": 37,
      "were": 38,
      "her": 39,
      "all": 40,
      "she": 41,
      "there": 42,
      "would": 43,
      "their": 44,
      "we": 45,
      "him": 46,
      "been": 47,
      "has": 48,
      "when": 49,
      "who": 50,
      "will": 51,
      "more": 52,
      "if": 53,
      "no": 54,
      "out": 55,
      "so": 56,
      "said": 57,
      "what": 58,
      "up": 59,
      "its": 60,
      "about": 61,
      "into": 62,
      "than": 63,
      "them": 64,
      "can": 65,
      "only": 66,
      "other": 67,
      "new": 68,
      "some": 69,
      "could": 70,
      "time": 71,
      "these": 72,
      "two": 73,
      "may": 74,
      "then": 75,
      "do": 76,
      "first": 77,
      "any": 78,
      "my": 79,
      "now": 80,
      "such": 81,
      "like": 82,
      "our": 83,
      "over": 84,
      "man": 85,
      "me": 86,
      "even": 87,
      "most": 88,
      "made": 89,
      "after": 90,
      "also": 91,
      "did": 92,
      "many": 93,
      "before": 94,
      "must": 95,
      "through": 96,
      "back": 97,
      "years": 98,
      "where": 99,
      "much": 100
    }
  }
}