{
  "recipes": [
    {
      "url": "bobotie",
      "name": "Bobotie",
      "countryCode": "ZA",
      "countryName": "South Africa",
      "description": "Spiced minced meat baked with an egg-based topping.",
      "ingredients": [
        "1 lb ground beef",
        "1 onion, chopped",
        "1 clove garlic",
        "1 tbsp curry powder",
        "1 slice bread, soaked in milk",
        "2 eggs"
      ],
      "directions": [
        "Brown onion, garlic, then mince. Add curry.",
        "Combine soaked bread. Spread in dish.",
        "Beat eggs with remaining milk, pour on top.",
        "Bake until set."
      ],
      "servingSize": "4 servings"
    },
    {
      "url": "borscht",
      "name": "Borscht",
      "countryCode": "UA",
      "countryName": "Ukraine",
      "description": "Beet-based soup with root vegetables, often inexpensive to make.",
      "ingredients": [
        "3 beets, peeled and grated",
        "2 carrots, chopped",
        "2 potatoes, diced",
        "1 onion, chopped",
        "4 cups broth",
        "Salt and pepper"
      ],
      "directions": [
        "Sauté onion, add carrots and beets.",
        "Add potatoes, broth, and simmer until tender.",
        "Season and serve with sour cream if available."
      ],
      "servingSize": "6 servings"
    },
    {
      "url": "cassoulet",
      "name": "Cassoulet",
      "countryCode": "FR",
      "countryName": "France",
      "description": "A rustic bean stew with inexpensive cuts of meat or sausages.",
      "ingredients": [
        "1 lb white beans, soaked",
        "1 onion, chopped",
        "2 carrots, chopped",
        "1 lb sausage or leftover meat",
        "4 cups broth",
        "2 cloves garlic"
      ],
      "directions": [
        "Sauté onions and carrots. Add beans and broth.",
        "Simmer until beans soften.",
        "Add sliced sausage or meat. Season to taste.",
        "Bake in an oven-safe dish until bubbly."
      ],
      "servingSize": "6 servings"
    },
    {
      "url": "colcannon",
      "name": "Colcannon",
      "countryCode": "IE",
      "countryName": "Ireland",
      "description": "Mashed potatoes mixed with kale or cabbage and butter.",
      "ingredients": [
        "2 lbs potatoes, peeled",
        "2 cups chopped kale or cabbage",
        "1/2 cup milk",
        "4 tbsp butter",
        "1 tsp salt",
        "1/2 tsp pepper"
      ],
      "directions": [
        "Boil potatoes until soft. Drain and mash.",
        "In a separate pan, cook kale with a bit of butter.",
        "Add kale and milk to mashed potatoes, mix well.",
        "Season with salt, pepper, and extra butter on top."
      ],
      "servingSize": "4 servings"
    },
    {
      "url": "congee",
      "name": "Congee",
      "countryCode": "CN",
      "countryName": "China",
      "description": "Rice porridge often eaten for breakfast or when feeling unwell.",
      "ingredients": [
        "1 cup rice",
        "8 cups water or stock",
        "1 tsp salt",
        "Optional toppings: green onion, soy sauce, shredded chicken"
      ],
      "directions": [
        "Rinse rice and place in a pot with water or stock.",
        "Bring to a boil, then reduce heat and simmer.",
        "Cook, stirring occasionally, until it reaches porridge consistency, about 1 hour.",
        "Season and top as desired."
      ],
      "servingSize": "4 servings"
    },
    {
      "url": "cornbread",
      "name": "Cornbread",
      "countryCode": "US",
      "countryName": "United States of America",
      "description": "Simple cornmeal bread often served with beans or soups.",
      "ingredients": [
        "1 cup cornmeal",
        "1 cup all-purpose flour",
        "1 tbsp baking powder",
        "1 tsp salt",
        "1 cup milk",
        "1 egg",
        "2 tbsp melted butter"
      ],
      "directions": [
        "Preheat oven to 400°F (200°C).",
        "Combine dry ingredients. Beat egg with milk, then stir in melted butter.",
        "Mix wet and dry together. Pour into greased pan.",
        "Bake for 20-25 minutes."
      ],
      "servingSize": "6 servings"
    },
    {
      "url": "dal-tadka",
      "name": "Dal Tadka",
      "countryCode": "IN",
      "countryName": "India",
      "description": "A simple lentil stew flavored with spices and a ghee tempering.",
      "ingredients": [
        "1 cup split lentils (toor dal)",
        "4 cups water",
        "1 onion, chopped",
        "1 tomato, chopped",
        "1 tsp turmeric",
        "Hot oil/ghee with cumin, garlic"
      ],
      "directions": [
        "Boil lentils with water, onion, tomato, turmeric until soft.",
        "Mash gently. Fry cumin and garlic in hot oil or ghee.",
        "Pour tempering into dal. Serve hot."
      ],
      "servingSize": "4 servings"
    },
    {
      "url": "feijoada",
      "name": "Feijoada",
      "countryCode": "BR",
      "countryName": "Brazil",
      "description": "Black bean stew with inexpensive cuts of pork or beef.",
      "ingredients": [
        "1 lb black beans, soaked",
        "1 lb mixed pork cuts (some smoked)",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "Bay leaf, salt, and pepper",
        "6 cups water or broth"
      ],
      "directions": [
        "Brown the pork. Remove excess fat.",
        "Sauté onion, garlic, then add beans.",
        "Throw pork back in, add water, bay leaf.",
        "Simmer 2-3 hours until beans are tender."
      ],
      "servingSize": "6 servings"
    },
    {
      "url": "fresh-tomato-soup",
      "name": "Fresh Tomato Soup",
      "countryCode": "US",
      "countryName": "United States of America",
      "description": "Bright and fresh tomato soup with a hint of spice.",
      "ingredients": [
        "3 medium tomatoes, peeled and quartered",
        "1 1/2 cups water",
        "1/2 cup chopped onion (1 medium)",
        "1/2 cup chopped celery (1 stalk)",
        "1/2 6 ounce can (1/3 cup) tomato paste",
        "2 tablespoons snipped fresh cilantro or basil",
        "2 teaspoons instant chicken bouillon granules",
        "1 teaspoon sugar(optional)",
        "Few dashes bottled hot pepper sauce",
        "Snipped fresh cilantro or basil (optional)"
      ],
      "directions": [
        "If desired, seed the tomatoes. In a large saucepan combine tomatoes, water, onion, celery, tomato paste, the 2 tablespoons cilantro, bouillon granules, sugar, and hot pepper sauce. Bring to boiling; reduce heat. Simmer, covered, about 20 minutes or until celery and onion are very tender. Remove from heat and cool for 10 minutes.",
        "Place half of the tomato mixture in a blender or food processor. Cover and blend or process until smooth. Repeat with the remaining mixture. Return all to the saucepan; heat through. If desired, garnish with additional cilantro."
      ],
      "servingSize": "4 servings (4 cups)"
    },
    {
      "url": "gallo-pinto",
      "name": "Gallo Pinto",
      "countryCode": "CR",
      "countryName": "Costa Rica",
      "description": "Rice and beans staple often eaten for breakfast.",
      "ingredients": [
        "2 cups cooked rice",
        "1 cup cooked black beans",
        "1 onion, diced",
        "1 red bell pepper, diced",
        "Cilantro (optional)"
      ],
      "directions": [
        "Sauté onion and pepper.",
        "Add beans, then stir in cooked rice.",
        "Season. Garnish with cilantro."
      ],
      "servingSize": "4 servings"
    },
    {
      "url": "kartoffelsalat",
      "name": "German Potato Salad",
      "countryCode": "DE",
      "countryName": "Germany",
      "description": "Authentic german potato sales, warm a savory.",
      "ingredients": [
        "3 cups diced peeled potatoes",
        "4 slices bacon",
        "1 small onion, diced",
        "1/4 cup white vinegar",
        "2 tablespoons water",
        "3 tablespoons white sugar",
        "1 teaspoon salt",
        "1/8 teaspoon ground black pepper"
      ],
      "directions": [
        "Place the potatoes into a pot, and fill with enough water to cover. Bring to a boil, and cook for about 10 minutes, or until easily pierced with a fork. Drain, and set aside to cool.",
        "Place the bacon in a large deep skillet over medium-high heat. Fry until browned and crisp, turning as needed. Remove from the pan and set aside.",
        "Add onion to the bacon grease, and cook over medium heat until browned. Add the vinegar, water, sugar, salt and pepper to the pan. Bring to a boil, then add the potatoes and parsley. Crumble in half of the bacon. Heat through, then transfer to a serving dish. Crumble the remaining bacon over the top, and serve warm."
      ]
    },
    {
      "url": "german-speatzle-dumplings",
      "name": "German Spätzle Dumplings",
      "countryCode": "DE",
      "countryName": "Germany",
      "description": "These are traditional German dumplings that are super tasty. They are different than the dumplings we see in American or Chinese cooking. They make a wonder quick side-dish to a German meal or anytime. For an extra tasty treat, skip the butter and use few pieces of bacon and the bacon grease that it produces! Mahlzeit!",
      "ingredients": [
        "1 cup all-purpose flour",
        "1/4 cup milk",
        "2 eggs",
        "1/2 teaspoon ground nutmeg",
        "1 pinch freshly ground white pepper",
        "1/2 teaspoon salt",
        "1 gallon hot water",
        "2 tablespoons butter",
        "2 tablespoons chopped fresh parsley"
      ],
      "directions": [
        "Mix together flour, salt, white pepper, and nutmeg. Beat eggs well, and add alternately with the milk to the dry ingredients. Mix until smooth.",
        "Press dough through spaetzle maker, or a large holed sieve or metal grater.",
        "Drop a few at a time into simmering liquid. Cook 5 to 8 minutes. Drain well.",
        "Saute cooked spaetzle in butter or margarine. Sprinkle chopped fresh parsley on top, and serve."
      ]
    },
    {
      "url": "injera",
      "name": "Injera",
      "countryCode": "ET",
      "countryName": "Ethiopia",
      "description": "Sourdough flatbread made from teff flour.",
      "ingredients": [
        "2 cups teff flour",
        "3 cups water",
        "Pinch of salt",
        "Starter (optional)"
      ],
      "directions": [
        "Mix flour and water to form batter. Let ferment 2-3 days.",
        "Stir in salt. Pour thin layer on a hot griddle.",
        "Cook until holes form on top, do not flip.",
        "Remove once edges lift easily."
      ],
      "servingSize": "6 servings"
    },
    {
      "url": "jamaican-jerk",
      "name": "Jamaican Jerk",
      "countryCode": "JM",
      "countryName": "Jamaica",
      "description": "Jerk is a style of cooking native to Jamaica in which meats are dry-rubbed or wet marinated with a very hot spice mixture called Jamaican jerk spice. Jerk seasoning is traditionally applied to pork and chicken. Modern recipes also apply jerk spice mixes to fish, shrimp, shellfish, beef, sausage, and tofu.",
      "ingredients": [
        "1 big bunch of green onions or a couple smaller bunches",
        "2 tbsp soy sauce",
        "2 tbsp vegetable oil",
        "1 tbsp salt",
        "Juice of 1 lime",
        "1/2 tsp dried thyme, or 1 tablespoon fresh thyme",
        "1 tbsp allspice",
        "1-10 scotch bonnets (traditional - I use jalapeno all the time with great success)."
      ],
      "history": [
        "The recipes I have included here for jerked meats and poultry are not the authentic jerk recipes as they were handed down from the very old times. Before their enslavement and transportation to far off lands, the Cormantee hunters of West Africa used this to preserve their meats they collected on their hunts. This would have extended the duration the meat was viable as food, plus adding to the spiciness and flavor of the meat. Modern people, checking their mobile phone for FDA recalls on food products would be appalled at the way meat was cured in the past yet these old way were extremely affective in keep meats weeks if not months into the future.",
        "To keep their pork and chicken in the warm Caribbean islands, the use the method of jerking meats, turning them into jerky which extends shelf life by removing most of the water and fat from the meat. Bacteria that are common in meats required water to exist. In the jerky process these components are removed, no water, no fat, no bugs, just tasty meat. The term jerk is said to come from the word charqui, a Spanish term for jerked or dried meat, which eventually became jerky in English. In my best American accent, 'Did he say jher-key, it sure is tasty whatever it is.'",
        "Due to influences of the world throughout jamaican history the last 300 years; the flavors of the British, Dutch, French, Spanish, East Indian, West African, Portuguese and Chinese, added to the falor that Jamacia had developed as its own. On the little island of Jamaica, bathed in the waters of the warm Caribbean seas, smells of allspice and other spices along with grilling meats and birds, waft through the air to this day.",
        "Jamaica allspice is a topic all to its own, wonderfully aromatic it is the heart of the Jamaican jerk aroma. With indigenous plant, the Mayan indigenous used to send their leaders off into the next world. It certainly has a divinity quality and will impart a wonderfully rich flavor into your meats. Jamaican allspice goes well with black pepper, bourbon, cardamom, cinnamon, cloves, coriander, cumin, fennel seed, ginger, nutmeg, orange and vanilla.",
        "Origins of this wonderful marinade and rub traces their roots back to the days on the west African plains, food dried by Maroon hunters, long into the distant past before their enslavement and displacement in 1655. Jamaica has a very rich and wonderful culture, a world-renowned tourist destination, as well as music that literally changed the word. In recent years our Jamaican brothers and sister have have had hard times still fighting for their own personal freedoms. I hope you remember to think of them as you treat your pork or chicken to some amazing flavors."
      ],
      "directions": [
        "Boil your pork ribs or chicken for 20 minutes and let cool before introducing the marinade. I like to use zip-lock plastic freezer bags to keep the mess down.",
        "Combine all other the ingredients in a bowl and transfer to the cooled meat. Combine all these ingredients, into a plastic bag preferably and marinate a cut up chicken or rack of pork ribs for a delicious meal. Marinate for at least 8 hours up to 24 hours to really permeate the flavor into the meat or poultry. Be very careful, this dish is very hot, adjust it accordingly for you favorite spiciness level. Use the lime halves for barbecuing, placing them on top of the meat to allow more of an indirect heat.",
        "Barbecue your meats at least an hour over a medium indirect heat. I prefer the the meats and poultry are blackened well, the darker the best but most find a bitterness in the taste. Either way the herb mixture, mixed with the fire, releases a wonderful smoke that will flavor your dish."
      ]
    },
    {
      "url": "minestrone",
      "name": "Minestrone",
      "countryCode": "IT",
      "countryName": "Italy",
      "description": "Hearty vegetable soup with beans and pasta.",
      "ingredients": [
        "1 onion, chopped",
        "2 carrots, sliced",
        "1 can beans, drained",
        "1 cup diced tomatoes",
        "1/2 cup small pasta"
      ],
      "directions": [
        "Sauté onion, carrots. Add tomatoes, beans, water or stock.",
        "Simmer, add pasta. Cook until pasta is tender.",
        "Season with salt and pepper."
      ],
      "servingSize": "6 servings"
    },
    {
      "url": "miso-soup",
      "name": "Miso Soup",
      "countryCode": "JP",
      "countryName": "Japan",
      "description": "Simple broth made from miso paste and dashi with tofu or seaweed.",
      "ingredients": [
        "4 cups dashi broth",
        "3 tbsp miso paste",
        "1/2 cup tofu, cubed",
        "2 tbsp chopped green onions"
      ],
      "directions": [
        "Warm dashi. Do not boil.",
        "Dissolve miso paste in a small bowl with some warm broth.",
        "Return mixture to pot, add tofu.",
        "Garnish with green onions."
      ],
      "servingSize": "4 servings"
    },
    {
      "url": "ratatouille",
      "name": "Ratatouille",
      "countryCode": "FR",
      "countryName": "France",
      "description": "Stewed vegetable dish using affordable produce.",
      "ingredients": [
        "1 eggplant, diced",
        "2 zucchinis, sliced",
        "1 onion, chopped",
        "2 bell peppers, chopped",
        "2 tomatoes, chopped"
      ],
      "directions": [
        "Sauté onion, peppers, and eggplant. Add tomatoes, zucchini.",
        "Simmer until tender. Season to taste."
      ],
      "servingSize": "6 servings"
    },
    {
      "url": "shepherds-pie",
      "name": "Shepherd's Pie",
      "countryCode": "GB",
      "countryName": "United Kingdom",
      "description": "Minced meat and vegetables topped with mashed potatoes.",
      "ingredients": [
        "1 lb ground lamb or beef",
        "1 onion, chopped",
        "Mixed vegetables",
        "Mashed potatoes for topping",
        "Salt, pepper"
      ],
      "directions": [
        "Brown meat with onion. Add vegetables.",
        "Transfer to baking dish, top with mashed potatoes.",
        "Bake at 375°F (190°C) until golden."
      ],
      "servingSize": "6 servings"
    },
    {
      "url": "tabbouleh",
      "name": "Tabbouleh",
      "countryCode": "LB",
      "countryName": "Lebanon",
      "description": "Bulgur wheat salad with tomatoes, parsley, and mint.",
      "ingredients": [
        "1 cup bulgur wheat",
        "2 tomatoes, diced",
        "1 bunch parsley, chopped",
        "Fresh mint, chopped",
        "2 tbsp olive oil",
        "Juice of 1 lemon"
      ],
      "directions": [
        "Soak bulgur in hot water until soft. Drain.",
        "Mix with diced tomatoes, parsley, mint.",
        "Add olive oil and lemon juice. Season to taste."
      ],
      "servingSize": "4 servings"
    },
    {
      "url": "torsk",
      "name": "Torsk",
      "countryCode": "NO",
      "countryName": "Norway",
      "description": "Known as poor man's lobster, dipped in butter this is super tasty!",
      "ingredients": [
        "6 (6 ounce) fillets cod",
        "6 cups water",
        "1 cup white sugar",
        "2 tablespoons salt",
        "1 1/2 cups butter, melted"
      ],
      "directions": [
        "Preheat broiler. Lightly grease a cookie sheet.",
        "Place the fish in a large saucepan. Mix together the water, sugar, and salt. Pour the water-mixture over the fish. The water-mixture should fully cover the fish, if it doesn't add more water. Bring the water to a boil over a medium-high heat. Boil for 3 to 5 minutes.",
        "Remove fillets from water, and blot on paper towels to remove excess water. Brush with 6 tablespoons melted butter, and sprinkle with paprika.",
        "Broil for 8 to 10 minutes per inch of thickness, or until the fillets are golden brown. Serve with the remaining melted butter"
      ]
    },
    {
      "url": "tortillas-de-maiz",
      "name": "Tortillas de Maíz",
      "countryCode": "MX",
      "countryName": "Mexico",
      "description": "Corn tortillas made simply with masa harina and salt.",
      "ingredients": [
        "2 cups masa harina",
        "1/2 tsp salt",
        "1 1/2 cups warm water"
      ],
      "directions": [
        "Mix masa harina and salt in a bowl.",
        "Gradually add water, kneading until dough is soft.",
        "Divide into balls. Press into tortillas.",
        "Cook on a hot griddle for about 30 seconds each side."
      ],
      "servingSize": "12 tortillas"
    }
  ]
}